package com.example.chankayaneeti;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;

import android.content.ClipboardManager;
import android.content.Intent;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuItem;
import android.view.View;
import android.widget.TextView;
import android.widget.Toast;

import com.google.android.material.floatingactionbutton.FloatingActionButton;

public class Quotes extends AppCompatActivity {
    TextView rt,sto,hd;
    int current=0;
    String story[] = {"१.  तीनो लोको के स्वामी सर्वशक्तिमान भगवान विष्णु  को नमन करते हुए मै एक राज्य के लिए  नीति  शास्त्र  के सिद्धांतों  को कहता हूँ.  मै यह सूत्र अनेक शास्त्रों का आधार ले कर कह रहा हूँ।  ", "2. जो व्यक्ति शास्त्रों के सूत्रों का अभ्यास करके ज्ञान ग्रहण करेगा उसे अत्यंत वैभवशाली कर्तव्य के सिद्धांत ज्ञात होगे। उसे इस बात का पता चलेगा कि किन बातों का अनुशरण करना चाहिए और किनका नहीं। उसे अच्छाई और बुराई का भी ज्ञात होगा और अंततः उसे सर्वोत्तम का भी ज्ञान होगा।  ", "३. इसलिए लोगो का भला करने के लिए मै उन बातों को कहूंगा जिनसे लोग सभी चीजों को सही परिपेक्ष्य मे देखेगे।  ", "४. एक पंडित भी घोर कष्ट में आ जाता है यदि वह किसी मुर्ख को उपदेश देता है, यदि वह एक दुष्ट पत्नी का पालन-पोषण करता है या किसी दुखी व्यक्ति के साथ अतयंत घनिष्ठ सम्बन्ध बना लेता है.", "५. दुष्ट पत्नी, झूठा मित्र, बदमाश नौकर और सर्प के साथ निवास साक्षात् मृत्यु के समान है।  ", "६ . व्यक्ति को आने वाली मुसीबतो से निबटने के लिए धन संचय करना चाहिए। उसे धन-सम्पदा त्यागकर भी पत्नी की सुरक्षा करनी चाहिए। लेकिन यदि आत्मा की सुरक्षा की बात आती है तो उसे धन और पत्नी दोनो को तुक्ष्य समझना चाहिए। ", "७ .भविष्य में आने वाली मुसीबतो के लिए धन एकत्रित करें। ऐसा ना सोचें की धनवान व्यक्ति को मुसीबत कैसी? जब धन साथ छोड़ता है तो संगठित धन भी तेजी से घटने लगता है।  ", "८.  उस देश मे निवास न करें जहाँ आपकी कोई ईज्जत नहीं हो, जहा आप रोजगार नहीं कमा सकते, जहा आपका कोई मित्र नहीं और जहा आप कोई ज्ञान आर्जित नहीं कर सकते।  ", "९ . ऐसे जगह एक दिन भी निवास न करें जहाँ निम्नलिखित पांच ना हो: एक धनवान व्यक्ति , एक ब्राह्मण जो वैदिक शास्त्रों में निपुण हो, एक राजा, एक नदी , और एक चिकित्सक।  ", "१० .  बुद्धिमान व्यक्ति को ऐसे देश में कभी नहीं जाना चाहिए जहाँ : रोजगार कमाने का कोई माध्यम ना हो, जहा लोगों को किसी बात का भय न हो, जहा लोगो को किसी बात की लज्जा न हो, जहा लोग बुद्धिमान न हो, और जहाँ लोगो की वृत्ति दान धरम करने की ना हो।  ", "११ . नौकर की परीक्षा तब करें जब वह कर्त्तव्य का पालन  न कर रहा हो, रिश्तेदार की परीक्षा तब करें जब आप मुसीबत मे घिरें हों, मित्र की परीक्षा विपरीत परिस्थितियों मे करें, और जब आपका वक्त अच्छा न चल रहा हो तब पत्नी की परीक्षा करे।  ", "१२ . अच्छा मित्र वही है जो हमे निम्नलिखित परिस्थितियों में  नहीं त्यागे: आवश्यकता पड़ने पर, किसी दुर्घटना पड़ने पर, जब अकाल पड़ा हो, जब युद्ध चल रहा हो, जब हमे राजा के दरबार मे जाना पड़े, और जब हमे समशान घाट जाना पड़े।  ", "१३ . जो व्यक्ति कसी नाशवंत चीज के लिए कभी नाश नहीं होने वाली चीज को छोड़ देता है, तो उसके हाथ से अविनाशी वस्तु तो चली ही जाती है और इसमे कोई संदेह नहीं की नाशवान को भी वह खो देता है।  ", "१४ . एक बुद्धिमान व्यक्ति को किसी इज्जतदार घर की अविवाहित कन्या से किस वयंग होने के बावजूद भी विवाह करना चाहिए। उसे किसी हीन घर की अत्यंत सुन्दर स्त्री से भी विवाह नहीं करनी चाहिए। शादी-विवाह हमेशा बराबरी के घरो मे ही उिचत होता है।  ", "१५ . इन ५ पर कभी विश्वास ना करें : १. नदियां, २. जिन व्यक्तियों के पास अश्त्र-शस्त्र हों, ३. नाख़ून और सींग वाले पशु, ४. औरतें (यहाँ संकेत भोली सूरत की तरफ है, बहने बुरा न माने ) ५. राज घरानो के लोगो पर।  ", "१६ . अगर हो सके तो विष मे से भी अमृत निकाल लें, यदि सोना गन्दगी में भी पड़ा हो तो उसे उठाये, धोएं और अपनाये, निचले कुल मे जन्म लेने वाले से भी सर्वोत्तम ज्ञान ग्रहण करें, उसी तरह यदि कोई बदनाम घर की कन्या भी महान गुणो से संपनन है और आपको कोई सीख देती है तो गहण करे.", "१७ .  महिलाओं में पुरुषों कि अपेक्षा: भूख दो गुना, लज्जा चार गुना, साहस छः गुना, और काम आठ गुना होती है।","1. झूठ बोलना, कठोरता, छल करना, बेवकूफी करना, लालच, अपवित्रता  और निर्दयता ये औरतो के कुछ नैसर्गिक दुर्गुण है।  ", "2.भोजन के योग्य पदार्थ और भोजन करने की क्षमता, सुन्दर स्त्री और उसे भोगने के लिए काम शक्ति, पर्याप्त धनराशी तथा दान देने की भावना - ऐसे संयोगों का होना सामान्य तप का फल नहीं है।", "३. उस व्यक्ति ने धरती पर ही स्वर्ग को पा लिया : १. जिसका पुत्र आज्ञांकारी है, २. जिसकी पत्नी उसकी इच्छा के अनुरूप व्यव्हार करती है, ३. जिसे अपने धन पर संतोष  है।", "४. पुत्र वही है जो पिता का कहना मानता हो, पिता वही है जो पुत्रों का पालन-पोषण करे, मित्र वही है जिस पर आप विश्वास कर सकते हों और पत्नी वही है जिससे सुख प्राप्त हो। ", "५. ऐसे लोगों से बचे जो आपके मुह पर तो मीठी बातें करते हैं, लेकिन आपके पीठ पीछे आपको बर्बाद करने की योजना बनाते है, ऐसा करने वाले तो उस विष के घड़े के समान है जिसकी उपरी सतह दूध से भरी है। ", "६. एक बुरे मित्र पर तो कभी विश्वास ना करे। एक अच्छे मित्र पर भी विश्वास ना करें। क्यूंकि यदि ऐसे लोग आपसे रुष्ट होते है तो आप के सभी राज से पर्दा खोल देंगे। ", "७. मन में सोंचे हुए कार्य को किसी के सामने प्रकट न करें बल्कि मनन पूर्वक उसकी सुरक्षा करते हुए उसे कार्य में परिणत कर दें। ", "८. मुर्खता दुखदायी है, जवानी भी दुखदायी है,लेकिन इन सबसे कहीं ज्यादा दुखदायी किसी दुसरे के घर जाकर उसका अहसान लेना है। ", "९. हर पर्वत पर माणिक्य नहीं होते,  हर हाथी के सर पर मणी नहीं होता, सज्जन पुरुष भी हर जगह नहीं होते और हर वन मे चन्दन के वृक्ष भी नहीं होते हैं। ", "१०. बुद्धिमान पिता को अपने पुत्रों को शुभ गुणों की सीख देनी चाहिए क्योंकि नीतिज्ञ और ज्ञानी व्यक्तियों की ही कुल में पूजा होती है। ", "११. जो माता व् पिता अपने बच्चों को शिक्षा नहीं देते है वो तो बच्चों के शत्रु के सामान हैं। क्योंकि वे विद्याहीन बालक विद्वानों की सभा में वैसे ही तिरस्कृत किये जाते हैं जैसे हंसो की सभा मे बगुले। ", "१२. लाड-प्यार से बच्चों मे गलत आदते ढलती है, उन्हें कड़ी शिक्षा देने से वे अच्छी आदते सीखते है, इसलिए बच्चों को जरुरत पड़ने पर दण्डित करें, ज्यादा लाड ना करें। ", "१३. ऐसा एक भी दिन नहीं जाना चाहिए जब आपने एक श्लोक, आधा श्लोक, चौथाई श्लोक, या श्लोक का केवल एक अक्षर नहीं सीखा, या आपने दान, अभ्यास या कोई पवित्र कार्य नहीं किया। ", "१४. पत्नी का वियोग होना, आपने ही लोगो से बे-इजजत होना, बचा हुआ ऋण, दुष्ट राजा की सेवा करना, गरीबी एवं दरिद्रों की सभा - ये छह बातें शरीर को बिना अग्नि के ही जला देती हैं। ", "१५.  नदी के किनारे वाले वृक्ष, दुसरे व्यक्ति के घर मे जाने अथवा रहने वाली स्त्री एवं बिना मंत्रियों का राजा - ये सब निश्चय ही शीघ्र नस्ट हो जाते हैं। ", "१६. एक ब्राह्मण का बल तेज और विद्या है, एक राजा का बल उसकी सेना मे है, एक वैशय का बल उसकी दौलत मे है तथा एक शुद्र का बल उसकी सेवा परायणता मे है। ", "१७. वेश्या को निर्धन व्यक्ति को  त्याग देना चाहिए, प्रजा को पराजित राजा को त्याग देना चाहिए, पक्षियों को फलरहित वृक्ष त्याग देना चाहिए एवं अतिथियों को भोजन करने के पश्चात् मेजबान के घर से निकल देना चाहिए। ", "१८. ब्राह्मण दक्षिणा मिलने के पश्चात् आपने यजमानो को छोड़ देते है, विद्वान विद्या प्राप्ति के बाद गुरु को छोड़ जाते हैं और पशु जले हुए वन को त्याग देते हैं। ", "१९. जो व्यक्ति दुराचारी, कुदृष्टि वाले, एवं बुरे स्थान पर रहने वाले मनुष्य के साथ मित्रता करता है, वह शीघ्र नष्ट हो जाता है। ", "२०. प्रेम और मित्रता बराबर वालों में अच्छी लगती है, राजा के यहाँ नौकरी करने वाले को ही सम्मान मिलता है, व्यवसायों में वाणिज्य सबसे अच्छा है, अवं उत्तम गुणों वाली स्त्री अपने घर में सुरक्षित रहती है।","1. इस दुनिया  मे ऐसा किसका घर है जिस पर कोई कलंक नहीं, वह कौन है जो रोग और दुख से मुक्त है.सदा सुख किसको रहता है?", "२. मनुष्य के कुल की ख्याति उसके आचरण से होती है, मनुष्य के बोल चल से उसके देश की ख्याति बढ़ती है, मान सम्मान उसके प्रेम को बढ़ता है, एवं उसके शारीर का गठन उसे भोजन से बढ़ता है. ", "३. लड़की का बयाह अच्छे खानदान मे करना चाहिए. पुत्र  को अचछी शिक्षा देनी चाहिए,  शत्रु को आपत्ति और कष्टों में डालना चाहिए, एवं मित्रों को धर्म कर्म में लगाना चाहिए.", "4. एक दुर्जन और एक सर्प मे यह अंतर है की साप तभी डंख मरेगा जब उसकी जान को खतरा हो लेकिन दुर्जन पग पग पर हानि पहुचने की कोशिश करेगा .", "५. राजा लोग अपने आस पास अच्छे कुल के लोगो को इसलिए रखते है क्योंकि ऐसे लोग ना आरम्भ मे, ना बीच मे और  ना ही  अंत मे साथ छोड़कर जाते है.", "६. जब प्रलय का समय आता है तो समुद्र भी अपनी मयारदा छोड़कर किनारों को छोड़ अथवा तोड़ जाते है, लेकिन सज्जन पुरुष प्रलय के सामान भयंकर आपत्ति अवं विपत्ति में भी आपनी मर्यादा नहीं बदलते.", "७. मूर्खो के साथ मित्रता नहीं रखनी चाहिए उन्हें त्याग देना ही उचित है, क्योंकि प्रत्यक्ष रूप से वे दो पैरों वाले पशु के सामान हैं,जो अपने  धारदार वचनो से वैसे ही हदय को छलनी करता है जैसे अदृश्य काँटा शारीर में घुसकर छलनी करता है .", "८. रूप और यौवन से सम्पन्न तथा कुलीन परिवार में जन्मा लेने पर भी विद्या हीन पुरुष पलाश के फूल के समान है जो सुन्दर तो है लेकिन खुशबु रहित है.", "९. कोयल की सुन्दरता उसके गायन मे है. एक स्त्री की सुन्दरता उसके अपने पिरवार के प्रति समर्पण मे है. एक बदसूरत आदमी की सुन्दरता उसके ज्ञान मे है तथा एक तपस्वी की सुन्दरता उसकी क्षमाशीलता मे है.", "१०. कुल की रक्षा के लिए  एक सदस्य का बिलदान दें,गाव की रक्षा के लिए एक कुल  का बिलदान  दें, देश  की रक्षा के लिए एक गाव का बिलदान  दें, आतमा की रक्षा के लिए देश का बिलदान  दें.", "११.जो उद्यमशील हैं, वे गरीब नहीं हो सकते, जो हरदम भगवान को याद करते है उनहे पाप नहीं छू सकता. जो मौन रहते है वो झगड़ों मे नहीं पड़ते. जो जागृत रहते है वो िनभरय होते है.", "12. आत्याधिक सुन्दरता के कारन सीताहरण हुआ, अत्यंत घमंड के कारन रावन का अंत हुआ,  अत्यधिक दान देने के कारन रजा बाली को बंधन में बंधना पड़ा, अतः सर्वत्र अति को त्यागना चाहिए.", "१3. शक्तिशाली लोगों के लिए कौनसा कार्य कठिन है ? व्यापारिओं के लिए कौनसा जगह दूर है, विद्वानों के लिए कोई देश विदेश नहीं है, मधुभाषियों का कोई शत्रु नहीं. ", "१४. जिस तरह सारा वन केवल एक ही पुष्प अवं सुगंध भरे  वृक्ष से महक जाता है उसी तरह एक ही गुणवान पुत्र  पुरे कुल का नाम बढाता है.", "१५. जिस प्रकार केवल एक सुखा हुआ जलता वृक्ष सम्पूर्ण वन को जला देता है उसी प्रकार एक ही कुपुत्र सरे कुल के मान, मर्यादा और प्रतिष्ठा को नष्ट कर देता है.", "१६. विद्वान एवं सदाचारी एक ही पुत्र के कारन सम्पूर्ण परिवार वैसे ही खुशहाल रहता है जैसे चन्द्रमा के निकालने पर रात्रि जगमगा उठती है.", "१७. ऐसे अनेक पुत्र किस काम के जो दुःख और निराशा पैदा करे. इससे तो वह एक ही पुत्र अच्छा है जो समपूणर घर को सहारा और शांित पदान करे.", "१८. पांच साल तक पुत्र को लाड एवं प्यार से पालन करना चाहिए, दस साल तक उसे छड़ी की मार से डराए. लेकिन जब वह १६ साल का हो जाए तो उससे मित्र के समान वयवहार करे.", " १९. वह व्यक्ति सुरक्षित रह सकता है जो नीचे दी हुई परिस्थितियां उत्पन्न होने पर भाग जाए. १. भयावह आपदा. २. विदेशी आक्रमण ३. भयंकर अकाल ४. दुष व्यक्ति का संग.", "२०. जो व्यक्ति निम्नलिखित बाते अर्जित नहीं करता वह बार बार जनम लेकर मरता है. १. धमर २. अर्थ ३. काम ४. मोक्ष", "२१. धन की देवी लक्ष्मी स्वयं वहां चली आती है जहाँ ... १. मूखो का सम्मान नहीं होता. २. अनाज का अचछे से भणडारण िकया जाता है. ३. पित, पत्नी मे आपस मे लड़ाई बखेड़ा नहीं होता है."};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quotes);


        //toolbar
        Toolbar toolbar=findViewById(R.id.toolbar);
        setSupportActionBar(toolbar);
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);



        sto=(TextView)findViewById(R.id.summary);


        sto.setText(story[current]);


        FloatingActionButton btnshare=(FloatingActionButton) findViewById(R.id.btnshare);
        btnshare.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                String s = sto.getText().toString();
                Intent sharingIntent = new Intent(android.content.Intent.ACTION_SEND);
                sharingIntent.setType("text/plain");
                sharingIntent.putExtra(android.content.Intent.EXTRA_TEXT, s);
                view.getContext().startActivity(Intent.createChooser(sharingIntent, "Share Story via"));
            }
        });

    }

    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        getMenuInflater().inflate(R.menu.menu_main,menu);
        return true;
    }

    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        switch (item.getItemId()){
            case R.id.btncopy:
                ClipboardManager clipboard = (ClipboardManager) getSystemService(CLIPBOARD_SERVICE);
                clipboard.setText(sto.getText());
                Toast.makeText(getApplicationContext(), "Message copied",
                        Toast.LENGTH_LONG).show();
                break;
        }
        return super.onOptionsItemSelected(item);
    }

    public void next(View view){
        if(current < 57) {
            current++;
            sto.setText(story[current]);
        }
    }

    public void prev(View view){
        if(current > 0) {
            current--;
            sto.setText(story[current]);

        }
    }

}

