package com.example.chanakya;

import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.view.Window;
import android.view.WindowManager;
import android.widget.AdapterView;
import android.widget.ListView;
import android.widget.SimpleAdapter;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;

public class MainActivity extends AppCompatActivity {
    int geti;
    int len;
    ListView listView011;
    // TextView txtStatus;
    String topic;
    String[] smsArray01 = {
            "आलू प्याज, टमाटर को काट लें पोहा को धो कर नमक और हल्दी डाल कर रखे\n" +
                    "  \n" +
                    "अब कढ़ाई में तेल गरम करें उसमें सरसों दाना और कढ़ी पत्ता डालें फिर आलू प्याज को भूनें\n" +
                    "  \n" +
                    "अब उसमें टमाटर डालें भूनें मटर और चीनी डाले फिर उसमें पोहा डाले उसको अच्छे से मिक्स कर ले नींबू डालें और अच्छे से मिक्स करें थोड़ी देर पकाए\n" +

                    "  \n" +
                    "और धनिया पत्ती डालें और सर्व करें",
            "उबले हुए आलू में सब चीजे डालके मिला ले।\n" +
                    " \n" +
                    "एक थाली या केक के मोल्ड में चिकनाई लगा के, आलू डालके दबा के एक समान कर ले । अब उसको क्लीन रैप लगाके फ्रिज में १ से २ घंटे के लिए रह दे।\n" +
                    "\n" +
                    "कवर करने के लिए मैदा और कॉर्न फ्लोर का पतला घोल तैयार करें।डीप बनाने की लिए सब मिला ले ।\n" +
                    "  \n" +
                    "अब फ्रिज में सें आलू की ट्रे निकाल के छुरी से एक जैसे लंबे टुकड़े काट ले ।\n" +
                    "  \n" +
                    "तेल गरम करने रखे । आलू के फिंगर को मैदे के घोल में डुबोकर ब्रेड क्रम में लपेट लें। अब गरम तेल में तेज आंच पे फिंगर को सुनहरा तल ले ।\n" +
                    " \n" +
                    "अब गरम गरम फिंगर डीप के साथ सर्व करें ।",
            "गाजर को कद्दूकस कर लें |प्याज़ व शिमला मिर्च को बारीक काट लें |दोनों तरह के चीज़ को भी कद्दूकस करें |\n" +
                    "  \n" +
                    "ब्रेड स्लाइस पर एक साइड बटर लगा कर धीमी आँच पर तवे पर सेकें |\n" +
                    "  \n" +
                    "अब सेंकी हुई साइड पर पिज़्ज़ा सॉस, केचप व मोज़ेरेला चीज़ लगाए |\n" +
                    "  \n" +
                    "सभी सब्जी लगाएं, दोनों तरह का चीज़ लगाएं |हर्ब्स और चिल्ली फ्लेक्स डालें |\n" +
                    "  \n" +
                    "तवे पर बटर लगाएं, ब्रेड को धीमी आँच पर ढककर सेक लें |गरमा गरम पिज़्ज़ा तैयार है",
            "सबसे पहले सारी सब्जियों को काटकर उबाल लें\n" +
                    "\n" +
                    "  \n" +
                    "अब एक पेन ले तेल डाले अदरक वाला पेस्ट डाले भूने उसमें पाव भाजी मसाला डाले सब्जी का पेस्ट डाले अच्छी तरह पकाए, उसमें नमक नीबू धनिया डाले और बटर मिला ले और सर्व करें\n" +
                    "\n"
    };
    String[] smsArray02 = {
            "आलू को छिलकर कद्दूकस कर लिए और घी छोड़ कर सारी सामग्री मिला लिए\n" +
                    " \n" +
                    "अब आटे से लोई लेकर थोड़ा बेलकर बीच में आलू का मिश्रण रख कर बंद करके फिर से बेल लिए\n" +
                    "\n" +
                    "फिर तवे में घी लगा कर सेंक लिए और काट कर मसाला दही के साथ सर्व किए",
            "सबसे पहले आटे मे काट हुआ प्याज,हरा धनियाऔर सभी मसले और थोड़ा सा नमक डाल कर पानी से आटा गुंथ लें,और 10 मिनट के लिए साईड मे रख दे।\n" +
                    "\n" +
                    "अब इस आटे से छोटे छोटे पेड़े बना लें।और सोंखे आटे में लपेट कर गोल बेल लें।\n" +
                    "\n" +
                    "अब एक तवे को गरम करें और इसमें पराठों को तेल लगा कर दोनों साइड से सुनहरा तल लें।\n" +
                    "  \n" +
                    "इसी तरीके से सारे पराठों को तैयार कर लें।\n" +
                    "\n" +
                    "अब हमारा यम्मी परांठा तैयार हैं, खूब सारे मक्खन के साथ गरमा गरम परोसे।",
            "सब से पहले एक कटोरी में सभी सामग्री को डाल कर डालकर नीड आटा तैयार कर 10 मिनिट ढक कर रख दे\n" +
                    "\n" +
                    "अब गैस पर नॉनस्टिक तवा को गर्मकर और आटा को बराबर भाग में कर पेड़े बना कर रोलर पिन की हेल्प से ड्राई आटा लगा कर पराठा तैयार कर मीडियम आंच पर सेक ले गोल्डन ब्राउन होने तक\n" +
                    "\n" +
                    "लीजिये खाने को तैयार है बचा हुआ मुंग दाल पराठा आप अपनी चॉइस की किसी भी चटनी सॉस पिकल या रसीली सब्जी बूंदी रायता के साथ परोसें दोस्तों आनंद लें. धन्यवाद.",
            "पनीर को मिक्स करें अब उसमें नमक, लाल मिर्च, अजवायन डालें\n" +
                    "\n" +
                    "आटे की रोटी बना कर उसमें पनीर डाले\n" +
                    "  \n" +
                    "फिर उसको बन्द करके रोटी बना ले ओर तवे पर सेके"};
    String[] smsArray03 = {
            "साबूदाना को पानी में 2से3 घंटे के लिए भिगो कर रख दें।\n" +
                    "\n" +
                    "मूंगफली को हल्का भून लें और उसमें हरी मिर्च डालकर दरदरा पीस लें\n" +
                    "\n" +
                    "फूले हुए साबूदाना में पिसा हुआ मूंगफली मिला ले\n" +
                    "\n" +
                    "एक कढ़ाई में तेल गरम करें उसमें जीरा डाले और आलू के छोटे टुकड़े कर के दाले उस के बाद साबूदाना डाल कर अच्छे से मिला ले उस के बाद नमक डाल कर 2 मिनट बाद गैस बंद कर दें",
            "सबसे पहले धीमी आंच पर घी गरम करें। अब इसमें कुट्टू का आटा डालकर, धीमी आंच पर रंग बदलने तक भूनें। अब मसाला दूध पाउडर डालकर भूनें।\n" +
                    "\n" +
                    "अब गैस बंद कर दे। अब मिश्रण को ठंडा करे। अब इसमे शक्कर पाउडर डालकर अच्छे से मिला लें, और लड्डू बना लें। बहुत सारा प्यार डाले।\n" +
                    "\n" +
                    "फलाहारी लड्डू तैयार है। ।। है पी कूकींग।।",
            "तेल को छोड़ कर सब सामग्री को एक बड़े बोल में डाल कर अच्छे से मिलाएँ।\n" +
                    "\n" +
                    "अब मिश्रण के वडे तैयार कर के एक पलते में रख लें।\n" +
                    "\n" +
                    "कढ़ाई में तेल गरम होने रखें।\n" +
                    "\n" +
                    "गरम तेल में सब वादे तल ले एक साथ २-३ से ज़्यादा वडे ना डाले।\n" +
                    "\n" +
                    "अच्छे से कुरकुरे होने पर तेल से निकाले और गरम गरम परोसें",
            "दूध खोलने के लिए चढ़ा देंगे। जब दूध में उबाल आ जाएगा तब साबूदाने को साफ पानी से धोकर खोलते हुए दूध में डाल देंगे। और साबूदाने को पकने देंगे और बीच-बीच में खीर को चलाते रहेंगे ताकी खीर नीचे पकड़े नहीं ।\n" +
                    "\n" +
                    "जब अच्छा से पक जाए और दूध गाढ़ा होने लगे तो चीनी डाल देंगे और लगातार चलाते रहेंगे और चीनी को घूलने देंगे। 5 मिनट तक लगातार चलाते हुए पकाने के बाद गैस से खीर को उतार लेंगे और इलायची पाउडर को डाल देंगे और ड्राई फूट डालकर मिला देंगे। अब थोड़ी देर खीर को फ्रीजर में ठंडा करेंगे। थोड़ी देर फ्रिज में रख कर ठंडा करने के बाद\n" +
                    "\n" +
                    "थोड़ी देर ठंडा करने के बाद स्वादिष्ट खीर खाने को तैयार है।\n" +
                    "\n" +
                    "अब आप खाइए और खिलाइए बहुत ही स्वादिष्ट और पौष्टिक खीर खाने को तैयार है। हम व्रत मे साबूदाना के खीर को खाते हैं यह बहुत ही स्वादिष्ट लगते हैं।"
    };
    String[] smsArray04 = {
            "गुड़ को 1 चम्मच पानी में भिगो कर 5 मिनट के लिए रख दें।\n" +
                    "\n" +
                    "लाल मिर्चों को भी 5 मिनट के लिए पानी में भिगो दें।\n" +
                    "\n" +
                    "अब एक मिक्सर जार में सारी सामग्री डाल दें और मिर्चें पानी से निकाल कर निचोड कर डालें।\n" +
                    "\n" +
                    "सब को मिलाकर बारीक़ पीस लें। गुड़ की तीख़ी चटनी तैयार है।\n" };
    String[] smsArray05 = {
            "आंवला धोके उबालने के लिए ढक कर रख दें उसे उतना ही उबालें कि जिस से आंवला के फांकें अलग हो जाए उबालने के बाद उसे पानी से अलग कर दें और उसे ठंडा करें फिर उसके सारे फाके अलग करें अब कढ़ाई में पंचफोरन डाल के भूनें और सुनहरा होने पर निकालकर पीस लें अब कढ़ाई को गर्म करें और उसमें राई तेल डालें फिर उतार ले और गर्म तेल में ही धनिया पाउडर आंवला मिर्ची पाउडर नमक\n" +
                    "\n" +
                    "राई दाने अमचूर पाउडर जीरा पाउडर और पंचफोरन का मसाला पिसा हुआ डालकर मिला ले अच्छे से मिल जाने पर उसे एक कांच के जार में भर के रख ले 1 दिन धूप भी दिखाने के बाद आप उसे खाने के साथ परोसे आंवला का अचार टेस्ट के साथ हेल्थी भी होता है",
            "कडाई मे तेल को गरम करें, थोड़ा ठंडा होने पर हींग डालकर पुरा ठंडा होने दे।\n" +
                    "\n" +
                    "नींबू को घोकर पुरा सुखाले।उसको 8हीस्से मे कट करले।\n" +
                    "\n" +
                    "मेथी ओर राइ को सेककर ठंडा करके पीस कर पाउडर बनाये।\n" +
                    "\n" +
                    "एक बतँन मे नीबूं के टुकड़े, लाल मिर्च, हल्दी, पीसा हुआ राइ, मेथी का पाउडर,नमक डालकर मीलाए।\n" +
                    "\n" +
                    "नीबूं का रस,तेल डालकर अच्छे से मीलाए।तैयार अचार रोटी और बे्ड के साथ",
            "भिंडी को अच्छे से धोकर, पोंछ लें। फिर भिंडी को छोटा छोटा काट लें।\n" +
                    "\n" +
                    "एक कढ़ाई में तेल गर्म करें । फिर ज़ीरा, धनिया, अजवाइन सौंफ डालें।\n" +
                    "फिर भिंडी डालें। और ५-७ मिनिट तक ढँककर कर पकाए। जब भिंडी थोड़ी हो जाए, फिर सारे मसाले डालें ।\n" +
                    "\n" +
                    "अचछे से सभी को मिक्स करें। और अच्छे से जब भिंडी पक जाए। तब नमक व निम्बू का रस डालें।\n" +
                    "\n" +
                    "अचारी भिंडी मसाला तैयार हैं। गरमा गरम पराँठे या चपाती के साथ परोसे।",
            "मिर्च को धोकर काट कर एक दिन के लिए धूप मे सुखाये\n" +
                    "\n" +
                    "यहाँ पर मेने राई ली है और मिक्सी में हल्की सी दली है\n" +
                    "\n" +
                    "तेल गर्म करें और राई में डालकर मिलाऐ\n" +
                    "\n" +
                    "राई मे तेल मिला कर हल्दी नमक आदि मसाले डालो और अच्छी तरह से चलाये अब मसाले को मिर्च मे भरे ओर ढकनवाले डाबे मे भरकर रखे. लाल मिर्च का" };
    String[] smsArray06 = {
            "एक बाउल में चना डालें,प्याज डालें\n" +
                    "\n" +
                    "गाजर,लाल पत्तागोभी डालें\n" +
                    "\n" +
                    "हरी मिर्च, हरी पत्तागोभी डालें\n" +
                    "\n" +
                    "मयोनिज़, काले अंगूर डालें\n" +
                    "\n" +
                    "नमक डालकर अच्छी तरह से मिलाएं\n" +
                    "\n" +
                    "सर्विंग बाउल में निकाल कर अखरोट से सजाकर परोसें",
            "हल्दी धोकर छिल ले।\n" +
                    "\n" +
                    "  \n" +
                    "पतला काट ले।\n" +
                    "\n" +
                    "  \n" +
                    "नीम्बु का रस बीज हटा कर मिला ले।\n" +
                    "\n" +
                    "  \n" +
                    "एक दिन रखे। नमक मिला ले। खाने मे शामिल करे। स्वाद और सेहद दोनो पाये",
            "खीरे के गोल कटे टुकड़ों के ऊपर नींबू का रस डालें और नमक मिलाएं।\n" +
                    "\n" +
                    "  \n" +
                    "प्लेट में सजाए और चाट मसाला डालकर परोसें।",
            "सभी सामग्री को एक एक कर मिक्सिंग बाउल में डालकर अच्छी तरह से मिला लें।\n" +
                    "\n" +
                    "  \n" +
                    "ऊपर से निम्बू का रस डालकर मिला लें और सर्व करें।"};
    String[] smsArray07 = {
            "1 चम्मच तेल लीजिए तेल गर्म होने पर लहसुन डाल दीजिए। लहसुन के हल्का रंग बदलने पर प्याज डाल दीजिए।\n" +
                    "\n" +
                    "टमाटर डाल दीजिए और गलने दीजिए।\n" +
                    "\n" +
                    "हरी मिर्च डाल दीजिए और हल्दी पाउडर, नमक, छाछ या फेटा दही डालकर धीमी आंच पर 10 मिनट पकने दीजिए\n" +
                    "\n" +
                    "पानी अच्छे से सूखने तक पका लीजिये । और चपाती के साथ सर्व करें।",
            "3 टमाटर\n" +
                    "1 प्याज\n" +
                    "1 हरी मिर्च\n" +
                    "6 लहसन की कली\n" +
                    "1/2 चम्मच जीरा\n" +
                    "2 चुटकी हींग\n" +
                    "नमक स्वादानुसार\n" +
                    "1/2 चम्मच लाल मिर्च पाउडर\n" +
                    "1/2 चम्मच हल्दी\n" +
                    "1/2 चम्मच धनिया पाउडर\n" +
                    "1/2 चम्मच गरम मसाला\n" +
                    "2 चम्मच मलाई\n" +
                    "1 ग्लास पानी\n" +
                    "1 कटोरी मोटी सेव\n" +
                    "चम्मच हरे धनिया\n" +
                    "3 चम्मच तेल",
            "प्याज, हरी मिर्च, लहसन की पेस्ट बनलो।\n" +
                    "\n" +
                    "कड़ाई में तेल गरम करके उसमें जीरा हींग डाले फिर उसमे प्याज की पेस्ट डालकर भूने।\n" +
                    "\n" +
                    "प्याज जब हल्का लाल हो जाए तब उसमें 2 टमाटर की प्युरी डाले। और पकाएं। उसके बाद उसमें सारे मसाले डाले।\n" +
                    "\n" +
                    "मसाले अच्छे से मिक्स करके उसमें मलाई डाले। मलाई एक बराबर मिक्स करें। लास्ट में उसमे 1 टमाटर की बड़ी कटिंग कर के डले ।\n" +
                    "\n" +
                    "फिर उसमे पानी डाले जब पानी में उबाल आ जाए तब उसमें सेव डाले। लास्ट में हरे धनिया डालकर मिक्स करें।\n" +
                    "\n" +
                    "तैयार है सेव टमाटर की सब्जी।",
            "सबसे पहले हम एक कड़ाही में तेल डाल कर उसमे जीरा, प्याज, लहसुन, अदरक, टमाटर or सारे सूखे मसाले डालकर फ्राई केरेंगे।\n" +
                    "\n" +
                    "फिर ठंडा होने पर सभी को मिक्सी मे पीस लेंगे। साथ में उसी जार मे नारियल b डालकर पीस लेंगे।\n" +
                    "\n" +
                    "फिर एक दूसरी कड़ाही में तेल डाल कर उसमे, तेज पत्ता राई, कड़ी पत्ता, धनिया, मिर्च पाउडर ओर नमक डालकर उसमे पीसा हुआ मिक्स डालकर फ्राई केरेंगे ।\n" +
                    "\n" +
                    "उबाल आने पर धनिया डालकर सर्व केरेंगे। इसे हम चावल, डोसा, रोटी किसी के भी साथ खा सकते हैं।",
            "तेल गर्म कर के हींग डाल कर जीरा चटकाए।\n" +
                    "\n" +
                    "लाल मिर्च पावडर डाले\n" +
                    "\n" +
                    "कटी हुई टमाटर डाले।\n" +
                    "\n" +
                    "अब सारे मसाले डाले।\n" +
                    "\n" +
                    "अब टमाटर को तेल अलग होने तक पकाये।\n" +
                    "\n" +
                    "आखिर में भुजिया डाल कर रोटी, पराठे के साथ परोसें।" };
    String[] smsArray08 = {
            "सारी सब्जियों को धो कर बडे टुकड़ों में काट ले प्याज व लहसुन भी काट ले।टमाटर भी साथ में काट ले ।दाल धोकर कूकर मे नमक व हल्दी डालकर 5 सीटी आने तक उबाल ले ।\n" +
                    "\n" +
                    "एक कूकर मे तेल गर्म करें । सरसों के दाने चटकाएं । हींग डाले ।\n" +
                    "\n" +
                    "कटी हुई सब्जियां डालकर मिलाए ।नमक व लाल मिर्च डाले और अच्छे से मिला ले और कूकर मे 1 सीटी लगवा ले। या खुले में तब तक पकाए जब तक सब्जियां पक जाए ।\n" +
                    "\n" +
                    "कूकर को तुरंत खोले और सांभर मसाला डाले ।\n" +
                    "\n" +
                    "अब दाल डाले और इमली का रस मिलाकर 5 मिनट तक हल्की आंच पर पकाए ।\n" +
                    "\n" +
                    "तैयार है स्वादिष्ट सांभर । इसे चावल के साथ परोसे ।",
            "उड़द दाल, चावल को मैथी दाना डाल कर अलग अलग, 4-5 भिगो दें। और पीस कर 6-7 घंटे खमीर उठने के लिए रख दें।\n" +
                    "खमीर उठने के बाद नमक मिला लें। और इडली के सांचे में तेल लगा कर मिश्रण भर कर पकने रखें।\n" +
                    "\n" +
                    "करीब 7-10 मिनिट में ये पक जायेंगी।\n" +
                    "  \n" +
                    "तुअर दाल को 1/2 घंटे पहले भिगो दें। अब इसमें इसमें लौकी, प्याज़, लहसुन, हरी मिर्ची, अदरक, हल्दी डाल कर पका लें।\n" +
                    "\n" +
                    "एक कडाही में 2 चम्मच तेल गरम करे और जीरा, हींग डाल कर भूने। मैथी दाना डाल कर भूने। करी पत्ती, सूखी साबुत लाल मिर्ची डाल कर भूने। टमाटर का पेस्ट डाल कर भूने। सांभर मसाला, लाल मिर्ची पाउडर डाल कर 2 मिनिट भूने।\n" +
                    "\n" +
                    "भुने मसाले में उबली दाल डाल कर मिला लें।इमली गूदा डाल कर उबाल लें।। जरूरत अनुसार पानी और नमक डाल कर एक उबाल लें।सांभर तैयार है।\n" +
                    "\n" +
                    "चटनी के लिए - भुनी मूंगफली में हरी मिर्ची, धनिया पत्ती जीरा, नमक दही मिला कर पीस लें।\n" +
                    "\n" +
                    "एक चम्मच तेल गरम करे और उसमें राई करी पत्ती, सूखी साबुत लाल मिर्ची, डाल कर भूने।\n" +
                    "\n" +
                    "तैयार है इडली सांभर, मूंगफली की चटनी",
            "सबसे पहले धनिया पत्ती को साफ कर ले और धोकर उसका पानी निकाल दे ।अब एक बर्तन में बेसन, मैदा,सूजी, नमक, हल्दी,अजवायन और गर्म तेल को अच्छी तरह से मिल लें। और इसमें थोड़ा थोड़ा पानी मिलतें हुए आटा गूँथ लें आटा गूँथ लें आटा न ही नरम हो और न सख्त अब आटे को 10 मिनट तक ढका कर रख दें।\n" +
                    "\n" +
                    "अब एक कढाई में तेल गर्म कर उसमें जीरा, हींग का तडका लगा के उसमें हरी मिर्च, लहसुन, साबुत लाल मिर्च, सौंफ,अजवायन, तिल और खसखस को मिला कर भून ले ।\n" +
                    "\n" +
                    " \n" +
                    "अब इसमे चिरौजी, किसा हुआ नारियल मिला ले और उसे भी भून लें अब इसमें मूँगफली और सभी मसाले डाल कर अच्छी तरह से मिक्स कर ले ।\n" +
                    "अब इसमे बारीक कटा हुआ धनिया पत्ती मिला ले और उसे भी भून लें ।जब धनिया पत्ती पक जाए और सभी मसाले में मिला जाए तो गैस बंद कर दे और मसाले को ठण्ड होने दे ।\n" +

                    "अब आटे की लोई को अण्डा आकार की बेल ले और और उसके बीच भरावन भर कर अच्छी तरह पानी लगा कर के बंद कर दे ।चित्र के अनुसार ।\n" +
                    "सांभर वडी (Sambar vadi recipe in Hindi) रेसिपी चरण 5 फोटो\n" +
                    "अब एक कढाई में तेल गर्म कर उसमें वडी को मध्य आंच पर सुनहरा होने तक तल ले।\n" +
                    " \n" +
                    "गरम गर्म सांभर वडी को साॅस, दही या चाय के साथ सर्व कीजिए ।",
            "इडली वह भी आसान इडली को दही के साथ फेटे आधा कप पानी मिलाएं और पांच 10 मिनट के लिए रख दें.अब नमक डालें और इनो डालें और फटाफट इडली तैयार करें माइक्रोवेव में ३ मिनट\n" +
                    "\n" +
                    "  \n" +
                    "सांभर bs9 अरहर की दाल बनाएं सारी सब्जियां जो भी आपके पास अवेलेबल है उन्हें डालेंअमचूर डालें और 4,5 सिटी दे\n" +
                    "\n" +
                    "  \n" +
                    "फिर प्याज टमाटर डालकर सांभर का तड़का दे"};
    String[] smsArray09 = {
            "पहले पतीले में शक्कर और पानी डाले और चासनी बनाले उसमें आपको एक या दो तार की चाशनी नहीं बनानी है सिर्फ अच्छा उबाल आ जाए और शक्कर पिघल जाए बस फिर इलायची डालकर ढक कर एक तरफ रख दें अब ब्रेड के चारों तरफ के किनारे निकालने\n" +
                    "\n" +
                    "  \n" +
                    "कढ़ाई में घी डालने और ब्रेड को तिरछा बीच में से काट ले घी एकदम गरम हो जाए तब ब्रेड डालें और उलट पलट के सुनहरा फ्राई करें और उसे निकाल कर एक तरफ रखें इस तरह से आप ब्रेड फ्राई करके एक एयर टाइट डब्बे में भर के रख सकते हैं इमरजेंसी में घर पर कोई मिठाई ना होने पर मेहमान आने पर आप बहुत जल्द रबरी और सिरा तैयार कर सकते हैं और मेहमानों को गरमा गरम मिठाई शाही टुकड़ा कर परोसें\n" +
                    "\n" +
                    "  \n" +
                    "अब एक कढ़ाई में मिल्क पाउडर घी और दूध को आपस में अच्छी तरह मिला लें और उसमें गांठें न बनने पाएं गैस जलाएं और अब लगातार चलाते हुए एक अच्छा उबाल आने दें अब उसमें शक्कर मिला दे और तुरंत गाढ़ा हो जाएगा आप की रबड़ी तैयार है आप उसे उतार ले सिरा गर्म करें और उसने ब्रेड डालकर डूबा कर तुरंत प्लेट में निकालने और ऊपर से रबड़ी डालें और उसके ऊपर से कटे हुए काजू बादाम और पिस्ता डालें आपके झटपट शाही टुकड़ा तैयार है आप फैमिली और मेहमानों के साथ इसे पर परोसें",
            "सबसे पहले गाजर को साफ़ धोकर छील ले।और बारीक काट ले।या किस ले।\n" +
                    "\n" +
                    "अब कुकर मे इन गाजर मे दूध मिला कर 5 से7 शीटी पका ले।\n" +
                    "\n" +
                    "अब पकी हुई गाजर को चमच्च से मैश कर ले।\n" +
                    "\n" +
                    "अब एक पैन में घी डाले।फिर इस मैश की हुई गाजर को डाल कर 15 से 20 मिनट भुने।\n" +
                    "\n" +
                    "अब इसमें मिल्कमेड मिलाये।आप चाहे तो मावा भी मिला सकते है।और साथ ही शुगर मिला कर अच्छी तरह चलाये।अब इसमें इलायची पीस कर डाले।\n" +
                    "\n" +
                    "अब एक ट्रे मे घी ग्रीस करे और तैयार गाजर को फैला दे।फिर ऊपर से बादाम और नारियल का बूरा डाले।और 4 से 7 मिनट फ्रीज़ मे सेट होने रख दे।और मनचाहे आकार मे कट कर ले।\n" +
                    "\n" +
                    "तैयार है सर्दियों की स्पेशल गाजर की बर्फी ।इसे खाये और आनंद ले।",
            "सबसे पहले पीसे हुए ब्रेड में दूध डालकर भीगा कर रख देंगे मैंने बर्फी बनाने के लिए मीठी ब्रेड ली है सादी ब्रेड भी ले सकते हैं\n" +
                    "\n" +
                    "अब एक नॉन स्टिक पैन गर्म करेंगे और फिर आँच को धीमा कर लेंगे फिर उसमें शक्कर और नारियल बुरा को डालकर भूनेंगे जब हल्का सुनहरा हो जाएगा तब उसमें एक चम्मच घी डाल देंगे\n" +
                    "\n" +
                    "जब थोड़ा और सुनहरा हो जाएगा तब उसमें दूध में भीगी हुई ब्रेड को डाल कर अच्छे से मिलाएंगे आँच को मीडियम कर लेंगे और उसको सूखने तक भूनेंगे\n" +
                    "\n" +
                    "जब पन छोड़ने लगे तब एक प्लेट में थोड़ा सा घी लगाकर उसमें पलट देंगे और उसको अच्छे से फैला लेंगे और उसको 2 घंटे के लिए अच्छे से ठंडा होने देंगे फिर चाकू की मदद से उसको मनचाहे आकार में काट लेंगे और खजूर और गुलकतरी से सजा देंगे\n" +
                    "\n" +
                    "हमारा ब्रेड की बर्फी तैयार है इसे ठंडा होने के बाद परोसेंगे",
            "सभी सामग्रियों को तैयार रखें.\n" +
                    "\n" +
                    "एप्पल को छिलके के साथ खीस लें.\n" +
                    "\n" +
                    "अब एक नॉन स्टिक पैन में किसे हुए एप्पल को लेकर गैस मध्यम आंच पर रखें और पकाए. दूध को भी एक तपेली में रखकर उबालें.\n" +
                    "\n" +
                    "5 मिनट तक किसे एप्पल को पकाएं. उसमें इलायची और शक्कर डालकर मिक्स करें. जब एप्पल पक जाए और शक्कर अच्छे से मिक्स हो जाए तब गैस बंद करना.\n" +
                    "\n" +
                    "दूध को आधा होने तक धीमी आंच पर उबालें. जब दूध आधा हो जाए तब उसमें पके एप्पल का मिक्सचर डालना और अच्छे से मिक्स करना.\n" +
                    "\n" +
                    "अब आधा ड्राई फ्रूट्स डालना. 2 मिनट तक उबालकर गैस बंद करना. आपका एप्पल का खीर तैयार है. इसे एक सर्विंग बाउल में सर्व करें और ऊपर से बाकी के ड्राई फ्रूट्स डालकर कार्निश करें."
    };
    String[] smsArray10 = {
            "पहले चिकन को अच्छी तरह से धो लें फिर ।अब प्याज़ को पेस्ट कर लें फिर लहसुन अदरक का एक साथ पेस्ट कर लें अब काजु के साथ खस-खस मिलाकर पेस्ट बना लें ।\n" +
                    " \n" +
                    "अब धोया हुआ चिकन में १ टीस्पून सरसों का तेल प्याज़ का पेस्ट लहसुन अदरक का पेस्ट और दही मिलाकर मेरिनैट करने दे एक घंटे के लिए\n" +
                    " \n" +
                    "एक घंटे बाद निकालकर रखें अब कड़ाई गर्म करने दें गर्म होने पर दो चम्मच तेल और दो चम्मच घी डालकर २-३ लाल मिर्च डालें फिर तेज पत्ता और गर्म मसाला डालकर ख़ुशबू आने तक फ़्राई कर लें फिर बाकि रखा हुआ प्याज़ का पेस्ट डालकर अच्छी तरह से फ़्राई कर लें लाल रंग होने तक अब इसमें मेरिनेट किया हुआ चिकन डालकर गैस का फ़्लेम बढ़ा दें और चिकन कस लें\n" +
                    "\n" +
                    "अब इसमें काजु और खस-खस का पेस्ट डाल दें,ज़ीरा पाउडर,काली मिर्च पाउडर,नमक और चीनी डाल दें फिर अच्छी तरह से मिला लें फिर गैस को धीमी कर दें और ढक दें १०-१५ मिनट के लिए बीच बीच में ढक्कन खोलकर हिलाते रहे अब जब इसमें से तेल निकलने लगे तब एक कटोरी पानी डालकर ७-१० मिनट पकने दें अब तैयार होने पर सर्व करें ।",
            "सबसे पहले चिकन।को साफ कर उसे मरीनेशन के लिए १ घंटे को रख दें\n" +
                    "\n" +
                    "फिर कढ़ाई में बटर डाले फिर मेस,हरी इलायची दाल कर २ सेकंड कनली भून लें।फिर उसमे कटे प्याज़ दाल कर थोड़ा गुलाबी होने तक पका लें।\n" +
                    "\n" +
                    "फिर उसमे टमाटर, लहसुन पेस्ट,काजू दाल कर मिक्स करे।\n" +
                    "\n" +
                    "फिर सभी मसाले डाल कर मिक्स करे ।कुछ देर पकाएं।फिर हरा धनिया डाल कर ७ मिनट तक ढक कर पकाएं।\n" +
                    "\n" +
                    "फिर उसे कढ़ाई से निकाल।कर इसका पेस्ट बना लेगी।\n" +
                    "\n" +
                    "अब एक कढ़ाई में बटर,ऑयल डाल कर गरम करे फिर चिकन डाल कर पका लें।\n" +
                    "\n" +
                    "फिर इसमें को पेस्ट रेडी किया है उसे उसमे मिक्स कर लें।अब इसमें गरम मसाला और कस्तूरी मेथी एड करेंगे।\n" +
                    "\n" +
                    "अब मिक्स करने के बाद उसमे टोमैटो सॉस,मलाई ये दोनों दाल कर अच्छे से मिक्स करें। फिर बटर और पानी डाल कर १० मिनट तक पकाएं।रेडी है बटर चिकन।",
            "सबसे पहले तवे में खड़ा धनिया डालेंगे और फिर डालेंगे जीरा,कालीमिर्च,लौंग,और पोस्ता दाना\n" +
                    "\n" +
                    "अब डालेंगे छोटी इलायची,हरी मिर्च सबको अच्छे से धीमी आंच पे भून लेंगे\n" +
                    "\n" +
                    "भुना मसाला तैयार है मसाला ठंडा हो जाने के बाद मिक्सर जार में पीस लेंगे.भुना मसाला पाउडर तैयार है\n" +
                    "\n" +
                    "अब हम एक बाउल में मटन लेंगे और डालेंगे गरम मसाला,लाल मिर्च पाउडर\n" +
                    "\n" +
                    "डालेंगे लहसुन अदरक का पेस्ट,दही,नमक,हल्दी सबको अच्छे से मिला देंगे और १/२घंटे के लिए मैरीनेट होने के लिए छोड़ देंगे\n" +
                    "\n" +
                    "अब हम कुकर में तेल डालेंगे जब तेल अच्छे से गरम हो जाए तब हल्दी डालेंगे\n" +
                    "\n" +
                    "डालेंगे नमक,गरम मसाला पाउडर,मीट मसाला पाउडर\n" +
                    "\n" +
                    "डालेंगे धनिया पाउडर,लहसुन अदरक का पेस्ट,मक्खन\n" +
                    "\n" +
                    "डालेंगे भुना मसाला,थोड़ा सा पानी डालेंगे जिससे कि मसाला जले नहीं और अच्छे से मिला देंगे\n" +
                    "\n" +
                    "अब डालेंगे प्याज की प्युरी,टमाटर की प्युरी अच्छे से मिला देंगे\n" +
                    "\n" +
                    "डालेंगे लाल मिर्च पाउडर,और मैरीनेट किया हुआ मटन डालेंगे और फिर अच्छे से मिला देंगे\n" +
                    "\n" +
                    "कुकर को अच्छे से ढक के धीमी आंच पे १०-१५ मिनट के लिए पकाएंगे जब तक कि मसाला अपना तेल ना छोड़ दे तेल ऊपर आ गया है अब हम उसमे पानी डालेंगे(जिस बाउल में मटन मैरीनेट किया था उसी बाउल में पानी डाल के सारा मसाला पानी में आ जाएगा)उसी पानी का इस्तेमाल हम मटन की करी बनाने में करेंगे वहीं पानी हम मटन में डाल देंगे\n" +
                    "\n" +
                    "फिर अच्छे से मिला देंगे डालेंगे कसूरी मेथी और अच्छे से मिला देंगे\n" +
                    "\n" +
                    "अब कुकर बंद कर देंगे और १०-१५ सिटी आने का इंतज़ार करेंगे १०-१५ सिटी हो जाने के बाद हम कुकर खोल के देख लेंगे मटन गोश्त दरबारी तैयार है सर्व करे रोटी और चावल के साथ",
            "सबसे पहले गैस पे तवा रखेंगे और उसमे डालेंगे जीरा,खड़ा धनिया\n" +
                    "\n" +
                    "फ़िर डालेंगे खड़ी लाल मिर्च और डालेंगे गरी का बुरादा और इन सब को अच्छे से मिला लेंगे और इन्हे हल्की आंच पे भूनेंगे\n" +
                    "\n" +
                    "अब हम एक बाउल में फिश लेंगे और उसमे चुटकी भर नमक डालेंगे और डालेंगे थोड़ा सा नींबू\n" +
                    "\n" +
                    "अब डालेंगे लहसुन अदरक का पेस्ट और सबको अच्छे से मिला देंगे और १/२घंटे के लिए छोड़ देंगे ताकि वो अच्छे से मैरीनेट हो जाए।\n" +
                    "\n" +
                    "अब गोन मसाला ठंडा हो गया है अब हम मिक्सर जार में गोन मसाला डाल के अच्छे से उसका पाउडर तैयार कर लेंगे और उसे एक कटोरी में निकाल लेंगे।अब एक पैन में तेल लेंगे उसे अच्छे से गरम हो जाने देंगे\n" +
                    "\n" +
                    "तेल अच्छे से गरम हो गया है अब डालेंगे बारीक कटा हुआ लहसुन अच्छे से मिला देंगे\n" +
                    "\n" +
                    "अब प्याज की पूरी डालेंगे अच्छे से मिला देंगे १ मिनट के लिए अब डालेंगे टमाटर की पूरी\n" +
                    "\n" +
                    "अच्छे से मिला देंगे १ मिनट के लिए अब डालेंगे गोन मसाला पाउडर और लाला मिर्च पाउडर और फिश मसाला\n" +
                    "\n" +
                    "अब डालेंगे नमक,इमली का पुल,बारीक कटी हुई हरी मिर्च\n" +
                    "\n" +
                    "सबको अच्छे से मिला देंगे थोड़ा सा पानी डालेंगे ताकि मसाला जले नहीं अब एक एक करके फिश डालेंगे\n" +
                    "\n" +
                    "सारी फिश को एक साथ डाल के अच्छे से मिला लेंगे फिर पानी डालेंगे पानी उतना ही डाले जिस हिसाब से करी बनानी है ।अब हम गलास लीड से ढक देंगे १०-१५ मिनट के लिए\n" +
                    "\n" +
                    "अब खोल के देख ले गोन फिश करी तैयार है गर्मागर्म सर्व करे चावल या रोटी के साथ।"
    };
    String[] smsArray11 = {
            "सबसे पहले मैदे में सोडा डालकर मल के अलग रख ले।अब एक कढ़ाई ले उसमे तेल डाले अब उसमे हरी मिर्च और अदरक डालकर 1 मिनट तक भूने अब उसमे प्याज़ को डाले 2 मिनट तक भूने अब उसमे टमाटर डालकर 5 मिनट तक भुने जब टमाटर तेल छोड़ दे अब उसमे सभी मसाले डाले और उबले छोले को मिलाये अब उसमे ऊपर से कस्तूरी मेथी डालकर मिलाये अब 5 मिनट तक उबाले अब आपके तीखे छोले तैयार है हरी धनिया डालकर भटूरे के साथ सर्वे करे । एक कड़ाही में तेल गरम करे मैदे की छोटी लोई ले और लाल भटूरे उतारे और बच्चो को सर्वे करे। बहुत मन से बच्चे खाएंगे",
            "मटरको गरम पानी मे 2घनटे के लिए भिगो दे फिर चनो को कुकर मे 1सिटी लगा ठंड़ा होने दे। एक बतन में चना डाले उसमे कटा हुआ प्याज,हरा धनिया, हरी मिच, अदरक, टमाटर, लाल मिच, चाट मसाला, नमक, नीबू का रस, पिधला हुआ मकखन डाल कर अच्छी तरहा मिला ले।",
            "सबसे पहले भटूरे का आटा लगा कर एक तरफ रख दें आटा टाइट नहीं होना चाहिए रोटी के आटे से थोड़ा नरम ही होना चाहिए।\n" +
                    "\n" +
                    "  \n" +
                    "भीगे हुए छोलो को भी कुकर में डालकर पानी मिलाएं उसकी सभी सामग्री को भी डालकर गैस पर रखें ।मध्यम आंच पर 6-7 सीटियां लगाएं खोल कर चेक करें छोला नरम हुआ है या नहीं\n" +
                    "\n" +
                    "  \n" +
                    "अब कटे हुए टमाटर और हरी मिर्च को मिलाएं अदरक भी और सभी चीजों को मिक्सी में डालकर पीस लें।\n" +
                    "\n" +
                    "  \n" +
                    "अब अब गैस पर पैन चढ़ाएं तेल डालकर गर्म करें उसमें जीरा, तेजपत्ता डाले फिर प्याज डालकर भूनें। अब टमाटर का पिसा हुआ मसाला भी डाल कर नमक भी मिलाएं और सभी मसाले अच्छे से मिक्स करें भूनते रहे जब तक मसाले तेल ना छोड़ दे।।\n" +
                    "\n" +
                    "  \n" +
                    "अब भूने मसाले को छोलों में मिलाएं और जरूरत अनुसार पानी मिलाकर एक बार और पकाएं। ध्यान रहे छोलो में ज्यादा पानी नहीं होना चाहिए।\n" +
                    "\n" +
                    "  \n" +
                    "अब एक-दूसरे कढ़ाई में तेल गर्म करें। भीगे हुए आटे के भटूरे के आटे से लोहिया तोड़कर उसे तेल लगा कर बेले। फिर गरम गरम तेल में डालकर उसे झर से दबा कर फुलाए फिर उलट कर भी सेके ।ओर प्लेट में निकले। ऐसे ही बाकी भटूरे को बनाए।\n" +
                    "\n" +
                    "  \n" +
                    "गरमा गरम भटूरे और छोले को प्याज काटकर अचार वगैरह के साथ-साथ करें।",
            "मकई के आटे में गेहूं का आटा, मेथी, अजवायन, नमक और लाल मिर्च मिलाकर पानी डाल कर गुंध लिए और ढककर रख दिए\n" +
                    "\n" +
                    "अब सरसों के पत्ते धोकर उबाल लिए और छान कर पीस लिए, एक कढ़ाई में तेल गर्म कर के जीरा और सारे खड़े मसाले डाल कर अदरक, लहसुन, हरी मिर्च और प्याज डाल कर भून लिए\n" +
                    "\n" +
                    "भून जाने पर नमक और सारे मसाले डाल कर टमाटर मिलाकर भुन लिए फिर बेसन और पिसी हुई सरसों डाल कर भून लिए और उतार लिए\n" +
                    " \n" +
                    "अब मकई के आटे की गोल रोटी बेल लिए और तवे में घी लगा कर सेंक लिए और गरमागरम सरसों के साग के साथ सर्व किए ।"

    };
    String[] smsArray12 = {        "रोटी,पूरी,पराठा,भाखरी:. एक परात में गेहूं का आटा ले।उसमे नमक व तेल का मोयन डाले और पानी डालकर आटा गुंद ले।अब आटे से छोटी लॉइया लेकर पूरी बेले और तेल में तले।बाद में रोटी,भाखरी और पराठा बेल कर तवे पर सैक ले।\n" +
            "\n" +
            "  \n" +
            "आलू की सब्जी और चौली की सब्जी:। एक कुकर में तेल डाले।तेल गरम होने के बाद उसमे जीरा,हींग का तड़का लगाए बादमें कटा हुआ टमाटर डाले और अच्छे से मिला ले।बाद में कटा हुआ आलू डाले और मसाले डालकर लास्ट में नमक और पानी डालकर कुकर की 3-4 सिटी होने तक पकाए।अब चौली की सब्जी बनाने के लिए पेन में तेल गरम करें और बादमें उसमे जीरा,हींग, कदीपत्ता डालकर, अदरक लहसुन मिर्ची का पेस्ट डाले और कटा हुआ टमाटर डालकर मिक्स करे।अब उबली हुई चौलि डालकर बकिंके मसाले डाले और आखिर धनिया डालकर मिक्स कर दे।\n" +
            "\n" +
            "  \n" +
            "दाल और कढ़ी: दाल बनाने के लिए उबले हुई तुवर दाल में अदरक मिर्ची का पेस्ट,टमाटर,हल्दी और थोड़ा सा पानी डालकर ब्लेंड करे।अब एक पतीले में तेल गरम करे बाद में उसमे सरसो के बीज,जीरा,हींग, लौंग,तेज पता, कदिपत्ता डालकर दाल डाले।अब उसमे नमक,चीनी,नींबू का रस,लाल मिर्च पाउडर,धनिया पाउडर,चुटकी भर गरम मसाला डालकर उबालें। कढ़ी बनाने के लिए 1 कप छाछ में 2 चमच बेसन मिलाकर घोले।अब पेन में तेल गरम करे बादमें सरसो बीज,हींग,जीरा,लौंग,तेज पता,छाछ,अदरक लहसुन मिर्ची,नमक,चीनी,डालकर अच्छे से उबले।\n" +
            "\n" +
            "  \n" +
            "ढोकला और पकोड़े: पकोड़े बनाने के लिए बेसन में मैथी,धनिया,अदरक लहसुन मिर्ची का पेस्ट,नमक,साबुत धनिया,काली मिर्च,पानी डालकर बैटर बना ले।अब उसपर 2 चमच गर्म तेल डाले।बादमें कड़ाई में गरम तेल में पकोड़े निकाले।\n" +
            "\n" +
            "  \n" +
            "ढोकला बनाने के लिए ढोकला के बैटर में नमक,अदरक लहसुन की पेस्ट,नींबू सत,साजी के फूल डालकर मिलाए,एक थाली को तेल्स ग्रीस करे और ढोकला बैटर डाले बादमें स्टीमर में पकने के लिए रखे।जब ढोकला बन जाए तब तड़का लगाए और धनिया कटा हुआ ढोकला पर छिड़के।\n" +
            "\n" +
            "  \n" +
            "गाजर और गोभी का समभारा: एक पेन में तेल गरम करे उसमे सरसो के बीज,जीरा,हींग,गाजर क्या हुआ,कटी हुई मिर्च और नमा,हल्दी डालकर मिला ले।थोड़ी देर तक ढक के रखे।जब गाजर पक जाए तब उतार ले।अब इस तरह गोभी का स्मभारा बना ले।\n" +
            "\n" +
            "  \n" +
            "अब एक पेन में दूध गरम करे जब दूध उबाल कर आधा हो जाए तब उसमे चीनी,केसर घुला हुआ डाले और गाढ़ा होने तक पकाएं। गाजर का हलवा बनाने के लिए एक पेन में घी गरम करे,बाद में ये कसा हुआ गाजर डालकर भूनें।अब जब गाजर पक कर सॉफ्ट हो जाए तब उसमे चीनी और दूध डालकर खूब सारा उबाले।आखिर में कटा हुआ ड्राय फ्रूट डाले।\n" +
            "\n" +
            "  \n" +
            "अब एक कुकर में धुली हुई मूंगदाल और चावल डाले,थोड़ा सा घी,नमक और पानी डालकर खिचड़ी को पकने के लिए चढ़ाए।अब एक दूसरे पतीले में चावल डालकर उसमे घी,नमक,पानी डालकर चावल को पका के।\n" +
            "\n" +
            "  \n" +
            "अब उरद पापड़ को सैक ले और खजूर इमली की चटनी बना ले।\n" +
            "\n" +
            "  \n" +
            "अब थाली में रोटी,पूरी,पराठा,भाखरी के साथ दोनों सब्जी,दोनों समभरा,दाल चावल,खिचड़ी कढ़ी,पकोड़े,ढोकला,गाजर का हलवा,केसर बासूंदी परोसे।अब साथ में खजूर इमली की चटनी,मिर्च का अचार,आम का मुरब्बा,गुड,छाछ भी रखे।आखिर में मुखवास रखे।अब गुजराती थाली रेडी है सर्व करने के लिए",
            "सबसे पहले दो कच्चे केले को कुकर में बाप के उसको तेल लेकर उसके अंदर राई जीरा हल्दी गरम मसाला नमक डालके मसाला बना ले।अभी वडा बनाने की सभी सामग्री को मिक्स करके आता गुंडे उसके छोटे-छोटे लंबे लंबे बड़े बनाकर डाल के ले ले अंदर से कच्चे ना रहे उसका ध्यान रखें।\n" +
                    "\n" +
                    "अभी कढ़ाई में १/५ कप तेल ले उसके अंदर टिंडा को तले, उसके बाद वालपापडी तल के लेले। उसके बाद तुवरके दाना को तले। उसके बाद कोबीज और शिमला मिर्च को तले। अभी वाधवानी मिर्च को बीच से काट के उसके अंदर केले का मसाला भरे ।उसको भी अलग से कच्चा पका पका ले ।सभी सामग्री को अलग रखें अभी एक दूसरी बड़ी कढ़ाई ले। उसके अंदर तेल डालकर जीरा हींग डालकर दो टमाटर डालें अभी दो टमाटर पक जाने के बाद हल्दी लाल मिर्च पाउडर गरम मसाला डालकर जो भी सब्जी तली है वह सब डाले साथ में बड़ा भी डालें।\n" +
                    "\n" +
                    "  \n" +
                    "अभी उसको ढाक के 5 से 10 मिनट तक अच्छे से पकाए उसको धीरे-धीरे से मिक्स करें। फिर उसको खोल के अच्छे से चलाएं अभी उसके अंदर कच्चे केले और जो मसाला है बचा हुआ वह भी डालें और 10 मिनट तक वापस टक्के पकाए। अभी 10 मिनट के बाद उसके अंदर दूसरे टमाटर और बडवानी मिर्च डालकर 5 मिनट तक पकाएं ।अगर इसको अपने में टाइम लगे तो जो भी ढक्कन लगाए उसके ऊपर आधा ग्लास पानी डालें ताकि नीचे से सब्जी जले नहीं पूरा उंधियू अच्छे से मिक्स हो ।अच्छे से सभी चीज मिक्स होने के बाद उसको वडवानी में और धनि त्त से सजाकर गरमागरम परोसें।",
            "सबसे पहले तुवर की दाल को धोकर कुकर में तीन सीटी आने तक पका लें\n" +
                    "\n" +
                    "जब डाल अच्छे से दब जाए तो उसको आधा गिलास पानी डालकर अच्छे से मिक्स करें फिर इसमें हल्दी जीरा धनिया पाउडर और कटी हुई हरी मिर्च डालकर अच्छे से मिला ले और इसमें गुड़ भी डाल दें और अच्छे से मिक्स कर दे\n" +
                    "\n" +
                    "कढ़ाई में 1 टेबलस्पून तेल डालें उसमें राई जीरा करी पत्ता डालें और फिर इसमें एक टमाटर बारीक कटा हुआ डालकर अच्छे से भून ले फिर इसमें हींग और लाल मिर्च पाउडर डालें और अच्छे से भुन ले फिर जो दाल हमने तैयार की है उसे पलट दे\n" +
                    "\n" +
                    "फिर इस दाल को 5 से 7 मिनट अच्छे से पकजाने दे इससे सारे मसालों की खुशबू दाल में आ जाएगी फिर इसमें आधा नीबू का रस डालें और स्वाद के अनुसार नमक डालें एक 2 मिनट के उबलने के बाद। गैस बंद कर दे औरइसे एक बड़े बर्तन में ट्रांसफर कर दें गुजराती खट्टी मीठी दाल बन कर तैयार हो गई है इसे रोटी या चावल के साथ गरमागरम परोसें",
            "एक बाउल लेंगे। उसमे बेसन ओर दही को डालकर अच्छी से मिक्स करेंगे।फिर 3 कप पानी डालकर पतला घोल तैयार कर लेंगे।\n" +
                    " \n" +
                    "अब गैस पर कड़ाही रखेंगे।घी डालेंगे।जीरा और राई डालेंगे।हींग डालेंगे।तैयार किया घोल डाल देंगे।2 मिनट तेज आंच पर चलाते हुए पकाएंगे। अब आंच धीमी कर देंगे।\n" +
                    "\n" +
                    "अदरख, हरी मिर्च का पेस्ट डाल देंगे।करी पत्ता डाल दें।नमक और चीनी डाल देंगे।अब 15 मिनट तक धीमी आंच पर चलाते हुए पकाएंगे। अगर कढ़ी गाढ़ी लगे तो थोड़ा पानी मिक्स कर लेंगे।\n" +
                    "अब हरा धनिया मिक्स कर गैस बंद कर देंगे। आपकी गुजराती कढ़ी तैयार है।" };
    String[] smsArray13 = {
            "सबसे पहले पनीर में कॉर्न फ्लौर,चावल आटा, मैदा,रंग,पानी,नमक डालकर पनीर को मारिनेट करे\n" +
                    "\n" +
                    "अब इसे डीप फ्राई कर ले\n" +
                    "अब इसे निकालकर ऊपर से नमक,चिल्ली फलैक्स,काली मिरच डालक्कर रखे\n" +
                    "\n" +
                    "एक कढ़ाई में तेल गर्म कर लहसुन और मिर्च डालें\n" +
                    "\n" +
                    "अब प्याज,गाजर,शिमला डालक्कर भून लें\n" +
                    "\n" +
                    "अब टमाटर और पत्ता गोभी डाले\n" +
                    "\n" +
                    "अब सॉस,नमक,काली मिर्च डालें\n" +
                    "\n" +
                    "अब इसमें कॉर्न फ्लौर का घोल डाले\n" +
                    "गरम पनीर चिल्ली को तीखी ग्रेवी,धनिया,सॉस,पत्ता गोभी के सलाद के साथ सर्व करें",
            "सबसे पहले आटे को नमक डॉलके नरम गूँथ ले।और बड़ी बड़ी थोड़ी पतली रोटी बेले।\n" +
                    "\n" +
                    "रोटी को दोनो तरफ से आधा सेक ले।\n" +
                    "\n" +
                    "अब रोटी पर हरीमिर्च की चटनी फैलाये।\n" +
                    "\n" +
                    "अब रोटी पर कोई भी बची हुई सब्जी को बारीक पीस कर फैलाये।\n" +
                    "\n" +
                    "सब्जी के ऊपर थोड़ा नमक लालमिर्च ओर मिक्स हर्ब्स लहसुन पाउडर ओर अमचूर छिड़के।\n" +
                    "\n" +
                    "अब रोटी को धीरे धीरे रोल करें और टूथ पिक से बंद करे।\n" +
                    "\n" +
                    "रोल को 15 मिनट फ्रिज में रखे फिर चाकू से छोटे रोल काट ले।\n" +
                    "\n" +
                    "सभी रोल को टूथपिक से टक करके चावल के आटे से कोट करके शैलो फ्राई करें ।दोनो तरफ कुरकुरा होने तक।\n" +
                    "\n" +
                    "सुनहरे कुरकुरे तीखे चपाती रोल को नारियल बूरा छिड़क कर हरी चटनी या दही डिप के साथ गरम ही सर्व करें।और एक हेल्थी ओर चटपटी रेसीपी को अपने बच्चों या बड़ो को दे जो जरा भी सब्जियों से परहेज करें।उनके लिए एक नया तरीका जरूर आजमाये।",
            "आटे में घी वाह बेकिंग पाउडर डालकर सबसे पहले डोह बनाकर रखेंगे।सत्तू चने का,में मसाले मिलेंगे और अदरक को भूनकर डालेंगे।आलू को उबालेंगे और हाथ से मैश करके उसमें सारे मसाले डाले हल्दी नमक में धनिया निंबू।टमाटर की प्यूरी बनाकर उसमें मिला दे।साबुत लाल मिर्च को एक चम्मच तेल में भूनकर मिलाएं।\n" +
                    "\n" +
                    "आटे की छोटी-छोटी लोई बनाएं और उसमें सत्तू भरे।बेकिंग पाउडर डालने के कारण ही पतली पतली बिल्कुल लोई बनाकरसत्तू भर के गोली तैयार करते हैं।अब इसे हम भी भी कर सकते हैं या घी तेल में तल सकते हैं?",
            "साबुत लाल मिर्च को गर्म पानी में 15 से 20 मिनट के लिए भिगो दीजिये।\n" +
                    "\n" +
                    "भीगी हुई लाल मिर्च को पानी से निकालकर मिक्सर जार में डालिए साथ में लहसुन डालकर बारीक पेस्ट बना लीजिए।\n" +
                    "\n" +
                    "मशरूम को अच्छी तरह से धो लीजिए।\n" +
                    "\n" +
                    "मशरूम और प्याज को थोड़े थोड़े मोटे मोटे सलाइसेंस में काट लीजिए।\n" +
                    "\n" +
                    "एक कढ़ाई में तेल डाल कर गरम कीजिए ।\n" +
                    "\n" +
                    "कटी हुई प्याज डालकर हल्का गुलाबी रंग बदलने तक भून ले और फिर लाल मिर्ची का पेस्ट स्वाद अनुसार नमक डालकर धीमी आंच पर 1 मिनट के लिए भून ले।\n" +
                    "\n" +
                    "कटी हुई शिमला मिर्च और मशरूम डालकर अच्छी तरह से मिक्स कीजिए।\n" +
                    "\n" +
                    "मशरूम शिमला मिर्च डाल कर लगातार चलाते हुए 1 मिनट तक पकाएं और ढककर 3 से 4 मिनट तक आइए।\n" +
                    "\n" +
                    "हमारी चिल्ली गार्लिक मशरूम तैयार है गरमा गरम चिल्ली गार्लिक मशरूम को सर्विंग प्लेट में निकाल कर हरी धनिया से सजाकर सर्व कीजिए।\n" +
                    "\n" +
                    "गरमा गरम चिल्ली गार्लिक मशरूम का लुत्फ उठाइए"
    };
    String[] smsArray14 = {
            "इडली के बैटर में नमक डालें और अच्छी तरह मिलाएँ इडली स्टैंड को तेल लगाकर चिकना कर लीजिए अब इडली स्टैंड में बैटर डालें और इसे 12 मिनट तक उबालें अब इसे ठंडा होने दें\n" +
                    "\n" +
                    "नारियल, चना दाल, अदरक, ४ हरी मिर्च, नमक इसे पीसो\n" +
                    "\n" +
                    "एक छोटा पैन लें एक चम्मच तेल गरम करें सरसों डालें करी पत्ते और चटनी में डालें और इसे अच्छे से मिला ले\n" +
                    "\n" +
                    "एक कढाई लें तलने के लिए तेल डालें अब इडली को फिंगर चिप्स की तरह काट लें और सुनहरा भूरा होने तक तलना",
            "सबसे पहले एक कढ़ाई ले गरम होने दे।उसमें 2 चमच्च तेल डाले फिर 1/2 राई डालें ।राय फुट(भून) जाने पर उरद दाल,कटी हुई हरी मिर्च लहसुन,अदरक और करी पत्ते डालकर थोड़ी देर भून लें।\n" +
                    "\n" +
                    "अब इसमें प्याज़ डाल दे।नमक और हल्दी डालकर प्याज़ थोड़ी देर २-३ मिनिट भुने।फिर अब इसमें कटे हुए टमाटर डाले।\n" +
                    "\n" +
                    "टमाटर को नरम होने तक पकाए।अब इसमे उबले हुए आलू को मसलकर डाल दे।मिक्स कर ले।\n" +
                    "\n" +
                    "मिक्स करने बाद एक दो चम्मच पानी डालकर 2 मिनिट तक पकाएं।आलू मसाला बनकर तैयार है।\n" +
                    "\n" +
                    "दोसा बनाने के लिये 1.5 चावल,1/2 कप उरद दाल,2-3 चम्मच चना दाल और 1/2 चमच्च मेथी के दाने एक कटोरे में डालकर धोकर 8 घण्टे के लिये भिगोकर रख दें।\n" +
                    "\n" +
                    "8 घण्टे या कम से कम 6 घंटे जरूर भिगोयें।चावल दाल अच्छी तरह फूल जाए तब थोड़े चावल दाल ग्राइंडर जार में डाले और 1/2 पोहा भी डालें (जिसे दोसा कुरकुरे बनेंगे) और पानी डालकर थोड़ा सा दरदरा पीस ले।बाकी के बचे हुए चावल दाल भी थोड़ा दरदारा पीसे बहुत बारीक न करें।\n" +
                    "\n" +
                    "इसके पिसे हुए मिश्रण को 12-16 घण्टे के लिए फेरन्मेंट होने लिए रख दे।गरम मौसम में जल्दी फरमेंट होता है लेकिन ठंडी थोड़ा ज्यादा टाइम लगता है।अच्छे से फरमेंट हो जाए तब इसमे 1/2 चम्मच मिला ले।\n" +
                    "\n" +
                    "अब एक नॉनस्टिक या फिर आयरन कास्टिंग तवे को गरम कर ले।1 बड़ा चमच्च घोल उस पर डाल दे।दोसे के आकार में फैला दी।चारो तरफ थोड़ी सी तेल या बटर डाले।\n" +
                    "\n" +
                    "जब दोसा नीचे से गोल्डन रंग का होने लगे तब उस पर आलू मसाला का मिश्रण डालकर फैला दे।दोसे को रोल कर ले।हमारा आलू मसाला दोसा बनकर तैयार हैं।आप इसे सांभर, नारियल या फिर टमाटर की चटनी के साथ गरम गरम परोसें।",
            "सबसे पहले मटर को हरी मिर्च अदरक के साथ मिक्सी में पीस ले। पीसे मटर को एक बर्तन में निकाल कर सूजी और दही के साथ मिला ले।\n" +
                    "\n" +
                    "10 मिनट तक उससे ढक कर रख दे।अब जरूरत के अनुसार पानी मिला ले।अब एनो मिला कर नमक मिला ले।कड़ाई में तेल डाल कर गर्म कर ले ।अब राई उरद दाल और कड़ी पत्ते पका कर मिश्रण में मिला ले।\n" +
                    "\n" +
                    "अब इडली के सांचे में तेल लगा कर सेट कर ले।बर्तन में पानी गर्म कर ले। साचे को सेट कर ले।20मिनिट पका लें। थोड़ी देर ठंडी होने के बाद प्याज की चटनी के साथ परोसें ।",
            "सारी सब्जियों को धो कर बडे टुकड़ों में काट ले प्याज व लहसुन भी काट ले।टमाटर भी साथ में काट ले ।दाल धोकर कूकर मे नमक व हल्दी डालकर 5 सीटी आने तक उबाल ले ।\n" +
                    "\n" +
                    "एक कूकर मे तेल गर्म करें । सरसों के दाने चटकाएं । हींग डाले ।\n" +
                    "\n" +
                    "कटी हुई सब्जियां डालकर मिलाए ।नमक व लाल मिर्च डाले और अच्छे से मिला ले और कूकर मे 1 सीटी लगवा ले। या खुले में तब तक पकाए जब तक सब्जियां पक जाए ।\n" +
                    "\n" +
                    "कूकर को तुरंत खोले और सांभर मसाला डाले ।\n" +
                    "\n" +
                    "अब दाल डाले और इमली का रस मिलाकर 5 मिनट तक हल्की आंच पर पकाए ।\n" +
                    "\n" +
                    "तैयार है स्वादिष्ट सांभर । इसे चावल के साथ परोसे ।"

    };


    String[] msArray01 = {

            "1 बड़ा कप पोहा\n" +
                    "1 कटोरी मटर\n" +
                    "1 आलू\n" +
                    "2 प्याज\n" +
                    "1 टमाटर\n" +
                    "1/2 चम्मच सरसों दाना\n" +
                    "6-7 कढ़ी पत्ता\n" +
                    "स्वादानुसार नमक\n" +
                    "1 टेबल स्पून चीनी\n" +
                    "1/2 स्पून हल्दी पाउडर\n" +
                    "1 बड़ा चम्मच तेल\n" +
                    "1 नींबू",
            "500 ग्राम आलू\n" +
                    "1/2 कप ब्रेड क्रम्स\n" +
                    "1 टी स्पून चिली फ्लेक्स\n" +
                    "1 टी स्पून चाट मसाला\n" +
                    "1 टी स्पून नमक\n" +
                    "1/2 टी स्पून काली मिर्च पाउडर\n" +
                    "2 हरी मिर्च बारीक कटी हुई\n" +
                    "1/2\" अदरक बारीक कटा हुआ\n" +
                    "1/2 कप हरा धनियां\n" +
                    "2 चीज़ क्यूब कद्दूकस की हुई\n" +
                    "कोटिंग के लिए:\n" +
                    "1/4 कप मैदा\n" +
                    "1 टेबल स्पून कॉर्न फ्लोर\n" +
                    "4 स्लाइस ब्रेड के क्रम्स\n" +
                    "2 कटोरी तलने के लिए तेल\n" +
                    "डीप:\n" +
                    "1 टेबल स्पून दही\n" +
                    "1 टी स्पून रेड चिली सॉस\n" +
                    "1/4 कप टोमेटो सॉस\n" +
                    "1 टी स्पून हरी चटनी या 1/2 टी स्पून हरी मिर्च पिसी हुई","" +
            "2 स्लाइस ब्रेड\n" +
            "2 टेबलस्पून बटर\n" +
            "1 टेबलस्पून पिज़्ज़ा सॉस\n" +
            "1 टेबलस्पून टोमेटो केचप\n" +
            "4 टेबलस्पून मोज़ेरेला चीज़\n" +
            "2 टेबलस्पून गाजर\n" +
            "2 टेबलस्पून प्याज़\n" +
            "2 टेबलस्पून शिमला मिर्च\n" +
            "1 टेबलस्पून भुट्टे के दाने (उबले हुए)\n" +
            "1 स्लाइस प्रोसेस्ड चीज़\n" +
            "1 टेबलस्पून ऑरेगैनो /मिक्स्ड हर्ब्स\n" +
            "1 टेबलस्पून चिल्ली फ्लेक्स",
            "1 कप पत्तागोभी\n" +
                    "1 कप मटर\n" +
                    "1 कप शिमला मिर्च\n" +
                    "2 आलु\n" +
                    "1 छोटा चम्मच पाव भाजी मसाला\n" +
                    "1 कप अदरक लहसुन मिर्च पेस्ट\n" +
                    "2 चम्मच बटर\n" +
                    "1 नींबू और कटा हरा धनिया\n" +
                    "नमक स्वादानुसार\n" +
                    "3-4 चम्मच तेल"
    };
    String proc[]={
            "आलू प्याज, टमाटर को काट लें पोहा को धो कर नमक और हल्दी डाल कर रखे\n" +
                    "  \n" +
                    "अब कढ़ाई में तेल गरम करें उसमें सरसों दाना और कढ़ी पत्ता डालें फिर आलू प्याज को भूनें\n" +
                    "  \n" +
                    "अब उसमें टमाटर डालें भूनें मटर और चीनी डाले फिर उसमें पोहा डाले उसको अच्छे से मिक्स कर ले नींबू डालें और अच्छे से मिक्स करें थोड़ी देर पकाए\n" +

                    "  \n" +
                    "और धनिया पत्ती डालें और सर्व करें",
            "उबले हुए आलू में सब चीजे डालके मिला ले।\n" +
                    " \n" +
                    "एक थाली या केक के मोल्ड में चिकनाई लगा के, आलू डालके दबा के एक समान कर ले । अब उसको क्लीन रैप लगाके फ्रिज में १ से २ घंटे के लिए रह दे।\n" +
                    "\n" +
                    "कवर करने के लिए मैदा और कॉर्न फ्लोर का पतला घोल तैयार करें।डीप बनाने की लिए सब मिला ले ।\n" +
                    "  \n" +
                    "अब फ्रिज में सें आलू की ट्रे निकाल के छुरी से एक जैसे लंबे टुकड़े काट ले ।\n" +
                    "  \n" +
                    "तेल गरम करने रखे । आलू के फिंगर को मैदे के घोल में डुबोकर ब्रेड क्रम में लपेट लें। अब गरम तेल में तेज आंच पे फिंगर को सुनहरा तल ले ।\n" +
                    " \n" +
                    "अब गरम गरम फिंगर डीप के साथ सर्व करें ।",
            "गाजर को कद्दूकस कर लें |प्याज़ व शिमला मिर्च को बारीक काट लें |दोनों तरह के चीज़ को भी कद्दूकस करें |\n" +
                    "  \n" +
                    "ब्रेड स्लाइस पर एक साइड बटर लगा कर धीमी आँच पर तवे पर सेकें |\n" +
                    "  \n" +
                    "अब सेंकी हुई साइड पर पिज़्ज़ा सॉस, केचप व मोज़ेरेला चीज़ लगाए |\n" +
                    "  \n" +
                    "सभी सब्जी लगाएं, दोनों तरह का चीज़ लगाएं |हर्ब्स और चिल्ली फ्लेक्स डालें |\n" +
                    "  \n" +
                    "तवे पर बटर लगाएं, ब्रेड को धीमी आँच पर ढककर सेक लें |गरमा गरम पिज़्ज़ा तैयार है",
            "सबसे पहले सारी सब्जियों को काटकर उबाल लें\n" +
                    "\n" +
                    "  \n" +
                    "अब एक पेन ले तेल डाले अदरक वाला पेस्ट डाले भूने उसमें पाव भाजी मसाला डाले सब्जी का पेस्ट डाले अच्छी तरह पकाए, उसमें नमक नीबू धनिया डाले और बटर मिला ले और सर्व करें\n" +
                    "\n"

    };
    String[] msArray02 = {
            "4 आलू उबले हुए\n" +
                    "1 प्याज कटा हुआ\n" +
                    "2 हरी मिर्च कटी हुई\n" +
                    "2 चम्मच हरा धनिया कटा हुआ\n" +
                    "नमक स्वादानुसार\n" +
                    "1/2 चम्मच लाल मिर्च\n" +
                    "1/2 चम्मच अमचूर पाउडर\n" +
                    "1/2 चम्मच जीरा पाउडर\n" +
                    "4 चम्मच घी\n" +
                    "1 कप गेहूं का गुंधा आटा",
            "2 कटोरी आटा\n" +
                    "1 बडी कटोरी मक्खन\n" +
                    "2 प्याज बारीक कटे हुए\n" +
                    "हरी मिर्च स्वादानुसार\n" +
                    "नमक स्वादानुसार\n" +
                    "1 चम्मच धनिया पाउडर\n" +
                    "1/2 चम्मच लाल मिर्च\n" +
                    "1/2 चम्मच जीरा पाउडर\n" +
                    "1/2 चम्मच चाट मसाला\n" +
                    "2 चम्मच कटे हुए हरी धनिया\n" +
                    "पराठों को सेकने के लिए आवस्यकता अनुसार तेल या घी",
            "2 गेहूं का आटा\n" +
                    "1 मुंग दाल\n" +
                    "1/2 टेबल चम्मच लाल मिर्च पाउडर\n" +
                    "1/2 धनीया पाउडर\n" +
                    "1 चुटकी हिंग\n" +
                    "2 चुटकी गरम मसाला\n" +
                    "1 टेबल चम्मच सोंफ क्रश किये\n" +
                    "-1/2 कप कटी हुई धनिया पत्ती\n" +
                    "1 इंच अदरक कद्दूकस\n" +
                    "1 फाइन कटी हुई हरी मिर्च\n" +
                    "नमक स्वादानुसार\n" +
                    "आयल फॉर शैलो फ्राई",
            "1 कप पनीर\n" +
                    "नमक स्वादानुसार\n" +
                    "लाल मिर्च स्वादानुसार\n" +
                    "1/2 स्पून अजवायन\n" +
                    "1 स्पून तेल\n" +
                    "1/2-1 कप आटा परांठा बनाने के लिए"};
        String[] msArray03 = {

            "1 कप साबूदाना\n" +
                    "1 आलू\n" +
                    "1/4 कप मूंगफली\n" +
                    "1 हरी मिर्च\n" +
                    "नमक स्वादानुसार\n" +
                    "तेल",
            "1 कप कुट्टू का आटा\n" +
                    "1 कप घी\n" +
                    "1/2 कप शक्कर पाउडर\n" +
                    "1/2 कप मसाला दूध पाउडर\n" +
                    "बहुत सारा प्यार",
            "1 कप साबूदाना (भीगे हुए)\n" +
                    "१ आलू उबला हआ\n" +
                    "१/२ कप मूंगफली के दाने (दरदरे कुटे)\n" +
                    "२-३ चम्मच हरा धनिया - 2-3 टेबल स्पून (बारीक कटा हुआ)]\n" +
                    "सैंधा नमक स्वादानुसार\n" +
                    "हरी मिर्च - 2 (बारीक कटी हुई)\n" +
                    "काली मिर्च पाउडर\n" +
                    "तेल - तलने के लिए",
            "दूध 1 किलो\n" +
                    "साबूदाना १०० ग्राम\n" +
                    "चीनी 150 ग्राम\n" +
                    "इलाइची पाउडर १/२ चम्मच\n" +
                    "ड्राई फूड्स"

    };
    String[] msArray04 = {
            "1 बड़ा चम्मच गुड़\n" +
                    "3 से 4 साबुत लाल मिर्च\n" +
                    "1 चम्मच नमक\n" +
                    "4 से 5 कलियां लहसुन\n" +
                    "1 इंच अदरक टुकड़ा\n" +
                    "2 प्याज़\n" +
                    "2 टमाटर"};
    String[] msArray05 = {

            "500 ग्राम आंवला\n" +
                    "6 चम्मच धनिया पाउडर\n" +
                    "4 चम्मच लाल मिर्च पाउडर\n" +
                    "2 चम्मच अमचूर पाउडर\n" +
                    "4 लाल मिर्च पाउडर\n" +
                    "6 चम्मच पंचफोरन\n" +
                    "4 चम्मच नमक\n" +
                    "4 चम्मच राई है दाल\n" +
                    "2 चम्मच जीरा पाउडर\n" +
                    "1/2 कप राई तेल",
            "आंवला धोके उबालने के लिए ढक कर रख दें उसे उतना ही उबालें कि जिस से आंवला के फांकें अलग हो जाए उबालने के बाद उसे पानी से अलग कर दें और उसे ठंडा करें फिर उसके सारे फाके अलग करें अब कढ़ाई में पंचफोरन डाल के भूनें और सुनहरा होने पर निकालकर पीस लें अब कढ़ाई को गर्म करें और उसमें राई तेल डालें फिर उतार ले और गर्म तेल में ही धनिया पाउडर आंवला मिर्ची पाउडर नमक\n" +
                    "\n" +
                    "  \n" +
                    "राई दाने अमचूर पाउडर जीरा पाउडर और पंचफोरन का मसाला पिसा हुआ डालकर मिला ले अच्छे से मिल जाने पर उसे एक कांच के जार में भर के रख ले 1 दिन धूप भी दिखाने के बाद आप उसे खाने के साथ परोसे आंवला का अचार टेस्ट के साथ हेल्थी भी होता है",
            "2 बड़े चम्मच सरसों का तेल\n" +
                    "1 छोटी चम्मच ज़ीरा\n" +
                    "1 छोटी चम्मच खड़ा धनिया\n" +
                    "1 छोटी चम्मच सौंफ\n" +
                    "1 छोटी चम्मच अजवाइन\n" +
                    "2 छोटी चम्मच लाल मिर्च पाउडर\n" +
                    "2 छोटी चम्मच धनिया पाउडर\n" +
                    "1 छोटी चम्मच हल्दी\n" +
                    "2 छोटी चम्मच अचार मसाला\n" +
                    "नमक स्वादानुसार\n" +
                    "1/2 निम्बू का रस",
            "2 चम्मच नमक\n" +
                    "1 चमच तेल सरसों\n" +
                    "100 ग्राम राई या पीली\n" +
                    "1/2 किलो लाल मिर्च\n" +
                    "1 चम्मच हल्दी"
    };
    String[] msArray06 = {
            "1/2 कप स्प्राउट चना\n" +
                    "1 प्याज बारीक कटा\n" +
                    "1 गाजर घिसी हुई\n" +
                    "1 बड़ा चम्मच लम्बाई में कटी लाल पत्ता गोभी\n" +
                    "1 हरी मिर्च बारीक कटी\n" +
                    "1 बड़ा चम्मच हरी पत्तागोभी लम्बाई में कटी\n" +
                    "1 बड़ा चम्मच मेयोनीज\n" +
                    "स्वादानुसार नमक\n" +
                    "10 काले अंगूर के दाने कटे हुए\n" +
                    "4 अखरोट सजाने के लिए",
            "2-3 कच्ची हल्दी\n" +
                    "2-3 नीम्बु\n" +
                    "1/2 चम्मच नमक",
            "2 खीरे गोल कटे\n" +
                    "1 चम्मच नींबू रस\n" +
                    "स्वादानुसार नमक\n" +
                    "1 छोटी चम्मच चाट मसाला पाउडर",
            "1 कप बारीक कटी पत्ता गोभी\n" +
                    "2 टेबल स्पून गाज़र मोटी कद्दूकस की हुई\n" +
                    "2 टेबल स्पून खीरा बारीक कटा हुआ\n" +
                    "1 छोटा प्याज़ बारीक कटा हुआ\n" +
                    "1 टमाटर बारीक कटा हुआ\n" +
                    "1 टेबल स्पून हरा धनिया पत्ती कटा हुआ\n" +
                    "स्वादानुसार नमक\n" +
                    "स्वादानुसार काली मिर्च पाउडर\n" +
                    "1/2 टी स्पून चाट मसाला\n" +
                    "1/2 निम्बू का रस"
    };
    String[] msArray07 = {
            "100 ग्राम हरी मिर्च\n" +
                    "2 प्याज\n" +
                    "12 कलियाँ लहसुन\n" +
                    "4 टमाटर\n" +
                    "1/2 कटोरी छाछ या दही\n" +
                    "1 चम्मच हल्दी पाउडर\n" +
                    "1 चम्मच धनिया पाउडर\n" +
                    "1/2 चम्मच जीरा\n" +
                    "2-3 चम्मच तेल\n" +
                    "1 चुटकी हींग","4 टमाटर\n" +
            "7 _8 लहसून की कलियाँ\n" +
            "1 प्याज\n" +
            "1 टुकड़ा अदरक\n" +
            "1/2 पीसा हुआ ताजा नारियल\n" +
            "गरम मसाले\n" +
            "1/2 चम्मच हल्दी पाउडर\n" +
            "2 चम्मच लाल मिर्च पाउडर\n" +
            "1 चम्मच जीरा पाउडर\n" +
            "1 चम्मच धनिया पाउडर\n" +
            "कडी पत्ता\n" +
            "हरा धनिया\n" +
            "नमक स्वादानुसार\n" +
            "तेल\n" +
            "राई\n" +
            "तेज पत्ता",
            "2 टमाटर बारीक कटी हुई\n" +
                    "1 बड़ी चम्मच तेल\n" +
                    "1 चुटकी हींग\n" +
                    "1 छोटी चम्मच जीरा\n" +
                    "1/2 छोटी चम्मच नमक\n" +
                    "1/2 छोटी चम्मच हल्दी\n" +
                    "1 छोटी चम्मच लाल मिर्च पाउडर\n" +
                    "2 छोटी चम्मच धनिया पाउडर"
    };
    String[] msArray08 = {
            "1कटोरी अरहर की दाल\n" +
                    "5 भिंडी\n" +
                    "1 गाजर\n" +
                    "1 प्याज\n" +
                    "5 लहसुन कलियाँ\n" +
                    "1 बैंगन\n" +
                    "2 टमाटर\n" +
                    "3 बडे चम्मच तेल\n" +
                    "1 छोटी चम्मच सरसों\n" +
                    "1 चुटकी हींग\n" +
                    "2 बडे चम्मच इमली का रस\n" +
                    "नमक स्वादानुसार\n" +
                    "लाल मिर्च पाउडर स्वादानुसार\n" +
                    "1/2 छोटी चम्मच हल्दी\n" +
                    "1 बडा चम्मच सांभर मसाला",
            "सांभर के लिए-\n" +
                    "1 कटोरी तुअर दाल\n" +
                    "इडली के लिए-\n" +
                    "1 कटोरी उडद दाल\n" +
                    "3 कटोरी चावल\n" +
                    "1/2 चम्मच मैथी दाना\n" +
                    "सांचे में लगाने के लिए तेल\n" +
                    "नमक स्वादानुसार\n" +
                    "1 कप कटी लौकी\n" +
                    "2 सांभर प्याज\n" +
                    "4 कलियाँ लहसुन\n" +
                    "1/2 इंच टुकड़ा अदरक\n" +
                    "1 हरी मिर्च\n" +
                    "8-10 करी पत्ती\n" +
                    "2 टमाटर पिसा हुआ\n" +
                    "4 सूखी लाल मिर्ची\n" +
                    "1/4 चम्मच हींग\n" +
                    "1 चम्मच हल्दी\n" +
                    "1/2 चम्मच मैथी दाना\n" +
                    "1/2 चम्मच लाल मिर्ची या इच्छा के अनुसार\n" +
                    "2 चम्मच सांभर मसाला\n" +
                    "2 चम्मच इमली गूदा\n" +
                    "1 चम्मच जीरा\n" +
                    "नमक स्वादानुसार\n" +
                    "2 चम्मच तेल\n" +
                    "चटनी के लिए-\n" +
                    "1/2 कप मूंगफली दाना भुने, छिले\n" +
                    "1/2 कप दही\n" +
                    "2 हरी मिर्ची\n" +
                    "1/6 गड्डी धनिया पत्ती\n" +
                    "5-6 करी पत्ती\n" +
                    "1 चम्मच राई\n" +
                    "2 सूखी लाल मिर्ची\n" +
                    "नमक स्वादानुसार\n" +
                    "1 चम्मच तेल",
            "1 कटोरी बेसन\n" +
                    "1/2 कटोरी मैदा\n" +
                    "2 चम्मच सूजी\n" +
                    "1/2 चम्मच हल्दी पाउडर\n" +
                    "1/2 चम्मच अजवायन\n" +
                    "2 चम्मच गर्म तेल\n" +
                    "स्वादानुसार नमक\n" +
                    "भरावन के लिए\n" +
                    "1 गड्डी धनिया पत्ती बारीक कटा हुआ\n" +
                    "1 छोटी कटोरी किसा हुआ नारियल\n" +
                    "2 चम्मच मूंगफली भुनी और पीस हुआ\n" +
                    "2 चम्मच खसखस\n" +
                    "1 चम्मच तिल\n" +
                    "1 चम्मच चिरौजी दाने\n" +
                    "1 हरी मिर्च बारीक कटा हुआ\n" +
                    "4-5 कली लहसुन\n" +
                    "1/2 चम्मच हल्दी पाउडर\n" +
                    "1/2 चम्मच जीरा\n" +
                    "1 चम्मच सौंफ\n" +
                    "1/2 चम्मच गरम मसाला\n" +
                    "1/2 चम्मच अमचूर\n" +
                    "चुटकी हींग\n" +
                    "2 चम्मच तेल\n" +
                    "1/2 चम्मच अजवायन\n" +
                    "2 साबुत लाल मिर्च तोड़ा हुआ\n" +
                    "1/2 चम्मच शक्कर\n" +
                    "स्वादानुसार नमक\n" +
                    "आवश्यकतानुसार तेल तलने के लिए",
            "1 कप सूजी\n" +
                    "1/2 कप दही\n" +
                    "1/2 कप पानी\n" +
                    "1 पाउच इनो\n" +
                    "स्वादानुसार नमक\n" +
                    "आवश्यकता अनुसार सरसों काली"
    };
    String[] msArray09 = {

            "6 स्लाइस ब्रेड का\n" +
                    "फ्राई करने के लिए घी\n" +
                    "चासनी बनाने की सामग्री\n" +
                    "1 कप पानी\n" +
                    "1 कप शक्कर\n" +
                    "2 हरी इलाइची का पाउडर\n" +
                    "रबड़ी बनाने के लिए सामग्री\n" +
                    "1 कप दूध\n" +
                    "1/2 कप मिल्क पाउडर\n" +
                    "2 चम्मच शक्कर\n" +
                    "1 चम्मच घी\n" +
                    "4 बादाम स्लाइस की हुई\n" +
                    "4 काजू स्लाइस की हुई\n" +
                    "6 पिस्ता स्लाइस की हुई",
            "1 किलो गाजर\n" +
                    "2 कप मिल्क\n" +
                    "2 टेबल स्पून घी\n" +
                    "2 इलायची\n" +
                    "1 कप मिल्कमेड\n" +
                    "2 टेबल स्पून शुगर\n" +
                    "5-7 बादाम कटे हुए\n" +
                    "2 टेबल स्पून नारियल का भूरा",
            "4 ब्रेड मिक्सी में बारीक पिसा हुआ\n" +
                    "3/4 कप शक्कर\n" +
                    "3/4 कप नारियल बुरा\n" +
                    "1 चम्मच घी\n" +
                    "1 कप दूध\n" +
                    "4.5 काजू बारीक कटे हुए\n" +
                    "2 छुहारा के छोटे टुकड़े\n" +
                    "10.12 गुल कतरी",
            "2 फ्रेश एप्पल\n" +
                    "1 लीटर फुल क्रीम दूध\n" +
                    "1 कप शक्कर\n" +
                    "3-4 इलायची\n" +
                    "10-12 बदाम\n" +
                    "10-12 काजू\n" +
                    "5-6 पिस्ता" };
    String[] msArray10 = {            "1 किलो चिकन\n" +
            "3 मिडियम साइज़ प्याज़ \uD83E\uDDC5 पेस्ट किया हुआ\n" +
            "1 टुकड़ा अदरक\n" +
            "लहसुन \uD83E\uDDC4 7-8 पीस\n" +
            "2 टेबलस्पून दही\n" +
            "काजु 15 पीस\n" +
            "1 टेबलस्पून खस-खस\n" +
            "1 टेबलस्पून चीनी\n" +
            "2 तेज़ पत्ता\n" +
            "4-5 इलाइची\n" +
            "4-5 लौंग\n" +
            "2-3 सूखी लाल मिर्च \uD83C\uDF36\n" +
            "1 टेबलस्पून काली मिर्च पाउडर\n" +
            "1 टीस्पून ज़ीरा पाउडर\n" +
            "2 चम्मच घी\n" +
            "2 चम्मच रिफाइनड तेल\n" +
            "1/2 टीस्पून हल्दी\n" +
            "2-3 हरी मिर्च",
            "1 केजी चिकन\n" +
                    "6 टेबल स्पून दही\n" +
                    "1 टी स्पून कश्मीरी लाल मिर्च पाउडर\n" +
                    "1 टी स्पून नमक\n" +
                    "1 +1 टेबल स्पून अदरक लहसुन पेस्ट\n" +
                    "ग्रेवी\uD83D\uDC47\n" +
                    "4 टमाटर\n" +
                    "3 प्याज़\n" +
                    "1 टेबल स्पून लहसुन पेस्ट\n" +
                    "25 काजू\n" +
                    "5 टेबल स्पून मलाई\n" +
                    "5 टेबल स्पून हरा धनिया\n" +
                    "1 टी स्पून गरम मसाला पाउडर\n" +
                    "1 टेबल स्पून भूूनी कस्तूरी मेथी\n" +
                    "1 टी स्पून लाल मिर्च पाउडर\n" +
                    "1 टी स्पून नमक\n" +
                    "बटर\n" +
                    "2 मेस\n" +
                    "3 हरी इलायची\n" +
                    "1 टेबल स्पून सॉस\n" +
                    "6 _7 ऑयल",
            "1 टेबलस्पून कसूरी मेथी\n" +
                    "1/2 किलो मटन\n" +
                    "1 टी स्पून लाल मिर्च पाउडर\n" +
                    "नमक स्वादानुसार\n" +
                    "1 कप प्याज की प्युरी\n" +
                    "1 कप टमाटर की प्युरी\n" +
                    "1 टेबलस्पून भुना मसाला\n" +
                    "1 टेबलस्पून धनिया पाउडर\n" +
                    "1 टेबलस्पून गरम मसाला पाउडर\n" +
                    "1 टेबलस्पून मटन मसाला पाउडर\n" +
                    "1 टेबलस्पून माखन\n" +
                    "1 टी स्पून हल्दी पाउडर\n" +
                    "1 टेबलस्पून तेल\n" +
                    "1 कप दही\n" +
                    "1 टी स्पून लहसुन अदरक का पेस्ट\n" +
                    "5-6 हरी मिर्च\n" +
                    "2-3 छोटी इलायची\n" +
                    "1-2 लौंग\n" +
                    "4-5 काली मिर्च\n" +
                    "1 टी स्पून पोस्ता दाना\n" +
                    "1 टी स्पून खड़ा धनिया\n" +
                    "1 टी स्पून जीरा\n" +
                    "पानी आवश्यकतानुसार",
            "1/2 किलो फिश\n" +
                    "1 टीस्पून नींबू का रस\n" +
                    "1 जीरा\n" +
                    "1 खड़ा धनिया\n" +
                    "नमक स्वादानुसार\n" +
                    "पानी आवश्यकतानुसार\n" +
                    "1 टीस्पून गोन मसाला पाउडर\n" +
                    "1 टीस्पून फिश मसाला\n" +
                    "1 टीस्पून लहसुन अदरक का पेस्ट\n" +
                    "1 टीस्पून गरी का बुरादा\n" +
                    "1 टीस्पून लाल मिर्च पाउडर\n" +
                    "1 टीस्पून बारीक कटा हुआ लहसुन\n" +
                    "1 टीस्पून बारीक कटा हुआ हरी मिर्च\n" +
                    "1 कप प्याज की प्युरी\n" +
                    "1 कप टमाटर की प्युरी\n" +
                    "1 टीस्पून इमली का पल्प\n" +
                    "2 टेबलस्पून तेल"
    };
    String[] msArray11 = {
            "1/2 किलो छोला उबला हुआ\n" +
                    "2 प्याज़ पिसा हुआ\n" +
                    "2 टमाटर पिसा हुआ\n" +
                    "2 हरी मिर्च कटी\n" +
                    "1 इंच अदरक का टुकड़ा घीसा हुआ\n" +
                    "1 चमच्च हल्दी\n" +
                    "2 चमच्च धनिया पाउडर\n" +
                    "1 चमच्च गरम मसाला\n" +
                    "1 चमच्च लाल मिर्च\n" +
                    "नामक स्वादनुसार\n" +
                    "2 चमच्च तेल\n" +
                    "1 चुटकी कस्तूरी मेथी\n" +
                    "हरी धनिया।\n" +
                    "1/2 किलो मैदा\n" +
                    "1 चुटकी सोडा",
            "1 कटोरी मटर चना\n" +
                    "1 कटा हुआ प्याज\n" +
                    "1 कटोरी कटा हुआ टमाटर\n" +
                    "आवश्यकता अनुसार हरा धनिया हरी मिर्च\n" +
                    "1 चमच घिसा हुआ अदरक\n" +
                    "100 ग्राम मखन\n" +
                    "2 चमच लाल मिर्च पाउडर\n" +
                    "1/2 कटोरी नींबू का रस\n" +
                    "2 चमच चाट मसाला\n" +
                    "2 चमच भुना जीरा\n" +
                    "स्वादानुसार नमक\n" +
                    "4 कुलचे",
            "1-1/4 कप छोले (7-8 घंटे भीगे)\n" +
                    "1 आनार का सूखा छिलका\n" +
                    "2 बड़ी इलायची\n" +
                    "1 टुकड़ा दालचीनी\n" +
                    "1 चम्मच नमक\n" +
                    "मसाले\n" +
                    "स्वादानुसार नमक\n" +
                    "2 चम्मच धनिया पाउडर\n" +
                    "1/2 चम्मच लाल मिर्च पाउडर\n" +
                    "1/4 चम्मच अमचूर पाउडर\n" +
                    "1/4 चम्मच भुना जीरा पाउडर\n" +
                    "1/2 छोटी चम्मच अनार दाना पाउडर\n" +
                    "1 तेजपत्ता\n" +
                    "1/2 चम्मच गरम मसाला\n" +
                    "4 टमाटर कटे हुए\n" +
                    "3-4 हरी मिर्च\n" +
                    "1-2 प्याज बारीक कटी\n" +
                    "1 छोटा अदरक\n" +
                    "2 tbsp तेल\n" +
                    "भटूरे के लिए\n" +
                    "250 ग्राम मैदा\n" +
                    "250 ग्राम आटा\n" +
                    "1/2 चम्मच नमक\n" +
                    "1/2 चम्मच चीनी\n" +
                    "1 बड़ा चम्मच तेल\n" +
                    "1 चम्मच दही\n" +
                    "1 इनो का पैकेट\n" +
                    "1/2 चम्मच बेकिंग पाउडर\n" +
                    "1/4 चम्मच सोडा\n" +
                    "(आटे का बढ़ना मौसम पर है) जल्दी बनाने के लिए इनो का इस्तेमाल करे",
            "2 कप मकई का आटा\n" +
                    "1/2 कप गेहूं का आटा\n" +
                    "4 चम्मच मेथी कटी हुई\n" +
                    "1/2 चम्मच अजवायन\n" +
                    "नमक स्वादानुसार\n" +
                    "1/4 चम्मच लाल मिर्च\n" +
                    "4 चम्मच घी\n" +
                    "4 जुड़ी सरसों के पत्ते\n" +
                    "1 चम्मच लहसुन कटा हुआ\n" +
                    "1 चम्मच अदरक कटा हुआ\n" +
                    "1 प्याज कटा हुआ\n" +
                    "2 हरी मिर्च कटी हुई\n" +
                    "3 टमाटर पिसा हुआ\n" +
                    "नमक स्वादानुसार\n" +
                    "1/2 चम्मच गर्म मसाला\n" +
                    "1/2 चम्मच धनिया पाउडर\n" +
                    "1/4 चम्मच हल्दी\n" +
                    "2 चम्मच तेल\n" +
                    "2 तेजपत्ता\n" +
                    "1/2 चम्मच जीरा\n" +
                    "1 टुकड़ा दालचीनी\n" +
                    "4 लौँग\n" +
                    "4-5 काली मिर्च के दानें\n" +
                    "2 छोटी इलायची\n" +
                    "1 चम्मच भुना बेसन" };
    String[] msArray12 = {        "1 कप गेहूं का आटा\n" +
            "1/2 कप कटी हुई गाजर\n" +
            "1/2 कप कटी हुई गोभी\n" +
            "1 कप कटा हुआ टमाटर\n" +
            "1/2 कप कटी हुई मिर्च\n" +
            "3 कटे हुए आलू\n" +
            "1/2 कप उबली हुई चोली\n" +
            "1 कप धूल कर भिगोए हुए चावल\n" +
            "1 कप खिचड़ी (मूंग दाल + चावल)\n" +
            "1 कप ढोकले का बैटर\n" +
            "1 कप बेसन\n" +
            "1/4 कप कटी हुई मेथी\n" +
            "1/2 कप कटा हरा धनिया\n" +
            "1/2 चम्मच हल्दी पाउडर\n" +
            "1/2 चम्मच लाल मिर्च पाउडर\n" +
            "1/2 चम्मच धनिया जीरा पाउडर\n" +
            "1/2 चम्मच गरम मसाला\n" +
            "1 टुकड़ा दालचीनी\n" +
            "2 लौंग\n" +
            "स्वादानुसार नमक\n" +
            "स्वादानुसार चीनी\n" +
            "1/2 चम्मच राई\n" +
            "1/2 चम्मच जीरा\n" +
            "1/2 चम्मच हींग\n" +
            "6-7 कढ़ी पत्ता\n" +
            "1 चम्मच अदरक मिर्च लहसुन का पेस्ट\n" +
            "1 कप उबली हुई तुवर दाल\n" +
            "1 कप चावल\n" +
            "1 कप गाजर कसा हुआ\n" +
            "1 लीटर दूध\n" +
            "आवश्यकता अनुसार काजू कटा हुआ\n" +
            "1/2 छोटा चम्मच केसर\n" +
            "आवश्यकता अनुसार तेल\n" +
            "आवश्यकता अनुसार घी\n" +
            "1 चम्मच खजूर इमली की चटनी\n" +
            "1 छोटी चम्मच मिर्च का अचार\n" +
            "आवश्यकता अनुसार मुरब्बा\n" +
            "आवश्यकता अनुसार उरद पापड़\n" +
            "आवश्यकतानुसार छाछ\n" +
            "आवश्यकता अनुसार फ्रायम तले हुए\n" +
            "आवश्यकता अनुसार मीठे पान का मुखवास",
            "मेथी बड़ा के लिए--\n" +
                    "1/2 कप चने का आटा\n" +
                    "1/5 कप गेहूं का आटा\n" +
                    "1/5 कप बाजरे का आटा\n" +
                    "4 कप वड़ा तलने के लिए तेल\n" +
                    "1/2 कप मेथी भाजी\n" +
                    "नमक स्वादानुसार\n" +
                    "1/3 चम्मच हल्दी\n" +
                    "1 बड़ा चम्मच तेल\n" +
                    "उंध्यु के लिए---\n" +
                    "2 बड़े चम्मच तेल\n" +
                    "1/4 कप वालपापड़ी\n" +
                    "1/5 कप तुवर के दाने\n" +
                    "1/5 कप मटर\n" +
                    "4 लाल टमाटर\n" +
                    "2 कच्चे केले का मसाला\n" +
                    "(कच्चे केले का मसाला बनाने के लिए राई, जीरा, तेल, गरम मसाला)\n" +
                    "1 कच्चा केला\n" +
                    "1/4 कप कोबीज़\n" +
                    "1/5 कप शिमला मिर्च\n" +
                    "10 वढवानी मिर्च\n" +
                    "1/4 कप टिंडा\n" +
                    "3 चमची उंद्या का मसालाअथवा तो गरम मसाला\n" +
                    "1 चम्मच हल्दी पाउडर\n" +
                    "1/2 चम्मच हींग\n" +
                    "3 चम्मच लाल मिर्च पाउडर\n" +
                    "1 चम्मच नींबू का रस\n" +
                    "1/4 कप धनिया पत्ती",
            "1 कटोरी तुवर की दाल\n" +
                    "2 चम्मच गुड\n" +
                    "1 छोटी चम्मच अदरक का पेस्ट\n" +
                    "1 हरी मिर्च लंबी कटी हुई\n" +
                    "810 करी पत्ते\n" +
                    "1 चम्मच जीरा\n" +
                    "1 चम्मच राई\n" +
                    "2 लोंग\n" +
                    "1 मीडियम साइज का टमाटर बारीक कटा हुआ\n" +
                    "1 चम्मच नींबू का रस\n" +
                    "चुटकी भर हींग\n" +
                    "1/4 चम्मच हल्दी पाउडर\n" +
                    "1/2 छोटी चम्मच लाल मिर्च पाउडर\n" +
                    "नमक स्वाद अनुसार",
            "2 कप ताज़ा दही\n" +
                    "1/2 कप बेसन\n" +
                    "8 करी पत्ते\n" +
                    "1/2 चम्मच अदरख हरी मिर्च पेस्ट\n" +
                    "1/4 चम्मच जीरा\n" +
                    "1/4 चम्मच राई\n" +
                    "1 चुटकी हींग पाउडर\n" +
                    "2 चम्मच चीनी\n" +
                    "2 चम्मच हरा धनिया\n" +
                    "2 चम्मच देसी घी\n" +
                    "नमक स्वादानुसार\n" +
                    "पानी जरूरत अनुसार"
    };
    String[] msArray13 = {             "100 ग्राम पनीर लम्बा कटा\n" +
            "1 चम्मच कॉर्न फ्लौर\n" +
            "1 चम्मच चावल आटा\n" +
            "1 चम्मच मैदा\n" +
            "2 बून्द घर का बना चुकंदर का रंग\n" +
            "तलने के लिए तेल\n" +
            "4 हरी मिर्च\n" +
            "1 शिमला मिर्च लम्बी कटि\n" +
            "1 प्याज लम्बा कटा\n" +
            "1 गाजर लम्बा कटा\n" +
            "1 टमाटर लम्बा कटा\n" +
            "6 लहसुन कली बारीक कटी\n" +
            "1 कटोरी पत्ता गोभी लम्बी कटि\n" +
            "1 चम्मच सोया सॉस\n" +
            "1 चम्मच टमाटर सॉस\n" +
            "1 चम्मच रेड चिल्ली सॉस\n" +
            "1 चम्मच विनेगर\n" +
            "नमक स्वादानुसार\n" +
            "आधा चम्मच काली मिर्च\n" +
            "1 चम्मच चिल्ली फलैक्स\n" +
            "धनिया पत्ती",
            "1 कप हरि सब्जियां(सोया मेथी,आलू,)\n" +
                    "1/2 कप हरीमिर्च लहसुन की चटनी\n" +
                    "नमक स्वादनुसार\n" +
                    "2 चमच्च लालमिर्च पाउडर\n" +
                    "2 चम्मच मिक्स हर्ब्स\n" +
                    "2-3 चमच्च खटाई\n" +
                    "1/2 चम्मच लहसुन पॉवडर\n" +
                    "100 ग्राम तेल\n" +
                    "2 चमच्च चावल का आटा\n" +
                    "250 ग्राम गेहू आटा रोटी के लिए\n" +
                    "1/2 चमच्च नारियल बूरा",
            "2 कटोरी आटा।\n" +
                    "सत्तू 1 कटोरी।\n" +
                    "अदरक कद्दूकस करा 1बड़ा चम्मच।\n" +
                    "1 बड़ा चम्मचअमचूर।\n" +
                    "गरम मसाला 1 चाय चम्मच।\n" +
                    "नमक टेस्ट अनुसार।\n" +
                    "घी 1 बड़ा चम्मच।\n" +
                    "तेल तलने के लिए 1 गिलास\n" +
                    "देसी घी 1 कप।\n" +
                    "250 ग्राम आलू।\n" +
                    "2 बङे टमाटर\n" +
                    "लाल मिर्च साबुत 2 हरी मिर्च साबुत 2।\n" +
                    "1 नींबू।\n" +
                    "हल्दी नमक मिर्च, धनिया स्वादानुसार\n" +
                    "स्पेशल तड़का हींग जीरा।\n" +
                    "बेकिंग पाउडर 1चाय चम्मच।",
            "200 ग्राम मशरूम\n" +
                    "7-8 सूखी साबुत लाल मिर्च\n" +
                    "7-8 लहसुन की कलियां\n" +
                    "1 प्याज(मीडियम आकार का)\n" +
                    "1 छोटा शिमला मिर्च चौकोर टुकड़ों में कटा हुआ\n" +
                    "1 +1/2बड़ा चम्मच तेल\n" +
                    "नमक स्वादानुसार\n" +
                    "1 कप गरम पानी\n" +
                    "थोड़ी सी हरी धनिया सजाने के लिए ऑप्शनल है"};
    String[] msArray14 = {
            "1 कटोरी इडली बैटर\n" +
                    "4 हरी मिर्च\n" +
                    "1 चम्मच लाल मिर्च पाउडर\n" +
                    "1 बड़ा चम्मच डोसा पोडी पाउडर\n" +
                    "तेल ज़रूरत अनुसार\n" +
                    "3 बड़े चम्मच चनों की दाल के\n" +
                    "1 कप कद्दूकस किया हुआ नारियल\n" +
                    "1 टुकड़ा अदरक का\n" +
                    "स्वादानुसार नमक\n" +
                    "7 लहसुन बारीक कटा हुआ\n" +
                    "1 प्याज बारीक कटा हुआ\n" +
                    "कुछ करी पत्तियां\n" +
                    "1 चम्मच सरसों के बीज\n" +
                    "2 हरी मिर्च बारीक कटी हुई\n" +
                    "आधी में दो हरी मिर्च कटी",
            "2 उबले आलू\n" +
                    "1 कटा हुआ टमाटर\n" +
                    "1 मध्यम साइज का कटा हुआ प्याज़\n" +
                    "5-6 करी पत्ता\n" +
                    "1/2 चम्मच राई\n" +
                    "1/2 चम्मच (स्वादानुसार) नमक\n" +
                    "1/2 चम्मच हल्दी पाउडर\n" +
                    "2 कटी हुई हरी मिर्च\n" +
                    "2-3 कटी हुई लहसुन कली\n" +
                    "1/2 चम्मच उरद दाल\n" +
                    "1/2 छोटी चम्मच घिसी या अदरक का पेस्ट\n" +
                    "2 चम्मच तेल\n" +
                    "डोसा/दोसा बनाने के लिए\n" +
                    "1.5 कप छोटे साइज वाली चावल(सोनामंसरी/उबली/उसना)चावल\n" +
                    "1/2 कप उरद दाल\n" +
                    "2-3 चम्मच चना दाल\n" +
                    "1/2 चम्मच मेथी के दाने\n" +
                    "1/2 कप पोहा\n" +
                    "1/2 छोटी चम्मच नमक\n" +
                    "2 चम्मच तेल या बटर",
            "100 ग्राम हरा मटर\n" +
                    "2 कप सूजी\n" +
                    "2 कप दही\n" +
                    "1 पैकेट ईनो\n" +
                    "नमक स्वादानुसार\n" +
                    "2 चम्मच उरद दाल\n" +
                    "1 चम्मच राई\n" +
                    "15 कड़ी पत्ता\n" +
                    "2 हरी मिर्च\n" +
                    "1 बड़ा टुकड़ा अदरक",
            "1कटोरी अरहर की दाल\n" +
                    "5 भिंडी\n" +
                    "1 गाजर\n" +
                    "1 प्याज\n" +
                    "5 लहसुन कलियाँ\n" +
                    "1 बैंगन\n" +
                    "2 टमाटर\n" +
                    "3 बडे चम्मच तेल\n" +
                    "1 छोटी चम्मच सरसों\n" +
                    "1 चुटकी हींग\n" +
                    "2 बडे चम्मच इमली का रस\n" +
                    "नमक स्वादानुसार\n" +
                    "लाल मिर्च पाउडर स्वादानुसार\n" +
                    "1/2 छोटी चम्मच हल्दी\n" +
                    "1 बडा चम्मच सांभर मसाला"};

    String[] sArray1 = { "पोहा","क्रिस्पी पोटेटो","ब्रेड पिज़्ज़ा","पाव भाजी"};
    String[] sArray2 = {"आलू का पराठा","प्याज का पराठा","मुंग दाल पराठा ","पनीर पराठा"  };
    String[] sArray3 = {"साबूदाना खिचड़ी","फलाहारी लड्डू","साबूदाना वडा" ,"साबूदाने का खीर" };
    String[] sArray4 = {"मगुड़ की तीखी चटनी" };
    String[] sArray5 = {"आंवला अचार" ,"नीबूं का अचार","अचारी भिंडी मसाला","लाल मिर्च अचार " };
    String[] sArray6 = { "स्पेशल सलाद","हल्दी का सलाद" ,"खीरा सलाद ","पत्ता गोभी सलाद"};
    String[] sArray7 = {"मिर्च की सब्जी","सेव टमाटर की सब्जी","टमाटर की तीखी सब्जी","भुजिया टमाटर की सब्जी" };
    String[] sArray8 = { "सांभर","इडली, सांभर, चटनी","सांभर वडी","इडली सांभर चटनी"};
    String[] sArray9= { "शाही टुकड़ा","गाजर बर्फी","ब्रेड की बरफी","प्पल की खीर" };
    String[] sArray10= { "चिकन रेज़ाला","बटर चिकन","मटन गोश्त दरबारी","गोन फिश करी" };
    String[] sArray11= {"तीखा छोला","मटर कुलचा " ,"छोले भटूरे","मक्के की रोटी " };
    String[] sArray12= {"गुजराती थाली ","गुजराती उंधियू","गुजराती खट्टी","गुजराती कढ़ी" };
    String[] sArray13= {"चिल्ली पनीर" ,"तीखे चपाती रिंग्स","लिटीआलू चोखा","चिल्ली गार्लिक मशरूम" };
    String[] sArray14= { "मसालेदार इडली","आलू मसाला डोसा","हरे मटर की इडली","सांभर"};

    String[] mTopic;
    private boolean enableCaching = false;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        this.requestWindowFeature(Window.FEATURE_NO_TITLE);
        this.getWindow().setFlags(WindowManager.LayoutParams.FLAG_FULLSCREEN,
                WindowManager.LayoutParams.FLAG_FULLSCREEN);
        this.getWindow().setSoftInputMode(
                WindowManager.LayoutParams.SOFT_INPUT_STATE_ALWAYS_HIDDEN);
        setContentView(R.layout.bar);


        mTopic = getResources().getStringArray(R.array.smsTopic);

        // txtStatus = (TextView) findViewById(R.id.textview_facestatus);
        listView011 = (ListView) findViewById(R.id.listview01);
        // txtStatus.setText(topic);

        List<HashMap<String, String>> aList = new ArrayList<HashMap<String, String>>();

        for (int i = 0; i < 14; i++) {
            HashMap<String, String> hm = new HashMap<String, String>();
            hm.put("txt", " " + mTopic[i]);
            aList.add(hm);
        }

        int[] to = {  R.id.txt };
        String[] from = { "txt" };
        SimpleAdapter adapter = new SimpleAdapter(getBaseContext(), aList,
                R.layout.listview_layout, from, to);

        listView011.setAdapter(adapter);
        listView011.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> arg0, View arg1, int pos,
                                    long arg3) {
                switch (pos) {
                    case 0:
                        Intent intent = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent.putExtra("key5", 0);
                        intent.putExtra("keyTopic", mTopic[0]);
                        intent.putExtra("keyArray", smsArray01);
                        intent.putExtra("keyArra", msArray01);
                        intent.putExtra("keyArr", sArray1);
                        startActivity(intent);
                        break;
                    case 1:
                        Intent intent1 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent1.putExtra("key5", 1);
                        intent1.putExtra("keyTopic", mTopic[1]);
                        intent1.putExtra("keyArray", smsArray02);
                        intent1.putExtra("keyArra", msArray02);
                        intent1.putExtra("keyArr", sArray2);
                        startActivity(intent1);
                        break;

                    case 2:
                        Intent intent2 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent2.putExtra("key5", 2);
                        intent2.putExtra("keyTopic", mTopic[2]);
                        intent2.putExtra("keyArray", smsArray03);
                        intent2.putExtra("keyArra", msArray03);
                        intent2.putExtra("keyArr", sArray3);
                        startActivity(intent2);
                        break;

                    case 3:
                        Intent intent3 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent3.putExtra("key5", 3);
                        intent3.putExtra("keyTopic", mTopic[3]);
                        intent3.putExtra("keyArray", smsArray04);
                        intent3.putExtra("keyArra", msArray04);
                        intent3.putExtra("keyArr", sArray4);
                        startActivity(intent3);
                        break;

                    case 4:
                        Intent intent4 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent4.putExtra("key5", 4);
                        intent4.putExtra("keyTopic", mTopic[4]);
                        intent4.putExtra("keyArray", smsArray05);
                        intent4.putExtra("keyArra", msArray05);
                        intent4.putExtra("keyArr", sArray5);
                        startActivity(intent4);

                        break;

                    case 5:
                        Intent intent5 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent5.putExtra("key5", 5);
                        intent5.putExtra("keyTopic", mTopic[5]);
                        intent5.putExtra("keyArray", smsArray06);
                        intent5.putExtra("keyArra", msArray06);
                        intent5.putExtra("keyArr", sArray6);
                        startActivity(intent5);

                        break;

                    case 6:
                        Intent intent6 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent6.putExtra("key5", 6);
                        intent6.putExtra("keyTopic", mTopic[6]);
                        intent6.putExtra("keyArray", smsArray07);
                        intent6.putExtra("keyArra", msArray07);
                        intent6.putExtra("keyArr", sArray7);
                        startActivity(intent6);

                        break;
                    case 7:
                        Intent intent7 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent7.putExtra("key5", 7);
                        intent7.putExtra("keyTopic", mTopic[7]);
                        intent7.putExtra("keyArray", smsArray08);
                        intent7.putExtra("keyArra", msArray08);
                        intent7.putExtra("keyArr", sArray8);
                        startActivity(intent7);

                        break;
                    case 8:
                        Intent intent8 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent8.putExtra("key5", 8);
                        intent8.putExtra("keyTopic", mTopic[8]);
                        intent8.putExtra("keyArray", smsArray09);
                        intent8.putExtra("keyArra", msArray09);
                        intent8.putExtra("keyArr", sArray9);
                        startActivity(intent8);

                        break;
                    case 9:
                        Intent intent9 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent9.putExtra("key5", 9);
                        intent9.putExtra("keyTopic", mTopic[9]);
                        intent9.putExtra("keyArray", smsArray10);
                        intent9.putExtra("keyArr", sArray10);
                        startActivity(intent9);

                        break;
                    case 10:
                        Intent intent10 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent10.putExtra("key5", 10);
                        intent10.putExtra("keyTopic", mTopic[10]);
                        intent10.putExtra("keyArray", smsArray11);
                        intent10.putExtra("keyArra", msArray11);
                        intent10.putExtra("keyArr", sArray11);
                        startActivity(intent10);

                        break;
                    case 11:
                        Intent intent11 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent11.putExtra("key5", 11);
                        intent11.putExtra("keyTopic", mTopic[11]);
                        intent11.putExtra("keyArray", smsArray12);
                        intent11.putExtra("keyArra", msArray12);
                        intent11.putExtra("keyArr", sArray12);
                        startActivity(intent11);

                        break;
                    case 12:
                        Intent intent12 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent12.putExtra("key5", 12);
                        intent12.putExtra("keyTopic", mTopic[12]);
                        intent12.putExtra("keyArray", smsArray13);
                        intent12.putExtra("keyArra", msArray13);
                        intent12.putExtra("keyArr", sArray13);
                        startActivity(intent12);

                        break;
                    case 13:
                        Intent intent13 = new Intent(MainActivity.this,
                                MsgActivity.class);
                        intent13.putExtra("key5", 13);
                        intent13.putExtra("keyTopic", mTopic[13]);
                        intent13.putExtra("keyArray", smsArray14);
                        intent13.putExtra("keyArra", msArray14);
                        intent13.putExtra("keyArr", sArray14);
                        startActivity(intent13);



                    default:

                        break;
                }

            }
        });

    }

    @Override
    public void onBackPressed() {
        super.onBackPressed();
        System.exit(0);
    }


}
