package com.example.inspiration;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;

import android.content.ClipboardManager;
import android.content.Intent;
import android.graphics.Typeface;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuItem;
import android.view.View;
import android.view.Window;
import android.view.WindowManager;
import android.widget.ImageView;
import android.widget.TextView;
import android.widget.Toast;

import com.google.android.material.floatingactionbutton.FloatingActionButton;

import de.hdodenhof.circleimageview.CircleImageView;

public class MsgActivity extends AppCompatActivity {

    ImageView button_next;
    ImageView button_prev;
    FloatingActionButton button_send;

    TextView editText;
    TextView txt_msgNumber,textview4;
    TextView txt_topic;
    CircleImageView profile;

    int listLength=0,img;

    String str_Stories[] = new String[8];
    String name[];
    String str_Topic;
    String pro;
    Typeface heading, headingTypeface;
    int[] flags = new int[] { R.drawable.a,
            R.drawable.b,
            R.drawable.c,
            R.drawable.d,
            R.drawable.e,
            R.drawable.f,
            R.drawable.g,
            R.drawable.h,
            R.drawable.i,
            R.drawable.j,
            R.drawable.k,
            R.drawable.l,
            R.drawable.m,
            R.drawable.n,
            R.drawable.o,
            R.drawable.p,
            R.drawable.q,
            R.drawable.r,
            R.drawable.s,
            R.drawable.t

    };


    String story[] = {"जन्म: 15 अक्टूबर 1931, रामेश्वरम, तमिलनाडु\n" +
            "\n" +
            "मृत्यु: 27 जुलाई, 20 15, शिलोंग, मेघालय\n" +
            "\n" +
            "पद/कार्य: भारत के पूर्व राष्ट्रपति\n" +
            "\n" +
            "उपलब्धियां: एक वैज्ञानिक और इंजिनियर के तौर पर उन्होंने रक्षा अनुसन्धान और विकास संगठन (डीआरडीओ) और भारतीय अंतरिक्ष अनुसंधान संगठन (इसरो) के कई महत्वपूर्ण परियोजनाओं पर कार्य किया\n" +
            "\n" +
            "डॉ ए. पी. जे. अब्दुल कलाम एक प्रख्यात भारतीय वैज्ञानिक और भारत के 11वें राष्ट्रपति थे। उन्होंने देश के कुछ सबसे महत्वपूर्ण संगठनों (डीआरडीओ और इसरो) में कार्य किया। उन्होंने वर्ष 1998 के पोखरण द्वितीय परमाणु परिक्षण में भी महत्वपूर्ण भूमिका निभाई। डॉ कलाम भारत के अंतरिक्ष कार्यक्रम और मिसाइल विकास कार्यक्रम के साथ भी जुड़े थे। इसी कारण उन्हें ‘मिसाइल मैन’ भी कहा जाता है। वर्ष 2002 में  कलाम भारत के राष्ट्रपति चुने गए और 5 वर्ष की अवधि की सेवा के बाद, वह शिक्षण, लेखन, और सार्वजनिक सेवा में लौट आए। उन्हें भारत के सर्वोच्च नागरिक सम्मान, भारत रत्न सहित कई प्रतिष्ठित पुरस्कारों से सम्मानित किया गया।\n" +
            "\n" +
            "प्रारंभिक जीवन\n" +
            "\n" +
            "अवुल पकिर जैनुलअबिदीन अब्दुल कलाम का जन्म 15 अक्टूबर 1931 को तमिलनाडु के रामेश्वरम में एक मुसलमान परिवार मैं हुआ। उनके पिता जैनुलअबिदीन एक नाविक थे और उनकी माता अशिअम्मा एक गृहणी थीं। उनके परिवार की आर्थिक स्थिति ठीक नहीं थे इसलिए उन्हें छोटी उम्र से ही काम करना पड़ा। अपने पिता की आर्थिक मदद के लिए बालक कलाम स्कूल के बाद समाचार पत्र वितरण का कार्य करते थे। अपने स्कूल के दिनों में कलाम पढाई-लिखाई में सामान्य थे पर नयी चीज़ सीखने के लिए हमेशा तत्पर और तैयार रहते थे। उनके अन्दर सीखने की भूख थी और वो पढाई पर घंटो ध्यान देते थे। उन्होंने अपनी स्कूल की पढाई रामनाथपुरम स्च्वार्त्ज़ मैट्रिकुलेशन स्कूल से पूरी की और उसके बाद तिरूचिरापल्ली के सेंट जोसेफ्स कॉलेज में दाखिला लिया, जहाँ से उन्होंने सन 1954 में भौतिक विज्ञान में स्नातक किया। उसके बाद वर्ष 1955 में वो मद्रास चले गए जहाँ से उन्होंने एयरोस्पेस इंजीनियरिंग की शिक्षा ग्रहण की। वर्ष 1960 में कलाम ने मद्रास इंस्टिट्यूट ऑफ़ टेक्नोलॉजी से इंजीनियरिंग की पढाई पूरी की।\n" +
            "\n" +
            "कैरियर\n" +
            "\n" +
            "मद्रास इंस्टिट्यूट ऑफ़ टेक्नोलॉजी से इंजीनियरिंग की पढाई पूरी करने के बाद कलाम ने रक्षा अनुसन्धान और विकास संगठन (डीआरडीओ) में वैज्ञानिक के तौर पर भर्ती हुए। कलाम ने अपने कैरियर की शुरुआत भारतीय सेना के लिए एक छोटे हेलीकाप्टर का डिजाईन बना कर किया। डीआरडीओ में कलाम को उनके काम से संतुष्टि नहीं मिल रही थी। कलाम पंडित जवाहर लाल नेहरु द्वारा गठित ‘इंडियन नेशनल कमेटी फॉर स्पेस रिसर्च’ के सदस्य भी थे। इस दौरान उन्हें प्रसिद्ध अंतरिक्ष वैज्ञानिक विक्रम साराभाई के साथ कार्य करने का अवसर मिला। वर्ष 1969 में उनका स्थानांतरण भारतीय अंतरिक्ष अनुसंधान संगठन (इसरो) में हुआ। यहाँ वो भारत के सॅटॅलाइट लांच व्हीकल  परियोजना के निदेशक के तौर पर नियुक्त किये गए थे। इसी परियोजना की सफलता के परिणामस्वरूप भारत का प्रथम उपग्रह ‘रोहिणी’ पृथ्वी की कक्षा में वर्ष 1980 में स्थापित किया गया। इसरो में शामिल होना कलाम के कैरियर का सबसे अहम मोड़ था और जब उन्होंने सॅटॅलाइट लांच व्हीकल परियोजना पर कार्य आरम्भ किया तब उन्हें लगा जैसे वो वही कार्य कर रहे हैं जिसमे उनका मन लगता है।\n" +
            "\n" +
            "1963-64 के दौरान उन्होंने अमेरिका के अन्तरिक्ष संगठन नासा की भी यात्रा की। परमाणु वैज्ञानिक राजा रमन्ना, जिनके देख-रेख में भारत ने पहला परमाणु परिक्षण किया, ने कलाम को वर्ष 1974 में पोखरण में परमाणु परिक्षण देखने के लिए भी बुलाया था।\n" +
            "\n" +
            "सत्तर और अस्सी के दशक में अपने कार्यों और सफलताओं से डॉ कलाम भारत में बहुत प्रसिद्द हो गए और देश के सबसे बड़े वैज्ञानिकों में उनका नाम गिना जाने लगा। उनकी ख्याति इतनी बढ़ गयी थी की तत्कालीन प्रधानमंत्री इंदिरा गाँधी ने अपने कैबिनेट के मंजूरी के बिना ही उन्हें कुछ गुप्त परियोजनाओं पर कार्य करने की अनुमति दी थी।\n" +
            "\n" +
            "भारत सरकार ने महत्वाकांक्षी ‘इंटीग्रेटेड गाइडेड मिसाइल डेवलपमेंट प्रोग्राम’ का प्रारम्भ डॉ कलाम के देख-रेख में किया। वह इस परियोजना के मुख कार्यकारी थे। इस परियोजना ने देश को अग्नि और पृथ्वी जैसी मिसाइलें दी है।\n" +
            "\n" +
            "जुलाई 1992 से लेकर दिसम्बर 1999 तक डॉ कलाम प्रधानमंत्री के वैज्ञानिक सलाहकार और रक्षा अनुसन्धान और विकास संगठन (डीआरडीओ) के सचिव थे। भारत ने अपना दूसरा परमाणु परिक्षण इसी दौरान किया था। उन्होंने इसमें एक महत्वपूर्ण भूमिका निभाई थी। आर. चिदंबरम के साथ डॉ कलाम इस परियोजना के समन्वयक थे। इस दौरान मिले मीडिया कवरेज ने उन्हें देश का सबसे बड़ा परमाणु वैज्ञानिक बना दिया।\n" +
            "\n" +
            "वर्ष 1998 में डॉ कलाम ने ह्रदय चिकित्सक सोमा राजू के साथ मिलकर एक कम कीमत का ‘कोरोनरी स्टेंट’ का विकास किया। इसे ‘कलाम-राजू स्टेंट’ का नाम दिया गया।\n" +
            "\n" +
            "भारत के राष्ट्रपति\n" +
            "\n" +
            "एक रक्षा वैज्ञानिक के तौर पर उनकी उपलब्धियों और प्रसिद्धि के मद्देनज़र एन. डी. ए. की गठबंधन सरकार ने उन्हें वर्ष 2002 में राष्ट्रपति पद का उमीदवार बनाया। उन्होंने अपने प्रतिद्वंदी लक्ष्मी सहगल को भारी अंतर से पराजित किया और 25 जुलाई 2002 को भारत के 11वें राष्ट्रपति के रूप में शपथ लिया। डॉ कलाम देश के ऐसे तीसरे राष्ट्रपति थे जिन्हें राष्ट्रपति बनने से पहले ही भारत रत्न ने नवाजा जा चुका था। इससे पहले डॉ राधाकृष्णन और डॉ जाकिर हुसैन को राष्ट्रपति बनने से पहले ‘भारत रत्न’ से सम्मानित किया जा चुका था।\n" +
            "\n" +
            "उनके कार्यकाल के दौरान उन्हें ‘जनता का राष्ट्रपति’ कहा गया। अपने कार्यकाल की समाप्ति पर उन्होंने दूसरे कार्यकाल की भी इच्छा जताई पर राजनैतिक पार्टियों में एक राय की कमी होने के कारण उन्होंने ये विचार त्याग दिया।\n" +
            "\n" +
            "12वें राष्ट्रपति प्रतिभा पाटिल के कार्यकाल के समाप्ति के समय एक बार फिर उनका नाम अगले संभावित राष्ट्रपति के रूप में चर्चा में था परन्तु आम सहमति नहीं होने के कारण उन्होंने अपनी उमीद्वारी का विचार त्याग दिया।\n" +
            "\n" +
            "राष्ट्रपति पद से सेवामुक्त होने के बाद का समय\n" +
            "\n" +
            "राष्ट्रपति पद से सेवामुक्त होने के बाद डॉ कलाम शिक्षण, लेखन, मार्गदर्शन और शोध जैसे कार्यों में व्यस्त रहे और भारतीय प्रबंधन संस्थान, शिल्लोंग, भारतीय प्रबंधन संस्थान, अहमदाबाद, भारतीय प्रबंधन संस्थान, इंदौर, जैसे संस्थानों से विजिटिंग प्रोफेसर के तौर पर जुड़े रहे। इसके अलावा वह भारतीय विज्ञान संस्थान बैंगलोर के फेलो, इंडियन इंस्टिट्यूट ऑफ़ स्पेस साइंस एंड टेक्नोलॉजी, थिरुवनन्थपुरम, के चांसलर, अन्ना यूनिवर्सिटी, चेन्नई, में एयरोस्पेस इंजीनियरिंग के प्रोफेसर भी रहे।\n" +
            "\n" +
            "उन्होंने आई. आई. आई. टी. हैदराबाद, बनारस हिन्दू यूनिवर्सिटी और अन्ना यूनिवर्सिटी में सूचना प्रौद्योगिकी भी पढाया था।\n" +
            "\n" +
            "कलाम हमेशा से देश के युवाओं और उनके भविष्य को बेहतर बनाने के बारे में बातें करते थे। इसी सम्बन्ध में उन्होंने देश के युवाओं के लिए “व्हाट कैन आई गिव’ पहल की शुरुआत भी की जिसका उद्देश्य भ्रष्टाचार का सफाया है। देश के युवाओं में उनकी लोकप्रियता को देखते हुए उन्हें 2 बार (2003 & 2004) ‘एम.टी.वी. यूथ आइकॉन ऑफ़ द इयर अवार्ड’ के लिए मनोनित भी किया गया था।\n" +
            "\n" +
            "वर्ष 2011 में प्रदर्शित हुई हिंदी फिल्म ‘आई ऍम कलाम’ उनके जीवन से प्रभावित है।\n" +
            "\n" +
            "शिक्षण के अलावा डॉ कलाम ने कई पुस्तकें भी लिखी जिनमे प्रमुख हैं – ‘इंडिया 2020: अ विज़न फॉर द न्यू मिलेनियम’, ‘विंग्स ऑफ़ फायर: ऐन ऑटोबायोग्राफी’, ‘इग्नाइटेड माइंडस: अनलीशिंग द पॉवर विदिन इंडिया’, ‘मिशन इंडिया’, ‘इंडोमिटेबल स्पिरिट’ आदि।",
    "अल्बर्ट आइन्स्टीन का जन्म 14 मार्च 1879 को जर्मनी में हुआ था. अल्बर्ट आइन्स्टीन यहूदी धर्म से आते हैं. इनका परिवार एक यहूदी हैं. इनके पिता एक इंजिनियर और सेल्समैन थे. बचपन से ही अल्बर्ट आइन्स्टीन पढ़ाई में अच्छे थे और हर समय क्लास में अव्वल आते थें. इनकी भाषा जर्मन हैं, इसके बाद इन्होंने इटालियन और अंग्रेज़ी भाषा का भी ज्ञान प्राप्त किया था.\n" +
            "\n" +
            "1880 इनका परिवार म्यूनिख शहर चला गया था जहाँ पर इनके पिता और चाचा ने एक कंपनी खोली थीं. यह कंपनी बिजली के उपकरण बनाती हैं. एक समय म्यूनिख शहर के मेले में इन्होंने बिजली का इंतजाम भी किया था. इनकी माँ ने इन्हें सारंगी बजाना सिखाया था लेकिन इन्हें पसंद नहीं आया. इनकी संगीत के प्रति रूचि नहीं थीं. इनकी शुरूआती शिक्षा कैथोलिक प्राथमिक स्कूल में हुई थीं.\n" +
            "\n" +
            "आइन्स्टीन ने शुरू में मॉडल और बिजली के यांत्रिक उपकरणों का निर्माण शुरू किया था. साल 1889 में अल्बर्ट आइन्स्टीन को मैक्स तल्मूड ने 10 वर्षीय आइन्स्टीन को विज्ञान में महत्वपूर्ण ग्रंथो से परिचय कराया था. तल्मूड अलबर्ट के दोस्त थें और यहूदी धर्म के छात्र थें. तल्मूड ने पुरे दिल से कई धर्मनिरपेक्ष शैक्षिक हितों के माध्यम से आइन्स्टीन को प्रेरित किया था.\n" +
            "\n" +
            "अल्बर्ट आइन्स्टीन का व्यक्तिगत जीवन :\n" +
            "\n" +
            "आइन्स्टीन एक भावुक, प्रतिब्रध और जातिवाद विरोधी थें. अल्बर्ट आइन्स्टीन प्रिंसटन नेशनल एसोसिएशन ऑफ द एडवांसमेंट ऑफ कलर्ड पीपल संस्था के मेंबर भी रहे थें. जहाँ से अल्बर्ट ने अफ्रीकी अमेरिकीयों के नागरिक अधिकारों के लिये ” सबसे खराब बीमार ” मानते थे. वें नागरिक अधिकार कार्यकर्ता W.E.B.DO BOIS के साथ जुड़ गये थें.\n" +
            "\n" +
            "1946 के समय अल्बर्ट ने पेन्सिल्वेनिया में लिंकन विश्वविद्यालय का भी दौरा किया था. यह विश्वविद्यालय एक अश्वेत महाविद्यालय हैं. वहां उन्हें एक मानद उपाधि से भी सम्मानित किया गया था. आइन्स्टीन ने एक बार अपने भाषण में कहा था उनका कहना था कि ” मेरा इसके बारें में चुप रहने का कोई इरादा नहीं हैं ” प्रिंसटन के एक निवासी याद करते हैं कि आइन्स्टीन ने कभी काले छात्रों के लिये कॉलेज की शिक्षा में शुल्क का भुगतान भी किया था.\n" +
            "\n" +
            "आइन्स्टीन का वैज्ञानिक समय और कार्य :\n" +
            "\n" +
            "अल्बर्ट आइन्स्टीन ने अपने पुरे जीवनकाल में सैकड़ो किताबें और पत्रों को प्रकाशित किया था. आइन्स्टीन ने 300 से भी अधिक वैज्ञानिक और गैर वैज्ञानिक शोध पत्रों को प्रकाशित किया. वे खुद के काम के अलावा दुसरे वैज्ञानिकों के साथ भी सहयोग करते थें. जिनमे बोस आइन्स्टीन के आकड़े आइन्स्टीन रेफ्रीजरेटर और अन्य कई शामिल हैं.\n" +
            "\n" +
            "1905 मिराबिलिस पेपर्स :\n" +
            "\n" +
            "यह पेपर 4 लेखों से संबंधित हैं जिसे आइन्स्टीन ने 1905 को ओंनलडर फिजिक्स नाम की एक वैज्ञानिक पत्रिका में प्रकाशित किया हैं जिनमे प्रकाश बिजली प्रभाव इसमें क्वंतक विचारों को जन्म दिया. ब्रौनिओन गति विशेष सापेक्षवाद और e = mc2 शामिल हैं. इन 4 लेखों ने आधुनिक भौतिकी की नीवं के लिये काफी योगदान दिया हैं और अन्तरिक्ष समय तथा द्रव पर लोगो की सोच को बदला हैं इनके 4 लेख इस प्रकार हैं –\n" +
            "1. एक अनुमानी नजरिया उत्पादन और प्रकाश के परिवर्तन के सम्बन्ध पर\n" +
            "2. एक स्थिर तरल में निलबिंत छोटे कणों की गति पर गर्मी की आणविक कैनेटिक थ्योरी के लिये आवश्यक\n" +
            "3. आगे बढ़ते कणों के बिजली के गतिमान (इलेक्ट्रो-डाइनैमिक) पर\n" +
            "4. क्या एक शरीर की जड़ता अपनी उर्जा साम्रगी पर निर्भर करती हैं\n" +
            "\n" +
            "उष्मागति और अस्थिरता :\n" +
            "\n" +
            "साल 1900 में ओनालेनडर फिजिक को प्रस्तुत आइन्स्टीन के पहला शोध-पत्र पर था. यह 1901 में केशिक्तव घटना की व्याख्या से निष्कर्ष शीर्षक के साथ प्रकाशित किया गया हैं, जिसमे पता चलता हैं कि अणुओं की उपस्तिथि हेतु ब्राउन-नियन गति को ठोस सबूत की तरह उपयोग किया जाता हैं 1903 और 1904 में उनका शोध मुख्य रूप से प्रसार घटना पर परिमित परमाणु आकार का असर पर सम्बन्धित हैं.\n" +
            "\n" +
            "फोटोन और उर्जा क्वान्टा :\n" +
            "\n" +
            "1905 के समय में एक पत्र में आइन्स्टीन ने बताया हैं कि प्रकाश स्वत की स्थानीय कणों (क्वान्टा) के बने होते हैं. आइन्स्टीन के प्रकाश क्वान्टा परिकल्पना को मैक्स प्लैंक और नील्स बोर सहित सभी भौतिकिविदों ने माना नहीं था. राबर्ट मिल्लिकन की प्रकाश बिजली प्रभाव पर लंबा प्रयोग और कॉप्टन बिखरने की माप के साथ यह परिकल्पना सार्व-भौमिक रूप से 1919 में स्वीकार कर लिया गया था.\n" +
            "\n" +
            "आइन्स्टीन ने निष्कर्ष निकाला हैं कि आवर्ती f की हर लहर, उर्जा hf प्लैंक स्थिरांक हैं. उन्होंने इस बारे में और अधिक नहीं बताया हैं क्योंकि वे कन्फर्म नहीं थें, कुछ प्रयोग शोध करके समझाया जा सकता हैं जिसे ही बाद में विशेष रूप से प्रकाश विद्दुत कहा जाता हैं.\n" +
            "\n" +
            "चाल कोण :\n" +
            "\n" +
            "1910 के दशक के समय अलग-अलग तरीकों से क्वन्तक यांत्रिकी के दायरे में लाने के लिये इसका विस्तार हुआ. अर्नेट रदरफोर्ड के नाभिक की खोज और यह प्रस्ताव के बाद की इलेक्ट्रोन ग्रहों की तरह कक्षा में घूमते हैं. नील्स बोह यह दिखाने में सक्षम हुए कि प्लैंक द्वारा शुरू और आइन्स्टीन द्वारा विकसित क्वान्तक यांत्रिक के द्वारा तत्वों के परमाणुओं में इलेक्ट्रानों की असतत गति और तत्वों की आवर्त सारणी को समझाया जा सकता हैं.\n" +
            "\n" +
            "गैर वैज्ञानिक विरासत :\n" +
            "\n" +
            "एक बार आइन्स्टीन अपनी पत्नी एल्सा और गोद ली हुई पुत्री कदमूनी मार्गेट को एक पत्र लिखा था. मार्गेट आइन्स्टीन ने इन निजी पत्रों को जनता के लिये उपलब्ध कराने के लिये अनुमति दे दी थीं लेकिन साथ ही अनुरोध भी किया की इनकी मृत्यु के 20 साल बाद तक ऐसा नहीं किया जाये. उनकी मृत्यु 1986 में हो गयी थीं.\n" +
            "\n" +
            "आइन्स्टीन ने ठठेरे प्लंबर के पेशे में अपनी रूचि व्यक्त की थीं और बाद में उन्हें प्लंबर और स्टीम-फिटर्स यूनियन का एक मानद मेंबर बनाया गया था. हिबू विश्वविद्यालय के अल्बर्ट आइन्स्टीन बारबरा वोल्फ ने बीबीसी को बताया की 1912 और 1955 के बीच लिखे निजी पत्राचार के लिये लगभग 3500 पत्र हैं.\n" +
            "\n" +
            "रोचक तथ्य :\n" +
            "\n" +
            "उसरे विश्व के युद्ध से पहले की अवधि में न्यू योर्कर ने अपने एक ” टोक ऑफ टाउन ” कालम में एक खबर प्रकाशित किया था इतनी अच्छी तरह से जाना जाता हैं कि लोग उन्हें सड़क पर रोक कर उनके द्वारा दिए गये विचारों की व्याख्या पूछने लगते थें वें उनसे कहते हैं कि ” मुझे माफ़ कीजिये ” मुझे लोग अक्सर प्रोफेसर आइन्स्टीन समझते हैं आइन्स्टीन ने अपने जीवन में उपन्यास, फिल्मों नाटकों और संगीत का विषय या प्रेरणा रहे हैं.\n" +
            "\n" +
            "अल्बर्ट आइन्स्टीन अपने दिमाग में ही शोध का विजुअल प्रयोग कर खाका तैयार कर लेते थें उन उनका लेबोरेटरी प्रयोग से भी ज्यादा सटीक होता था.\n" +
            "\n" +
            "पुरस्कार और सम्मान :\n" +
            "\n" +
            "आइन्स्टीन ने कई पुरस्कार और सम्मान प्राप्त किये हैं. 1922 में उन्हें भौतिकी के क्षेत्र के लिये अपनी सेवाओं और विशेषकर फोटो-इलेट्रिक प्रभाव के कानून की खोज के लिये अन्तराष्ट्रीय नोबेल पुरस्कार से सम्मानित किया गया. सन 1921 में कोई भी नामांकन अल्फ्रेड नोबेल द्वारा निर्धारित मापदंडो में खरा नहीं उतरा तो 1921 का यह पुरस्कार आगे बढ़ा. 1922 में आइन्स्टीन को इसमें सम्मानित किया गया था.\n" +
            "\n" +
            "अल्बर्ट आइन्स्टीन के सुविचार :\n" +
            "\n" +
            "* जिस व्यक्ति ने कभी गलती नहीं कि उसने कभी कुछ नया करने की कोशिश नहीं की.\n" +
            "* ईश्वर के सामने हम सभी एक बराबर ही बुद्धिमान हैं और एक बराबर ही मुर्ख भी है.\n" +
            "* जिंदगी जीने के दो तरीके हैं. पहला यह हैं कि कुछ चमत्कार नहीं हैं दूसरा यह हैं कि दुनिया की हर चीज चमत्कार हैं.\n" +
            "* जिस व्यक्ति ने कभी गलती नहीं कि उसने कभी कुछ नया करने की कोशिश नहीं की.\n" +
            "* एक सफल व्यक्ति बनने का प्रयास मत करो बल्कि मूल्यों पर चलने वाले इंसान बनों",

            "Swami Vivekananda Date of Birth – महापुरुष स्वामी विवेकानन्द का जन्म 12 जनवरी 1863 को हुआ था। विलक्षण प्रतिभा के धनी व्यक्ति ने  कोलकाता में जन्म लेकर वहां की जन्मस्थली को पवित्र कर दिया। उनका असली नाम नरेन्द्रनाथ दत्ता था लेकिन बचपन में प्यार से सब उन्हें नरेन्द्र नाम से पुकारते थे।\n" +
                    "\n" +
                    "स्वामी विवेकानंद के पिता का नाम विश्वनाथ दत्त था जो कि उस समय कोलकाता हाईकोर्ट के प्रतिष्ठित और सफल वकील थी जिनकी वकालत के काफी चर्चा हुआ करती थी इसके साथ ही उनकी अंग्रेजी और फारसी भाषा में भी अच्छी पकड़ थी।\n" +
                    "\n" +
                    "वहीं विवेकानंद जी की माता का नाम भुवनेश्वरी देवी था जो कि धार्मिक विचारों की महिला थी वे भी विलक्षण काफी प्रतिभावान महिला थी जिन्होनें धार्मिक ग्रंथों जैसे रामायण और महाभारत में काफी अच्छा ज्ञान प्राप्त किया था। इसके साथ ही वे प्रतिभाशाली और बुद्धिमानी महिला थी जिन्हें अंग्रेजी भाषा की भी काफी अच्छी समझ थी।\n" +
                    "\n" +
                    "वहीं अपनी मां की छत्रसाया का स्वामी विवेकानंद पर इतना गहरा प्रभाव पड़ा वे घर में ही ध्यान में तल्लीन हो जाया करते थे इसके साथ ही उनहोनें अपनी मां से भी शिक्षा प्राप्त की थी। इसके साथ ही स्वामी विवेकानंद पर अपने माता-पिता के गुणों का गहरा प्रभाव पड़ा और उन्हें अपने जीवन में अपने घर से ही आगे बढ़ने की प्रेरणा मिली।\n" +
                    "\n" +
                    "स्वामी विवेकानंद के माता और पिता के अच्छे संस्कारो और अच्छी परवरिश के कारण स्वामीजी के जीवन को एक अच्छा आकार और एक उच्चकोटि की सोच मिली।\n" +
                    "\n" +
                    "कहा जाता है कि नरेन्द्र नाथ बचपन से ही नटखट और काफी तेज बुद्धि के व्यक्ति थे वे अपनी प्रतिभा के इतने प्रखर थे कि एक बार जो भी उनके नजर के सामने से गुजर जाता था वे कभी भूलते नहीं थे और दोबारा उन्हें कभी उस चीज को फिर से पढ़ने की जरूरत भी नहीं पढ़ती थी।\n" +
                    "\n" +
                    "उनकी माता हमेशा कहती थी की, “मैंने शिवजी से एक पुत्र की प्रार्थना की थी, और उन्होंने तो मुझे एक शैतान ही दे दिया”।\n" +
                    "\n" +
                    "युवा दिनों से ही उनमे आध्यात्मिकता के क्षेत्र में रूचि थी, वे हमेशा भगवान की तस्वीरों जैसे शिव, राम और सीता के सामने ध्यान लगाकर साधना करते थे। साधुओ और सन्यासियों की बाते उन्हें हमेशा प्रेरित करती रही।\n" +
                    "\n" +
                    "वहीं आगे जाकर यही नरेन्द्र नाथ दुनियाभर में ध्यान, अध्यात्म, राष्ट्रवाद हिन्दू धर्म, और संस्कृति का वाहक बने और स्वामी विवेकानंद के नाम  से प्रसिद्ध हो गए।\n" +
                    "\n" +
                    "स्वामी विवेकानंद जी की शिक्षा – Swami Vivekananda Education\n" +
                    "जब नरेन्द्र नाथ 1871 में उनका ईश्वर चंद विद्यासागर के मेट्रोपोलिटन संसथान में एडमिशन कराया गया।\n" +
                    "1877 में जब बालक नरेन्द्र तीसरी कक्षा में थे जब उनकी पढ़ाई बाधित हो गई थी दरअसल उनके परिवार को किसी कारणवश अचानक रायपुर जाना पड़ा था।\n" +
                    "1879 में, उनके परिवार के कलकत्ता वापिस आ जाने के बाद प्रेसीडेंसी कॉलेज की एंट्रेंस परीक्षा में फर्स्ट डिवीज़न लाने वाले वे पहले विद्यार्थी बने।\n" +
                    "वे विभिन्न विषयो जैसे दर्शन शास्त्र, धर्म, इतिहास, सामाजिक विज्ञानं, कला और साहित्य के उत्सुक पाठक थे। हिंदु धर्मग्रंथो में भी उनकी बहोत रूचि थी जैसे वेद, उपनिषद, भगवत गीता, रामायण, महाभारत और पुराण। नरेंद्र भारतीय पारंपरिक संगीत में निपुण थे, और हमेशा शारीरिक योग, खेल और सभी गतिविधियों में सहभागी होते थे।\n" +
                    "1881 में उन्होनें ललित कला की परीक्षा उत्तीर्ण की थी वहीं 1884 में उन्होनें कला विषय से ग्रेजुएशन की डिग्री पूरी कर ली थी।\n" +
                    "इसके बाद उन्होनें 1884 में अपनी बीए की परीक्षा अच्छी योग्यता से उत्तीर्ण थी और फिर उन्होनें वकालत की पढ़ाई भी की।\n" +
                    "1884 का समय जो कि स्वामी विवेकानंद के लिए बेहद दुखद था क्योंकि इस समय उन्होनें अपने पिता को खो दिया था। पिता की मृत्यु के बाद उनके ऊपर अपने 9 भाईयो-बहनों की जिम्मेदारी आ गई लेकिन वे घबराए नहीं और हमेशा अपने दृढ़संकल्प में अडिग रहने वाले विवेकानंद जी ने इस जिम्मेदारी को बखूबी निभाया।\n" +
                    "1889 में नरेन्द्र का परिवार वापस कोलकाता लौटा। बचपन से ही विवेकानंद प्रखर बुद्धि के थे जिसकी वजह से उन्हें एक बार फिर स्कूल में एडमिशन मिला। दूरदर्शी समझ और तेजस्वी होने की वजह से उन्होनें 3 साल का कोर्स एक साल में ही पूरा कर लिया।\n" +
                    "स्वामी विवेकानंद की दर्शन, धर्म, इतिहास और समाजिक विज्ञान जैसे विषयों में काफी रूचि थी। वेद उपनिषद, रामायण, गीता और हिन्दू शास्त्र वे काफी उत्साह के साथ पढ़ते थे यही वजह है कि वे ग्रन्थों और शास्त्रों के पूर्ण ज्ञाता थे।\n" +
                    "नरेंद्र ने David Hume, Immanuel Kant, Johann Gottlieb Fichte, Baruch Spinoza, Georg W.F. Hegel, Arthur Schopenhauer, Auguste Comte, John Stuart Mill और Charles Darwin के कामो का भी अभ्यास कर रखा था।\n" +
                    "स्वामी विवेकानंद पढ़ाई में तो अव्वल रहते थे ही इसके अलावा वे शारीरिक व्यायाम, खेलों में भी हिस्सा लेते थे।\n" +
                    "स्वामी विवेकानंद जी ने यूरोपीय इतिहास का अध्ययन जेनेरल असेम्ब्ली इंस्टीटूशन में किया था।\n" +
                    "स्वामी विवेकानंद को बंगाली भाषा की भी अच्छी समझ थी उन्होनें स्पेंसर की किताब एजुकेशन का बंगाली में अनुवाद किया आपको बता दें कि वे  हर्बट स्पेंसर की किताब से काफी प्रभावित थे। जब वे पश्चिमी दर्शन शास्त्रियों का अभ्यास कर रहे थे तब उन्होंने संस्कृत ग्रंथो और बंगाली साहित्यों को भी पढ़ा।\n" +
                    "स्वामी विवेकानंद के प्रतिभा के चर्चे उनके बचपन से ही थे। उन्हें बचपन से ही अपने गुरुओं की प्रशंसा मिली है इसलिए उन्हें श्रुतिधर भी कहा गया है।\n" +
                    "बालक नरेद्र अपने विद्यार्थी जीवन में जॉन स्टुअर्ट, हर्बर्ट स्पेंसर और ह्यूम के विचारों से  काफी प्रभावित थे उन्होनें इनके विचारों का गहनता से अध्ययन किया और अपने विचारों से लोगों में नई सोच का प्रवाह किया। इसी दौरान विवेकानंद जी का झुकाव ब्रह्म समाज के प्रति हुआ, सत्य जानने की जिज्ञासा से वे ब्रह्म समाज के नेता महर्षि देवेन्द्र नाथ ठाकुर के संपर्क में भी आए।\n" +
                    "\n",
            "अब्राहम लिंकन (१२ फरवरी, १८०९ - १५ अप्रैल १८६५) अमेरिका के सोलहवें राष्ट्रपति थे। इनका कार्यकाल १८६१ से १८६५ तक था। ये रिपब्लिकन पार्टी से थे। उन्होने अमेरिका को उसके सबसे बड़े संकट - गृहयुद्ध (अमेरिकी गृहयुद्ध) से पार लगाया। अमेरिका में दास प्रथा के अंत का श्रेय लिंकन को ही जाता है। अब्राहम लिंकन का जन्म एक गरीब अश्वेत परिवार में हुआ था। वे प्रथम रिपब्लिकन थे जो अमेरिका के राष्ट्रपति बने। उसके पहले वे एक वकील, इलिअन्स स्टेट के विधायक (लेजिस्लेटर), अमेरिका के हाउस ऑफ् रिप्रेस्न्टेटिव्स के सदस्य थे। वे दो बार सीनेट के चुनाव में असफल भी हुए।\n" +
                    "\n" +
                    "\n" +
                    "        31 वे साल में वो Business में fail हो गया. 32 वें साल में वो state legislator का चुनाव हार गया, 33 वें साल में उसने एक नया business try किया, और फिर fail हो गया. 35 वें साल में उसकी मंगेतर का निधन हो गया. 36 वें साल में उसका nervous break-down हो गया. 43 वें साल में उसने कांग्रेस के लिए चुनाव लड़ा पर हार गया, 48 वें साल में उसने फिर कोशिस की पर हार गया. 55 वें साल में उसने Senate के लिए चुनाव लड़ा पर गया, अगले साल उसने Vice President के लिए चुनाव  लड़ा पर हार गया. 59 वें साल में उसने फिर से Senate के चुनाव लड़ा पर हार गया. 1860 में वो आदमी जो A. Lincoln sign करता था अमेरिका का 16 वाँ राष्ट्रपति बना.\n" +
                    "\n" +
                    "\n" +
                    "प्रारंभीक जीवन :\n" +
                    "\n" +
                    "\n" +
                    "        अब्राहम लिंकन का जन्म 12 फरवरी 1809 को केंटुकी के हार्डिन काउंटी में एक लकड़ी के बने घर में हुआ था | उनके पिता का नाम थोमस लिंकन और माता का नाम नैंसी लिंकन था | उनके वंशज इंग्लैंड से आये थे जो बाद में न्यू जर्सी , पेनिसिलवानिया और विर्जिनिया में आकर बस गये थे |Abraham Lincoln लिंकन के दादाजी का नाम बहे कैप्टेन अब्राहम लिंकन था जो 1780 में विर्जिनिया से केंटुकी आकर बस गये थे | कैप्टेन लिंकन की 1786 में एक भारतीय शिकारी गिरोह ने हत्या कर दी थी | अब कैप्टेन लिंकन के पुत्र थोमस ने भी अपने पिता हुए हमले को आँखों से देखा था | अब अनाथ थोमस ने अपना रास्ता खुद बनाया और अलग अलग जगह काम करकर अपना जीवनयापन करना शुरू किया |\n" +
                    "\n" +
                    "\n" +
                    "        अब्राहम लिंकन को बचपन से ही कड़ा परिश्रम करना पसंद नही था जिसके कारण  उसके परिवार के लोग और पडौसी उसे आलसी कहा करते थे | वो अपना अधिकतर समय किताबे ओढने और कविताये लिखने में बिताता था | उसकी प्रारंभिक शिक्षा किसी स्कूल के बजाय घुमन्तु शिक्षको से हुयी थी जिन्होंने लिंकन को कम समय में ही काफी पढ़ा दिया था | अब थोडा बड़ा होने पर लिंकन को रूढ़िवादी प्रथाओ के खिलाफ लड़ने का विचार आया था | अब धीरे धीरे परिवार की मदद के लिए उसने काम करना शुरू कर दिया था और अब्राहम कुल्हाडी चलाने में माहिर था | लिंकन को शुरू से गुलामो पर हो रहे अत्याचारों से सख्त नफरत थी और वो दास प्रथा को खत्म करना चाहता था |\n" +
                    "\n" +
                    "\n" +
                    "        लिंकन अपने उन मुवक्किलों से अधिक फीस नहीं लेते थे जो ‘उनकी ही तरह गरीब’ थे। एक बार उनके एक मुवक्किल ने उन्हें पच्चीस डॉलर भेजे तो लिंकन ने उसमें से दस डॉलर यह कहकर लौटा दिए कि पंद्रह डॉलर पर्याप्त थे। आमतौर पर वे अपने मुवक्किलों को अदालत के बाहर ही राजीनामा करके मामला निपटा लेने की सलाह देते थे ताकि दोनों पक्षों का धन मुकदमेबाजी में बर्बाद न हो जाये. \n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "        इसके बदलें में उन्हें न के बराबर ही फीस मिलती था। एक शहीद सैनिक की विधवा को उसकी पेंशन के 400 डॉलर दिलाने के लिए एक पेंशन एजेंट 200 डॉलर फीस में मांग रहा था। लिंकन ने उस महिला के लिए न केवल मुफ्त में वकालत की बल्कि उसके होटल में रहने का खर्चा और घर वापसी की टिकट का इंतजाम भी किया।\n" +
                    "\n" +
                    "\n" +
                    "        देश में गुलामी की प्रथा की समस्याओं चल रही थी ,गोरे लोग दक्षिणी राज्यों के बड़े खेतों के स्वामी थे , और वह अफ्रीका से काले लोगो को अपने खेत में काम करने के लिए बुलाते थे और उन्हें दास के रूप में रखा जाता था ..उत्तरी राज्यों के लोग गुलामी की इस प्रथा के खिलाफ थे और इसे समाप्त करना चाहते हैं अमेरिका का संविधान आदमी की समानता पर आधारित है. इसलिए वहाँ है कि देश में गुलामी के लिए कोई जगह नहीं थी, इस मुश्किल समय में, अब्राहम लिंकन 1860 में संयुक्त राज्य अमेरिका के राष्ट्रपति चुने गए थे. \n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "        वह गुलामी की समस्या को हल करना चाहता था. दक्षिणी राज्यों के लोग गुलामी के उन्मूलन के खिलाफ थे. इससे देश की एकता में खतरे आ सकता है . दक्षिणी राज्य एक नए देश बनाने की तैयार कर रहा था परन्तु . अब्राहम लिंकन चाहता था की सभी राज्यों एकजुट हो कर रहे।\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "        अब्राहम लिंकन को कई समस्याओं का सामना करना पड़ा. वह किसी भी कीमत पर देश की एकता की रक्षा करना चाहता था. अंत में उत्तरी और दक्षिणी राज्यों के बीच एक नागरिक युद्ध छिड़ गया. उन्होंने युद्ध बहादुरी से लड़ा और घोषणा की, ‘एक राष्ट्र आधा दास और आधा बिना दास नहीं रह सकता(”A Nation cannot exist half free and half slave.’ ‘).’ वह युद्ध जीत गए और देश एकजुट रहा।\n" +
                    "\n" +
                    "\n" +
                    "        लिंकन  शुरू से ही दास प्रथा के विरोधी थे इसके लिए उन्हें पुरे जीवन संघर्ष भी करना पढ़ा| इसी समय उन्हें रतलेज नामक युवती से प्रेम हो गया पर शादी से पहले ही उसकी मृत्यु हो गई लिंकों को इस बात का बहुत सदमा लगा | लिंकन अपने बचे हुए समय में कानून की जानकारी प्राप्त करते और कुछ समय बाद उन्होंने एक वयक्ति के साझे में वकालत शुरू कर दी पर वह ज़्यदा दिन न चल सकी | \n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "        1842 में उनका विवाह एक बड़े घर की लड़की मेरी टॉड से हुआ दोनों के विचार आपस में मिलते नहीं थे |इसी बीच  उन्हें राष्ट्यपति पद के लिए आवेदन किया | मगर  उनके  दास  प्रथा के विरोधी होने के कारण कई प्रांतो से विरोध सहना  पढ़ा | 4 मार्च 1861 में लिंकन ने राष्टपति पद की सपथ ली | लिंकन के दासप्रथा के विरोधी होने के कारण विरोध की आग बढ़ने लगी | और अमेरिका में युद्ध छिड़ गया . जिसे बहुत ही मेहनत करके लिंकन ने ४ साल में जीता |\n" +
                    "\n" +
                    "\n" +
                    "        1840 के आसपास गुलामगिरी का समर्थन करनेवाले और गुलामगिरी का धिक्कार करनेवाले राज्य. ऐसा साफ विभाजन अमेरिका मे होने लगा था. कान्यासनेस्ब्रास्का कानून के अनुसार इन राज्यो के लोगोंको गुलाम रखनेकी छुट मिलने वाली थी. इसके वजह से अब्राहम लिंकन इनकी निंद उड गयी. इस कानुन के खिलाफ उन्होंने बहोत से भाषण किये. इसी दरम्यान लिंकन इनको खुद के सामर्थ्य का अंदाज आया और उसके बाद लिंकन इन्होंने राजनीती मे कभी भी पीछे मुडकर नहीं देखा।\n" +
                    "\n" +
                    "\n" +
                    "        1860 को हुयी राष्ट्राध्यक्ष का चुनाव इस संदर्भ मे महत्त्वपूर्ण रहा. फरवरी, 1861 को मतलब अब्राहम लिंकन इन्होंने राष्ट्राध्यक्ष पद के सुत्र स्वीकार करने के ग्यारह राज्योंने संघराज्य से बाहर निकलने की घोषणा की. 8 फरवरी 1861 की अलाबामा राज्य के मॉटेगोमोरी इस जगह ‘द कॉनफिडरेट स्टेट्स ऑफ अमेरिका’ ये स्वतंत्र संघराज्य अस्तित्व मे आनेका घोषीत किया. लिंकन इनके जैसे नव निर्वाचित राष्ट्राध्यक्ष के आगे इन घटनाओं से अगल ही चुनौती निर्माण हुयी। \n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "        लिंकन इन्होंने 1 जनवरी 1863 को एक हुकुम व्दारा गुलामगिरी नष्ट की और दो साल बाद मतलब 31 जनवरी 1865 को तेरावी घटना ठिक करके इस आदेश को घटना मे स्थान दिया.यादवी जंग का अब्राहम लिंकन के तरफ झुक रहा था और उनका समय 1864 मे खतम होने वाला था. उन्होंने फिरसे चुनाव लढवाने की का निर्णय लिया और वो 8 नवंबर 1865 को आसानी से चुनकर आये. तब तक यादवी जंग आखरी मोड पर आ चुकी थी।\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "मृत्यु :\n" +
                    "\n" +
                    "\n" +
                    "        4 मार्च 1864 को लिंकन को दुबारा अमेरिका का राष्टपति चुना गया | इसके एक महीने बाद १४ अप्रैल को   गृह युद्ध पर विजय के उपलक्ष में एक आयोजन रखा गया। 15 अप्रैल 1865 को उनकी मौत हुयी। वहां पर ष्टयन्त्रकार्यों ने धोखे से लिंकन पर गोली चला दी और लिंकन की मृत्यु हो गयी | इसके बाद लिंकन की महानता का सने अनुभव किया एक बिना पढ़ा लिखा वयक्ति किस प्रकार अपनी प्रतिभा के बल पर अमेरिका के राष्टपति में सबसे सफल राष्टपति  बना |\n" +
                    "\n" +
                    "\n" +
                    "विचार :\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "• तुम जो भी हो, नेक बनो.\n" +
                    "\n" +
                    "• मैं एक धीमी गति से चलता ज़रूर हूँ, लेकिन कभी वापस नहीं चलता\n" +
                    "\n" +
                    "• अगर एक बार आप अपने नागरिकों (जनता) का भरोसा तोड़ दें, तो आप फिर कभी उनका सम्मान और आदर नहीं पा सकेंगे.\n" +
                    "\n" +
                    "• निश्चित कर लो कि तुम्हारे पैर सही जगह पर पड़े हैं तब सीधे खड़े हो.\n" +
                    "\n" +
                    "• यदि शांति चाहते हो तो लोकप्रिय होने से बचो.\n" +
                    "\n" +
                    "• साधारण दिखने वाले लोग ही दुनिया के सबसे अच्छे लोग होते हैं : यही वजह है कि ईश्वर ऐसे ही बहुत से लोगों का सृजन करते हैं.\n" +
                    "\n" +
                    "• हमेशा ध्यान में रखिये कि आपके द्वारा सफल होने का लिया गया संकल्प किसी भी अन्य संकल्प से ज्यादा महत्त्वपूर्ण है.\n" +
                    "\n" +
                    "• एक पेड़ काटने के लिए आप मुझे 6 घंटे दें और मैं पहले 4 घंटे अपनी कुल्हाड़ी की धार तेज करने में लगाऊंगा।",

            "ध्यानचंद का जन्म उत्तरप्रदेश के इलाहबाद में 29 अगस्त 1905 को हुआ था. वे कुशवाहा, मौर्य परिवार के थे. उनके पिता का नाम समेश्वर सिंह था, जो ब्रिटिश इंडियन आर्मी में एक सूबेदार के रूप कार्यरत थे, साथ ही होकी गेम खेला करते थे. ध्यानचंद के दो भाई थे, मूल सिंह एवं रूप सिंह. रूप सिंह भी ध्यानचंद की तरह होकी खेला करते थे, जो अच्छे खिलाड़ी थे.\n" +
                    "\n" +
                    "ध्यानचंद के पिता समेश्वर आर्मी में थे, जिस वजह से उनका तबादला आये दिन कही न कही होता रहता था. इस वजह से ध्यानचंद ने कक्षा छठवीं के बाद अपनी पढाई छोड़ दी. बाद में ध्यानचंद के पिता उत्तरप्रदेश के झाँसी में जा बसे थे.\n" +
                    "\n" +
                    "होकी की शुरुवात (Dhyan Chand Hockey Career) –\n" +
                    "\n" +
                    "युवास्था में ध्यानचंद को होकी से बिलकुल लगाव नहीं था, उन्हें रेसलिंग बहुत पसंद थी. उन्होंने होकी खेलना अपने आस पास के दोस्तों के साथ खेलना शुरू किया था, जो पेड़ की डाली से होकी स्टिक बनाते थे, और पुराने कपड़ों से बॉल बनाया करते थे. 14 साल की उम्र में वे एक होकी मैच देखने अपने पिता के साथ गए, वहां एक टीम 2 गोल से हार रही थी. ध्यानचंद ने अपने पिता को कहाँ कि वो इस हारने वाली टीम के लिए खेलना चाहते थे. वो आर्मी वालों का मैच था, तो उनके पिता ने ध्यानचंद को खेलने की इजाज़त दे दी. ध्यानचंद ने उस मैच में 4 गोल किये. उनके इस रवैये और आत्मविश्वास को देख आर्मी ऑफिसर बहुत खुश हुए, और उन्हें आर्मी ज्वाइन करने को कहा.\n" +
                    "\n" +
                    "1922 में 16 साल की उम्र में ध्यानचंद पंजाब रेजिमेंट से एक सिपाही बन गए. आर्मी में आने के बाद ध्यानचंद ने होकी खेलना अच्छे से शुरू किया, और उन्हें ये पसंद आने लगा. सूबेदार मेजर भोले तिवार जो ब्राह्मण रेजिमेंट से थे, वे आर्मी में ध्यानचंद के मेंटर बने, और उन्हें खेल के बारे में बेसिक ज्ञान दिया. पंकज गुप्ता ध्यानचंद के पहले कोच कहे जाते थे, उन्होंने ध्यानचंद के खेल को देखकर कह दिया था कि ये एक दिन पूरी दुनिया में चाँद की तरह चमकेगा. उन्ही ने ध्यानचंद को चन्द नाम दिया, जिसके बाद उनके करीबी उन्हें इसी नाम से पुकारने लगे. इसके बाद ध्यान सिंह, ध्यान चन्द बन गया.\n" +
                    "\n" +
                    "ध्यानचंद का शुरुवाती करियर (Dhyan Chand Sports Career) –\n" +
                    "\n" +
                    "ध्यानचंद के खेल के ऐसे बहुत से पहलु थे, जहाँ उनकी प्रतिभा को देखा गया था. एक मैच में उनकी टीम 2 गोल से हार रही थी, ध्यानचंद ने आखिरी 4 min में 3 गोल मार टीम को जिताया था. यह पंजाब टूर्नामेंट मैच झेलम में हुआ था. इसके बाद ही ध्यानचंद को होकी विज़ार्ड कहा गया.\n" +
                    "\n" +
                    "ध्यानचंद ने 1925 में पहला नेशनल होकी टूर्नामेंट गेम खेला था. इस मैच में विज, उत्तरप्रदेश, पंजाब, बंगाल, राजपुताना और मध्य भारत ने हिस्सा लिया था. इस टूर्नामेंट में उनकी परफॉरमेंस को देखने के बाद ही, उनका सिलेक्शन भारत की इंटरनेशनल होकी टीम में हुआ था.\n" +
                    "\n" +
                    "ध्यानचंद अन्तराष्ट्रीय खेल करियर (Dhyan Chand Interesting Facts) –\n" +
                    "\n" +
                    "1926 में न्यूजीलैंड में होने  वाले एक टूर्नामेंट के लिए ध्यानचंद का चुनाव हुआ. यहाँ एक मैच के दौरान भारतीय टीम ने 20 गोल किये थे, जिसमें से 10 तो ध्यानचंद ने लिए थे. इस टूर्नामेंट में भारत ने 21 मैच खेले थे, जिसमें से 18 में भारत विजयी रहा, 1 हार गया था एवं 2 ड्रा हुए थे. भारतीय टीम ने पुरे टूर्नामेंट में 192 गोल किये थे, जिसमें से ध्यानचंद ने 100 गोल मारे थे. यहाँ से लौटने के बाद ध्यानचंद को आर्मी में लांस नायक बना दिया गया था. 1927 में लन्दन फोल्कस्टोन फेस्टिवल में भारत ने 10 मैचों में 72 गोल किये, जिसमें से ध्यानचंद ने 36 गोल किये थे.\n" +
                    "\n" +
                    "1928 में एम्स्टर्डम ओलिंपिक गेम भारतीय टीम का फाइनल मैच नीदरलैंड के साथ हुआ था, जिसमें 3 गोल में से 2 गोल ध्यानचंद ने मारे थे, और भारत को पहला स्वर्ण पदक जिताया था. 1932 में लासएंजिल्स ओलिंपिक गेम में भारत का फाइनल मैच अमेरिका के साथ था, जिसमें भारत ने रिकॉर्ड तोड़ 23 गोल किये थे, और 23-1 साथ जीत हासिल कर स्वर्ण पदक हासिल किया था. यह वर्ल्ड रिकॉर्ड कई सालों बाद 2003 में टुटा है. उन 23 गोल में से 8 गोल ध्यानचंद ने मारे थे. इस इवेंट में ध्यानचंद ने 2 मैच में 12 गोल मारे थे.\n" +
                    "\n" +
                    "1932 में बर्लिन ओलिंपिक में लगातार तीन टीम हंगरी, अमेरिका और जापान को जीरो गोल से हराया था. इस इवेंट के सेमीफाइनल में भारत ने फ़्रांस को 10 गोल से हराया था, जिसके बाद फाइनल जर्मनी के साथ हुआ था. इस फाइनल मैच में इंटरवल तक भारत के खाते में सिर्फ 1 गोल आया था. इंटरवल में ध्यानचंद ने अपने जूते उतार दिए और नंगे पाँव गेम को आगे खेला था, जिसमें भारत को 8-1 से जीत हासिल हुई और स्वर्ण पदक मिला था.\n" +
                    "\n" +
                    "ध्यानचंद की प्रतिभा को देख, जर्मनी के महान हिटलर ने ध्यानचंद को जर्मन आर्मी में हाई पोस्ट में आने का ऑफर दिया था, लेकिन ध्यानचंद को भारत से बहुत प्यार था, और उन्होंने इस ऑफर को बड़ी शिष्टता से मना कर दिया.\n" +
                    "\n" +
                    "ध्यानचंद अन्तराष्ट्रीय होकी को 1948 तक खेलते रहे, इसके बाद 42 साल की उम्र में उन्होंने रिटायरमेंट ले लिया. ध्यानचंद इसके बाद भी आर्मी में होने वाले होकी मैच को खेलते रहे. 1956 तक उन्होंने होकी स्टिक को अपने हाथों में थमा रहा.\n" +
                    "\n" +
                    "ध्यानचंद मृत्यु (Dhyan Chand Death) –\n" +
                    "\n" +
                    "ध्यानचंद के आखिरी दिन अच्छे नहीं रहे. ओलिंपिक मैच में भारत को स्वर्ण पदक दिलाने के बावजूद भारत देश उन्हें भूल गया. उनके आखिरी दिनों में उन्हें पैसों की भी कमी थी. उन्हें लीवर में कैंसर हो गया था, उन्हें दिल्ली के AIIMS हॉस्पिटल के जनरल वार्ड में भर्ती कराया गया था. उनका देहांत 3 दिसम्बर 1979 को हुआ था.",
"दुनिया के प्रमुख बिजनेसमेन में शामिल अलीबाबा ग्रुप के संस्थापक जैक मा का जन्म 10 सितम्बर सन 1964 को हन्ग्ज़्हौ, ज्हेजिंग, चीन में हुआ. जैक मा के अलावा इनका नाम मा युन है. आज जिस जैक मा की संपत्ति 14 ख़रब रूपया है वही जैक मा अपने कॉलेज एग्जाम में 3 बार फ़ैल हुए और चीन की कई कंपनियों ने उन्हें अयोग्य कहकर नौकरी नहीं दी. जैक मा दुनिया के प्रमुख धनी लोगो में से एक है. नौकरी न मिलने के बाद जैक मा ने अपना संघर्ष जारी रखा और सन 1998 में अलीबाबा की स्थापना की.\n" +
        "\n" +
        "करियर :\n" +
        "\n" +
        "        जैक मा ने करियर की शुरुवात काफी चुनौतीपूर्ण रही | जैक मा ने 30 अलग अलग जगहों पर नौकरी के लिए आवेदन किये लेकिन हर बार उन्हें निराशा ही हाथ लगी | जैक माँ सबसे पहले एक पुलिस की नौकरी के लिए आवेदन किया था लेकिन उनके डील डौल को देखकर उन्हें साफ मना कर दिया | इसके बाद वो एक बार KFC में भी नौकरी के लिए जब KFC पहली बार उनके शहर में आया था | इस नौकरी के लिए 24 लोगो ने आवेदन किया था जिसमे से 23 लोगो को चयन हो गया लेकिन एकमात्र जैक मा का चयन नही हुआ था | इससे पता चलता है कि जैक मा ने अपने करियर की शुरुवात में कितनी ठोकरे खाई थी ||\n" +
        "\n" +
        "        1994 में जैक मा ने पहली बार इन्टरनेट का नाम सूना | 1995 की शुरवात में वो अपने दोस्तों की मदद से अमेरिका गये जहा उन्होंने पहली बार इन्टरनेट देखा | जैक मा ने इससे पहले कभी इन्टरनेट नही चलाया था , उन्होंने जब पहली बार इन्टरनेट चलाया तो उन्होंने “beer ” शब्द खोजा | उन्हें Beer से संबधित कई जानकारी अलग अलग देशो से प्राप्त हुयी लेकिन वो ये देखकर चौक गये कि उस सर्च में चीन का नाम कही नही था | अगले बार उन्होंने चीन के बारे में सामान्य जानकारी ढूंढने की कोशिश की लेकिन फिर वो चौक गये कि चीन को कोई जानकारी इन्टनेट पर उपलब्ध नही थी |\n" +
        "\n" +
        "अलीबाबा कंपनी की शुरुआत :\n" +
        "\n" +
        "        कुछ दिन सरकारी काम करने के बाद वे वापस गाँव आ गए और उन्होंने अपने १७ मित्रों को इन्वेस्ट करने के लिए रजामंद किया । और इस तरह उन्होंने अपने मित्रों के साथ मिल कर “Alibaba” कंपनी (उस वक़्त एक स्टार्टअप) की नींव रखी । शुरुआती दौर में इस कंपनी का ऑफिस अपना खुद का अपार्टमेंट बनाया । इन दिनों अपने मित्रों के इन्वेस्टमेंट के अलावा उनके पास कोई और पूंजी का माध्यम नहीं था परन्तु बाद में १९९९ तक कुछ दूसरी कंपनियों की मदद से उनका निवेश २५ मिलियन डॉलर और बढ़ गया ।\n" +
        "\n" +
        "        चीन के लोगो का विश्वास जीतने और उन्हें इंटरनेट पर व्यवसाय करना सिखाने के बाद अब ये कम्पनी दुनिया की वृहदतम कंपनियों में से एक बन चुकी है । एक छोटे से गाँव के लड़के का सफ़र जिसके पास खर्च ने के लिए एक रुपया भी नहीं था वो इतनी बड़ी कंपनी को स्थापित करने में सफल हुआ सिर्फ इस वजह से क्योंकि उसमे जज्बा था कुछ कर दिखाने का, उसमे ललक थी कुछ कर जाने की और सबसे जरूरी उसमे जिज्ञासा थी हर वक़्त कुछ नया सीखने की । जिस इंसान में तलब है सीखने की उसका सफलता की बुलंदियाँ छूना तय है । वो हजार बार असफल होकर भी एक ना एक दिन सफलता के वो पायदान पर पहुँच जाता है जो हमें असंभव जान पड़ते हैं ।\n" +
        "\n" +
        "जैक मा गए अमरीका :\n" +
        "\n" +
        "        जैक मा ने 1994 में पहली बार इन्टरनेट का नाम सुना। जैक मा 1995 में अपने दोस्तों की मदद से इन्टरनेट के विषय में जानकारी लेने के लिए अमरीका गए। अमरीका में उन्होंने पहली बार इन्टरनेट देखा और चलाया। उन्होंने इन्टरनेट पर सबसे पहले Bear शब्द को Search किया, वहां उन्हें Bear शब्द के बारे में अन्य-अन्य websites से कई प्रकार ककी जानकारी मिली। उन्होंने जब अच्छे से ध्यान दिया तो देखा की इन्टरनेट पर चीनी भाषा में इसके विषय में कोई जानकरी नहीं है।\n" +
        "\n" +
        "        यहाँ तक की उन्होंने चीन देश के विषय में भी इन्टरनेट पर search किया जिसके विषय में भी internet पर उनको search करने पर कुछ नहीं मिला। अपने देश की जानकारी इन्टरनेट पर न पा कर जैक बहुत दुखी हुए क्योंकि उन्हें लगा की अन्य देशों के मुकाबले टेक्नोलॉजी क्षेत्र में चीन बहुत पीछे जैक मा ने चीन की जानकारी की पहली वेबसाइट बने. जैक मा और उनके अमरीकी मित्र ने मिलकर चीन की जानकारी से भरा हुआ अपना एक पहला वेबसाइट बनाया वेबसाइट। बनाने के कुछ ही घंटों के अन्दर जैक मा को कुछ चीनी लोगों के ईमेल आने लगे। यह देख कर जैक मा को इन्टरनेट की ताकत का पता चला।\n" +
        "\n" +
        "जैक मा के अनमोल विचार :\n" +
        "\n" +
        "1. अपने बुरे दिनों में आपको बहुत अधिक फोकस्ड होना होता है और अपने दिमाग पर भरोसा करना होता है ना कि अपनी ताकत पर.\n" +
        "2. आपको अपने विपक्षी से सीखना चाहिए लेकिन कभी भी नक़ल न करें. अगर नक़ल किया तो समझो हारे.\n" +
        "3. धैर्य का आपमें होना सबसे ज्यादा ज़रूरी है.\n" +
        "4. हमारे पास कभी भी पैसों की कमी नहीं होती. हमारे पास कमी होती है तो सपने देखने वाले लोगों की जो अपने सपनो के लिए मर सकें.\n" +
        "5. कभी भी कीमतों पर प्रतिस्पर्धा मत करो बल्कि सेवाओं और इनोवेशन पर प्रतिस्पर्धा करो.\n" +
        "6. दूसरों की सफलता से सीखने की बजाय उनकी गलतियों से सीखो. ज्यादातर लोग जो असफल होते हैं उनकी असफलता के कारण समान होते हैं जबकि सफलता की कई वजहें से मिल सकती है.\n" +
        "7. यदि अलीबाबा माइक्रोसॉफ्ट या वाल-मार्ट नहीं बन पाता है तो मुझे बाकी की ज़िन्दगी इसका अफ़सोस रहेगा.\n" +
        "8. मैं यह चाहता हूँ लोग जानें कि लोकतंत्र का मतलब क्या होता है.\n" +
        "9. अलीबाबा एक ऐसा सिस्टम है जो छोटे व्यवसायों को फलने-फूलने में मदद करता है.",
            "धीरजलाल हीरालाल अंबानी का जन्म 28 दिसम्बर, 1932 को गुजरात के जूनागढ़ जिले के छोटे से गांव चोरवाड़ में हुआ था। उनके पिता का नाम हीरालाल अंबानी और माता का नाम जमनाबेन था। धीरूभाई अंबानी के पिता एक शिक्षक थे। धीरूभाई के चार भाई-बहन थे। धीरूभाई का शुरूआती जीवन कष्टमय था। इतना बड़ा परिवार होने के कारण आर्थिक परेशानियों का सामना करना पड़ता था। इन्हीं सभी परेशानियों के कारण उन्हें स्कूली शिक्षा भी बीच में छोड़नी पड़ी। पिता की मदद करने के लिए धीरूभाई ने छोटे-मोटे काम करने शुरू कर दिए थे।\n" +
                    " \n" +
                    "व्यवसायिक सफर-\n" +
                    " \n" +
                    "धीरूभाई ने पढ़ाई छोड़ने के बाद फल और नाश्ता बेचने का काम शुरू किया, लेकिन कुछ ज्यादा फायदा नहीं हुआ। उन्होंने गांव के पास एक धार्मिक स्थल पर पकौड़े बेचने का काम शुरू किया लेकिन यह काम पूरी तरह पर्यटकों पर निर्भर था, जो साल के कुछ समय तो अच्छा चलता था बाकी समय इसमें खास फायदा नहीं था। धीरू भाई अंबानी ने इस काम को भी कुछ समय बाद बंद कर दिया। बिजनेस से मिली पहली दो असफलताओं के बाद धीरूभाई के पिता ने उन्हें नौकरी करने की सलाह दी।\n" +
                    " \n" +
                    "नौकरी के दौरान व्यापार- \n" +
                    " \n" +
                    "धीरू भाई अंबानी के बड़े रमणीक भाई यमन में नौकरी किया करते थे। उनकी मदद से धीरू भाई को भी यमन जाने का मौका किया। वहां उन्होंने 300 रुपये प्रति माह के वेतन पर पेट्रोल पंप पर काम किया। महज  दो वर्ष में ही अपनी योग्यता की वजह से प्रबंधक के पद तक पहुंच गए। इस नौकरी के दौरान भी धीरू भाई का मन इसमें कम और व्यापार में करने के मौकों की तरफ ज्यादा रहा। धीरू भाई ने उस हरेक संभावना पर इस समय में विचार किया कि किस तरह वे सफल बिजनेस मैन बन सकते हैं। एक घटना व्यापार के प्रति जुनून को बयां करती है- धीरूभाई अंबानी जब एक कंपनी में काम कर रहे थे तब वहां काम करने वाला कर्मियों को चाय महज 25 पैसे में मिलती थी, लेकिन धीरू भाई पास के एक बड़े होटल में चाय पीने जाते थे, जहां चाय के लिये 1 रुपया चुकाना पड़ता था। उनसे जब इसका कारण पूछा गया तो उन्होंने बताया कि उसे बड़े होटल में बड़े-बड़े व्यापारी आते हैं और बिजनेस के बारे में बातें करते हैं। उन्हें ही सुनने जाता हूं ताकि व्यापार की बारीकियों को समझ सकूं। इस बात से पता चलता है कि धीरूभाई अंबानी को बिजनेस का कितना जूनून था।\n" +
                    " \n" +
                    "कुछ समय बाद यमन में आजादी के लिए आन्दोलन शुरू हो गए, इस कारण वहां रह रहे भारतीयों के लिए व्यवसाय के सारे दरवाज़े बंद कर दिए गये। इसके बाद लगभग 1950 के दशक के शुरुआती सालों में धीरुभाई अंबानी यमन से भारत लौट आये और अपने चचेरे भाई चम्पकलाल दमानी के साथ मिलकर पॉलिएस्टर धागे और मसालों के आयात-निर्यात का व्यापार प्रारंभ किया। रिलायंस कमर्शियल कारपोरेशन की शुरुआत मस्जिद बन्दर के नरसिम्हा स्ट्रीट पर एक छोटे से कार्यालय के साथ हुई। यहीं से जन्म हुआ रिलायंस कंपनी का। इस व्यापार के पीछे धीरुभाई का लक्ष्य मुनाफे पर ज्यादा ध्यान न देते हुए ज्यादा से ज्यादा उत्पादों का निर्माण और उनकी गुणवत्ता पर था। इस दौरान अम्बानी और उनका परिवार मुंबई के भुलेस्वर स्थित ‘जय हिन्द एस्टेट’ में एक छोटे से अपार्टमेंट में रहता था।\n" +
                    " \n" +
                    "वर्ष 1965 में धीरुभाई अंबानी और चम्पकलाल दमानी की व्यावसायिक साझेदारी समाप्त हो गयी। दोनों के स्वभाव और व्यापार करने के तरीके बिलकुल अलग थे इसलिए ये साझेदारी ज्यादा लम्बी नहीं चल पायी। एक ओर जहाँ दमानी एक सतर्क व्यापारी थे, वहीं धीरुभाई को जोखिम उठाने वाला माना जाता था। इसके बाद धीरुभाई ने सूत के व्यापार में हाथ डाला जिसमें पहले के व्यापार की तुलना में ज्यादा हानि की आशंका थी। पर वे धुन के पक्के थे उन्होंने इस व्यापार को एक छोटे स्टोर पर शुरू किया और जल्द ही अपनी काबिलियत के बलबूते धीरुभाई बॉम्बे सूत व्यापारी संगठन के संचालक बन गए।\n" +
                    " \n" +
                    "अब तक धीरुभाई को वस्त्र व्यवसाय की अच्छी समझ हो गयी थी। इस व्यवसाय में अच्छे अवसर की समझ होने के कारण उन्होंने वर्ष 1966 में अहमदाबाद के नैरोड़ा में एक कपड़ा मिल स्थापित की। यहाँ वस्त्र निर्माण में पोलियस्टर के धागों का इस्तेमाल हुआ और धीरुभाई ने ‘विमल’ ब्रांड की शुरुआत की जो की उनके बड़े भाई रमणिकलाल अंबानी के बेटे, विमल अंबानी के नाम पर रखा गया था। उन्होंने “विमल” ब्रांड का प्रचार-प्रसार इतने बड़े पैमाने पर किया कि यह ब्रांड भारत के अंदरूनी इलाकों में भी एक घरेलू नाम बन गया।\n" +
                    " \n" +
                    "1980 के दशक में धीरूभाई ने पॉलिएस्टर फिलामेंट यार्न निर्माण का सरकार से लाइसेंस लेने सफलता हासिल की। इसके बाद धीरूभाई सफलता का सीढ़ी चढ़ते गए। धीरुभाई को इक्विटी कल्ट को भारत में प्रारम्भ करने का श्रेय भी जाता है। जब 1977 में रिलायंस ने आईपीओ जारी किया तब 58,000 से ज्यादा निवेशकों ने उसमें निवेश किया। धीरुभाई गुजरात और दूसरे राज्यों के ग्रामीण लोगों को आश्वस्त करने में सफल रहे कि जो उनके कंपनी के शेयर खरीदेगा उसे अपने निवेश पर केवल लाभ ही मिलेगा। अपने जीवनकाल में ही धीरुभाई ने रिलायंस के कारोबार का विस्तार विभिन क्षेत्रों में किया। इसमें मुख्य रूप से पेट्रोरसायन, दूरसंचार, सूचना प्रोद्योगिकी, ऊर्जा, बिजली, फुटकर, कपड़ा/टेक्सटाइल, मूलभूत सुविधाओं की सेवा, पूंजी बाज़ार और प्रचालन-तंत्र शामिल हैं। धीरुभाई के दोनों पुत्र 1991 के बाद मुक्त अर्थव्यवस्था के कारण निर्माण हुये नये मौकों का पूरा उपयोग करके ‘रिलायन्स’ की पीढ़ी सफल तरीके से आगे चला रहे हैं।\n" +
                    " \n" +
                    "धीरुभाई अंबानी ने जो कंपनी कुछ पैसे की लागत पर खड़ी की थी उस रिलायंस इंडस्ट्रीज में 2012 तक 85000 कर्मचारी हो गये थे और सेंट्रल गवर्नमेंट के पूरे टैक्स में से 5% रिलायंस देती थी। और 2012 में संपत्ति के हिसाब से विश्व की 500 सबसे अमीर और विशाल कंपनियों में रिलायंस को भी शामिल किया गया था। धीरुभाई अंबानी को सन्डे टाइम्स में एशिया के टॉप 50 व्यापारियों की सूची में भी शामिल किया गया था।\n" +
                    " \n" +
                    "निजी जीवन- \n" +
                    " \n" +
                    "धीरूभाई अंबानी का विवाह कोकिलाबेन के साथ हुआ था और उनको दो बेटे हैं मुकेश अंबानी और अनिल अंबानी और दो बेटियाँ हैं नीना कोठारी और दीप्ति सल्गाओकर।\n" +
                    " \n" +
                    "निधन- \n" +
                    " \n" +
                    "दिल का दौरा पड़ने के बाद धीरुभाई को मुंबई के ब्रीच कैंडी अस्पताल में 24 जून, 2002 को भर्ती कराया गया। इससे पहले भी उन्हें दिल का दौरा एक बार 1986 में पड़ चुका था, जिससे उनके दायें हाँथ में लकवा मार गया था। 6 जुलाई 2002 को धीरुभाई अम्बानी ने अपनी अन्तिम सांसें लीं।\n" +
                    " \n" +
                    "पुरस्कार और सम्मान- \n" +
                    " \n" +
                    "- वर्ष 1998 में पेनसिल्वेनिया विश्वविद्यालय द्वारा ‘डीन मैडल’ प्रदान किया गया।\n" +
                    "- एशियावीक पत्रिका द्वारा वर्ष 1996, 1998 और 2000 में ‘पॉवर 50 – मोस्ट पावरफुल पीपल इन एशिया’ की सूची में शामिल।\n" +
                    "- 1999 में बिजनेस इंडिया-बिजनेस मैन ऑफ द ईयर।\n" +
                    "- भारत में केमिकल उद्योग के विकास में महत्वपूर्ण योगदान के लिए ‘केमटेक फाउंडेशन एंड कैमिकल इंजीनियरिंग वर्ल्ड’ द्वारा ‘मैन ऑफ़ द सेंचुरी’ सम्मान, 2000।\n" +
                    "- वर्ष 2001 में ‘इकनोमिक टाइम्स अवॉर्ड्स फॉर कॉर्पोरेट एक्सीलेंस’ के अंतर्गत ‘लाइफटाइम अचीवमेंट अवार्ड।\n" +
                    "- एशियन बिज़नस लीडरशिप फोरम अवॉर्ड्स 2011 में मरणोपरांत ‘एबीएलएफ ग्लोबल एशियन अवार्ड’ से सम्मानित।\n" +
                    "- फेडरेशन ऑफ़ इंडियन चैम्बर्स ऑफ़ कॉमर्स एंड इंडस्ट्री (फिक्की) द्वारा ‘मैन ऑफ 20th सेंचुरी’ घोषित।",
            " गेट्स का जन्म सिएटल, वॉशिंगटन में, विलियम एच। गेट्स, सीनियर और मरी मैक्सवेल गेट्स के यहाँ हुआ। उनका परिवार धनी था, उनके पिता एक प्रमुख वकील थे, उनकी माँ प्रथम इंटरस्टेट बैंक सिस्टम और यूनाइटेड वे के निदेशक मंडल मे सेवारत थीं और उनकी पिता, जे. डब्ल्यू. मैक्सवेल, एक राष्ट्रीय बैंक के अध्यक्ष थे। गेट्स की एक बड़ी बहन, क्रिस्टी (क्रिस्तिंने) और एक छोटी बहन, लिब्बी है। वे अपने परिवार में सम नाम के चौथे व्यक्ति थे, लेकिन विलियम गेट्स I या \"ट्रे\" के नाम से जाने जाते थे क्योंकि उनके पिता ने अपने नामांत में I जोड़ना छोड़ दिया था। उनके जीवन के प्रारंभिक काल में उनके माता पिता के मन में उनके लिए कानून का कैरियर था।\n" +
                    "\n" +
                    "        उनके माता – पिता उनके लिए क़ानून में करियर बनाने का स्वप्न लेकर बैठे थे परन्तु उन्हें बचपन से ही कंप्यूटर विज्ञान तथा उसकी प्रोग्रामिंग भाषाओं में रूचि थी | उनकी प्रारंभिक शिक्षा लेकसाइड स्कूल में हुई | जब वह आठवीं कक्षा के छात्र थे तब उनके विद्यालय ने  ऐएसआर – 33 दूरटंकण टर्मिनल तथा जनरल इलेक्ट्रिक कंप्यूटर पर एक कंप्यूटर प्रोग्राम खरीदा जिसमें गेट्स ने रूचि दिखाई | तत्पश्चात मात्र तेरह वर्ष की आयु में उन्होंने अपना पहला कंप्यूटर प्रोग्राम लिखा जिसका नाम “टिक-टैक-टो”तथा इसका प्रयोग कंप्यूटर से खेल खेलने हेतु किया जाता था | बिल गेट्स इस मशीन से बहुत अधिक प्रभावित थे तथा जानने को उत्सुक थे कि यह सॉफटवेअर कोडस किस प्रकार कार्य करते हैं |\n" +
                    "\n" +
                    "        मात्र 17 वर्ष कि उम्र में उन्होंने अपने मित्र एलन के साथ मिलकर ट्राफ़- ओ- डाटा नामक एक उपक्रम बनाया जो इंटेल 8008 प्रोसेसर पर आधारित  यातायात काउनटर (Traffic Counter) बनाने के लिए प्रयोग में लाया गया | उसके पश्चात उन्होंने चिप बनाया तथा यह उस समय का व्यक्तिगत कंप्यूटर (Personal Computer) के अन्दर चलने वाला सबसे वहनयोग्य चिप था, जिसके पश्चात बिल गेट्स को यह एहसास हुआ कि समय द्वारा दिया गया यह सबसे उत्तम अवसर है जब उन्हें अपनी स्वयं कि कंपनी का आरम्भ करना चाहिए |\n" +
                    "\n" +
                    "        गेट्स की शादी फ्रांसीसी मेलिंडा (Melinda French) के साथ डलास, टेक्सास में जून 1, 1994 को हुआ उनके तीन बच्चे हैं: जेनिफर कैथेराइन गेट्स (1996), रोरी जॉन गेट्स (1999) एवं फोएबे अदेले गेट्स (2002). बिल गेट्स का घर|बिल गेट्स का घर लेक वॉशिंगटन (Lake Washington) की ओर झांकती हुई, एक पहाड़ी के पास धरती पर आश्रय|जो मेडीना (Medina), वॉशिंगटनमें है,21 वीं सदी की एक भू आश्रित मकान है।\n" +
                    "\n" +
                    "        (earth-sheltered home)(Bill Gates' house)किंग काउंटी (King County) के अनुसार वर्ष 2006 में, इस संपत्ति (जमीन और घर) का सार्वजनिक मूल्यांकन $1250 लाख, और वार्षिक संपत्ति कर $991हज़ार है। इसके अलावे गेट्स के निजी संग्रह में है लियोनार्दो दा विन्ची द्वारा लिखित कोडेक्स लेस्टर (Codex Leicester), जो गेट्स ने वर्ष 1994 की एक नीलामी में $308 लाख में खरीदा था। गेट्स एक गहरा अध्यनकारी के रूप में भी जाने जाते हैं और उनके घर की विशाल पुस्तकालय के छत में, महान गाट्स्बी (The Great Gatsby) का एक उद्धरण खुदाई किया हुआ है।\n" +
                    "\n" +
                    "मायक्रोसॉफट:\n" +
                    "\n" +
                    "        1975 में, गेट्स और पॉल एलन के साथ मिलकर माइक्रोसॉफ्ट की स्थापना की, जो बाद में विश्व की सबसे बड़ी PC सॉफ्टवेयर बनाने वाली कंपनी बनी. माइक्रोसॉफ्ट में उनके करियर के दौरान, गेट्स ने कंपनी के अध्यक्ष, सीईओ और मुख्य सॉफ्टवेयर निर्माता का पद ग्रहण कर रखा था और मई 2014 तक वे विश्व के सबसे बड़े वैयक्तिक शेयरहोल्डर बने रहे. गेट्स बहोत सी किताबो के रचयिता और सह-रचयिता भी है.\n" +
                    "\n" +
                    "        1987 की शुरुवात में ही, बिल गेट्स को विश्व में सर्वाधिक संपत्ति वाले लोगो की सूचि में भी शामिल किया गया और 2007-08 की आर्थिक मंदी को अगर छोड़ दिया जाये तो 1995 से 2014 तक वे उन सब में सबसे अमीर थे. तो 2009 और 2014 के बिच में, उनकी कुल संपत्ति US $40 बिलियन से बढ़कर सीधे US $ 82 बिलियन हो गयी. 2013 और 2014 के मध्य में उनकी संपत्ति फिर से US $ 15 बिलियन बढ़ी. और फिलहाल गेट्स विश्व के सबसे अमीर व्यक्ति है.\n" +
                    "\n" +
                    "        Bill की कुशाग्रता न केवल Software बनाने में थी. उसके साथ-साथ Business को भी आगे बढाने और Company को टॉप पर ले जाने की थी. उन्होंने जो कहा उन्होंने वैसा काम भी किया. Company में Employees द्वारा बनाये गए Code को वे जरूरत पढने पर खुद चेक करते और Error को निकाल देने का काम स्वयं किया करते थे. Bill की मेहनत और लगन की वजह से Company की तरक्की दिन ब दिन Apple, Intel और IBM जैसी Hardware बनाने वाली Company की तरह बढती जा रही थी.\n" +
                    "\n" +
                    "        Bill लगातार लोगों से Microsoft द्वारा बनाई गई Application के बारे में Feedback लिया करते और लोगों की जरुरतो के हिसाब से Apps में बदलाव किया करते. और इस काम में इनकी माँ भी कई बार उनके साथ चली जाया करती थी. उनकी माँ Mary बहुत ही इज्ज़तदार व्यक्तियों में से एक के साथ, उनके IBM Board के Members से संबंध बहुत अच्छे भी थे. Mary के ही कारण Bill IBM के CEO से मिल पाए.\n" +
                    "\n" +
                    "        नवम्बर 1980 में IBM एक ऐसा Software चाहता था जिससे अपना Personal Computer चला सके और इस Software को बनाने के लिए उन्होंने Microsoft के सामने प्रस्ताव रखा. IBM के CEO से पहली मुलाक़ात के वक़्त किसी ने Bill को ऑफिस का एक कर्मचारी समज्ञ कर उन्हें सबको कॉफ़ी पिलाने को कहा उस वक़्त Bill काफी जवान दीखते थे और जल्दी ही IBM उनसे Impress हो गये. और Bill ने उन्हें Software बनाने के लिए राज़ी कर लिया, कि वे उनके Software से जुडी सारी जरूरते पूरी कर लेंगे. लेकिन परेशानी यह थी कि Microsoft Company IBM के लिए Basic Operating System नही बना पाया जो IBM के नए Computer को चला सके, लेकिन यह कोई अंत नहीं था.\n" +
                    "\n" +
                    "विचार :\n" +
                    "\n" +
                    "• चाहे आपमें कितनी भी योग्यता क्यों न हो, केवल एकाग्रचित्त होकर ही आप महान कार्य कर सकते हैं।\n" +
                    "• सफलता एक घटिया शिक्षक है। यह लोगों में यह सोच विकसित कर देता है कि वो असफल नहीं हो सकते।\n" +
                    "• जब आपके हाथ में पैसा होता है तो केवल आप भूलते है की आप कौन है लेकिन जब आपके हाथ खाली होते है तो सम्पूर्ण संसार भूल जाता है की आप कौन है।\n" +
                    "• यह सही हैं की सफलता का जश्न आप मनाये पर अपने पुराने बुरे समय को याद रखते हुए।\n" +
                    "• मैं एक कठिन काम को करने के लिए एक आलसी इंसान को चुनुंगा क्योकि आलसी इंसान उस काम को करने का एक आसान तरीका खोज लेगा।\n" +
                    "• बेवकूफ बनकरखुश रहिये और इसकी पूरी उम्मीद हैं की आप अंत में सफलता प्राप्त करेंगे।\n" +
                    "• जीवन सेमेस्टर में विभाजित नहीं है। आपको गर्मियों में छुट्टी नहीं मिलती है और कुछ नियोक्ता आपको अपने आप को खोजने में मदद करने में रुचि रखते हैं।\n" +
                    "• यदि   जनरल मोटर्स कम्प्यूटर  इंडस्ट्री  के  हिसाब  से  अपनी  टेक्नोलॉजी  का विकास  करता  तो  आज  हम  $25 की  कार  चला  रहे  होते  जो  1000 माईल्स पर गैलन के हिसाब  से  चलती।\n" +
                    "• मेरा विश्वास है की यदि आप लोगो को समस्याएं दिखाओंगे और उनका हल सुझाओगे तो लोग उसको अपनाने के लिए आकर्षित होंगे।\n" +
                    "• मैं परीक्षा में कुछ विषयो में फ़ैल हो गया। और मेरे सभी दोस्त पास हो गये !अब वे माइक्रोसॉफ्ट कम्पनी में इंजीनियर है और मै माइक्रोसॉफ्ट कम्पनी का मालिक हूँ।\n" +
                    "• टेक्नोलॉजी केवल मात्र एक औजार है जो बच्चों को एक साथ काम करने के लिए पास लाते है पर जहां तक बात बच्चों को प्रेरित करने की है तो शिक्षक सबसे महत्तवपूर्ण है।\n" +
                    "\n" +
                    "        1990 के दशक की सबसे प्रसिद्ध व्यापारी होने के अलावा, गेट्स भी खुद एक परोपकारी दान के लिए काम कर रहे किसी के रूप में प्रतिष्ठित है. वह और पत्नी मेलिंडा बिल एंड मेलिंडा गेट्स फाउंडेशन की स्थापना की, जो स्वास्थ्य देखभाल और दुनिया भर के बच्चों के लिए शिक्षा में सुधार करने में मदद करने पर ध्यान केंद्रित. नींव 1996 में अपनी शुरुआत के बाद से 4 अरब डॉलर का दान दिया है.\n" +
                    "\n" +
                    "        750 $ मिलियन पांच वर्षों में मदद करने के लिए बच्चों के टीके के लिए ग्लोबल फंड लॉन्च,, 50 $ मिलियन मदद करने के लिए विश्व स्वास्थ्य संगठन के प्रयासों को पोलियो, एक गंभीर रोग उन्मूलन के लिए हाल ही में प्रतिज्ञाओं एक $ अरब बीस साल से अधिक के लिए के बारे में एक हजार अल्पसंख्यक छात्रों के लिए कॉलेज छात्रवृत्ति निधि शामिल कि आम तौर पर बच्चों हमलों, और 3 मिलियन डॉलर अर्जित प्रतिरक्षा कमी सिंड्रोम (एड्स एक लाइलाज बीमारी है जो शरीर की प्रतिरक्षा प्रणाली को नष्ट कर देता है) के प्रसार को रोकने में मदद दक्षिण अफ्रीका में युवा लोगों के बीच. नवंबर 1998 में गेट्स और उनकी पत्नी भी सबसे बड़ा अमेरिकी सार्वजनिक पुस्तकालय के लिए एक उपहार दिया था, जब वे सिएटल सार्वजनिक पुस्तकालय के लिए 20 करोड़ डॉलर का दान दिया. गेट्स की धर्मार्थ दान का एक और $ 20 मिलियन कंप्यूटर विज्ञान के लिए अपनी",
            "अमिताभ बच्चन की शुरूआत फिल्मों में वॉयस नैरेटर के तौर पर फिल्म 'भुवन शोम' से हुई थी लेकिन अभिनेता के तौर पर उनके करियर की शुरूआत फिल्म 'सात हिंदुस्तानी' से हुई। इसके बाद उन्होंने कई फिल्में कीं लेकिन वे ज्यादा सफल नहीं हो पाईं। फिल्म 'जंजीर' उनके करियर का टर्निंग प्वाइंट साबित हुई। इसके बाद उन्होंने लगातार हिट फिल्मों की झड़ी तो लगाई ही, इसके साथ ही साथ वे हर दर्शक वर्ग में लोकप्रिय हो गए और फिल्म इंडस्ट्री में अपने अभिनय का लोहा भी मनवाया।\n" +
                    "\n" +
                    "प्रसिद्ध फिल्में\n" +
                    "सात हिंदुस्तानी, आनंद, जंजीर, अभिमान, सौदागर, चुपके चुपके, दीवार, शोले, कभी कभी, अमर अकबर एंथनी, त्रिशूल, डॉन, मुकद्दर का सिकंदर, मि. नटवरलाल, लावारिस, सिलसिला, कालिया, सत्ते पे सत्ता, नमक हलाल, शक्ति, कुली, शराबी, मर्द, शहंशाह, अग्निपथ, खुदा गवाह, मोहब्बतें, बागबान, ब्लैक, वक्त, सरकार, चीनी कम, भूतनाथ, पा, सत्याग्रह, शमिताभ जैसी शानदार फिल्मों ने ही उन्हें सदी का महानायक बना दिया। \n" +
                    "\n" +
                    "पुरस्\u200Dकार \n" +
                    "सर्वश्रेष्ठ अभिनेता के तौर पर उन्हें 3 बार राष्ट्रीय फिल्म पुरस्कार मिल चुका है। इसके अलावा 14 बार उन्हें फिल्मफेयर अवार्ड भी मिल चुका है। फिल्मों के साथ साथ वे गायक, निर्माता और टीवी प्रजेंटर भी रहे हैं। भारत सरकार ने उन्हें पद्मश्री और पद्मभूषण सम्मान से भी नवाजा है\n" +
                    "\n" +
                    "अमिताभ बच्चन से जुड़ी कुछ दिलचस्प बातें\n" +
                    "- अमिताभ बच्चन 'सदी के महानायक' कहे जाते हैं। वे हिन्दी फिल्मों के सबसे बड़े सुपरस्टार माने जाते हैं। \n" +
                    "\n" +
                    "- उन्हें असली पहचान फिल्म 'जंजीर' से मिली थी। यह फिल्म अमिताभ से पहले कई बड़े अभिनेताओं को ऑफर हुई थी जिसमें मशहूर अभिनेता राजकुमार भी शामिल थे लेकिन राजकुमार ने इस फिल्म को यह कहकर ठुकरा दिया था कि डायरेक्\u200Dटर के बालों के तेल की खुशबू अच्\u200Dछी नहीं है। \n" +
                    "\n" +
                    "- 70 और 80 के दौर में फिल्\u200Dमी सीन्\u200Dस में अमिताभ बच्\u200Dचन का ही आधिपत्\u200Dय था। इस वजह से फ्रेंच डायरेक्\u200Dटर फ़्राँस्वा त्रुफ़ो ने उन्\u200Dहें 'वन मैन इंडस्\u200Dट्री' तक करार दिया था।\n" +
                    "\n" +
                    "- अपने करियर के दौरान उन्\u200Dहोंने कई पुरस्\u200Dकार जीते हैं जिसमें सर्वश्रेष्\u200Dठ अभिनेता के तौर पर 3 राष्\u200Dट्रीय फिल्\u200Dम पुरस्\u200Dकार भी शामिल है। इंटरनेशनल फिल्\u200Dम फेस्टिवल्\u200Dस और कई अवार्ड समारोहों में उन्\u200Dहें कई पुरस्\u200Dकारों से सम्\u200Dमानित किया गया है। वे 14 फिल्\u200Dमफेयर पुरस्\u200Dकार भी जीत चुके हैं। उन्\u200Dहें फिल्\u200Dमफेयर में सबसे ज्\u200Dयादा 39 बार नामांकित किया जा चुका है।  \n" +
                    "\n" +
                    "- फिल्\u200Dमों में बोले गए उनके डॉयलाग आज भी लोगों के दिलों में ताजा हैं। उनके सुपरहिट करियर में उनके फिल्\u200Dमस के डॉयलाग्\u200Dस का भी अ\u200Dहम रोल रहा है। \n" +
                    "\n" +
                    "- उन्\u200Dहें भारत सरकार की तरफ से 1984 में पद्मश्री, 2001 में पद्मभूषण और 2015 में पद्मविभूषण जैसे सम्\u200Dमान मिल चुके हैं। \n" +
                    "\n" +
                    "- करियर के शुरूआती दौर में उन्\u200Dहें काफी दिक्\u200Dकतों का सामना करना पड़ा था। उनकी फिल्\u200Dमें लगातार फलाप हो रही थीं तब वे वापिस घर लौटने का मन बना चुके थे लेकिन फिल्\u200Dम जंजीर उनके करियर का टर्निंग प्\u200Dवाइंट बन गई और फिल्\u200Dम इंडस्\u200Dट्री में 'एंग्री यंग मैन' का उदय हुआ। \n" +
                    "\n" +
                    "- आज जिस अमिताभ बच्\u200Dचन के आवाज की पूरी दुनिया कायल है, एक समय था जब उनकी आवाज उनके करियर में रोड़ा बन रही थी और उन्\u200Dहें नकार दिया गया था लेकिन बाद में उनकी आवाज ही उनकी ताकत बनी और उनकी आवाज औरों से काफी जुदा और भारी थी, इस वजह से उन्\u200Dहें कई निर्देशकों ने कई फिल्\u200Dमों में अपनी कहानी को नैरेट तक करवाया। कई प्रोग्राम्\u200Dस को उन्\u200Dहोंने भी होस्\u200Dट किया। \n" +
                    "\n" +
                    "अमिताभ के करियर का बुरा दौर \n" +
                    "- उनकी फिल्\u200Dमें अच्\u200Dछा बिजनेस कर रही थीं कि अचानक 26 जुलाई 1982 को कुली फिल्\u200Dम की शूटिंग के दौरान उन्\u200Dहें गंभीर चोट लगी गई। दरअसल, फिल्\u200Dम के एक एक्\u200Dशन दृश्\u200Dय में अभिनेता पुनीत इस्\u200Dसर को अमिताभ को मुक्\u200Dका मारना था और उन्\u200Dहें मेज से टकराकर जमीन पर गिरना था। लेकिन जैसे ही वे मेज की तरफ कूदे, मेज का कोना उनके आंतों में लग गया जिसकी वजह से उनका काफी खून बह गया और स्\u200Dथिति इतनी गंभीर हो गई कि ऐसा लगने लगा कि वे मौत के करीब हैं लेकिन लोगों की दुआओं की वजह से वे ठीक हो गए। \n" +
                    "\n" +
                    "राजनीति में प्रवेश \n" +
                    "- कुली में लगी चोट के बाद उन्\u200Dहें लगा कि वे अब फिल्\u200Dमें नहीं कर पाएंगे और उन्\u200Dहोंने अपने पैर राजनीति में बढ़ा दिए। उन्\u200Dहोंने 8वें लोकसभा चुनाव में अपने गृह क्षेत्र इलाहाबाद की सीट से उ.प्र. के पूर्व मुख्\u200Dयमंत्री एचएन बहुगुणा को काफी ज्\u200Dयादा वोटों से हराया। \n" +
                    "\n" +
                    "- राजनीति में ज्\u200Dयादा दिन वे नहीं टिक सके और फिर उन्\u200Dहोंने फिल्\u200Dमों को ही अपने लिए उचित समझा। \n" +
                    "\n" +
                    "- जब उनकी कंपनी एबीसीएल आर्थिक संकट से जूझ रही थी तब उनके मित्र और राजनी\u200Dतिज्ञ अमर सिंह ने उनकी काफी मदद की थी। बाद में अमिताभ ने भी अमर सिंह की समाजवादी पार्टी को काफी सहयोग किया। उनकी पत्\u200Dनी जया बच्\u200Dचन ने समाजवादी पार्टी को ज्\u200Dवाइन कर लिया और वे राज्\u200Dयसभा की सदस्\u200Dय बन गईं। अमिताभ ने पार्टी के लिए कई विज्ञापन और राजनीतिक अभियान भी किए। \n" +
                    "\n" +
                    "- फिल्\u200Dमेां से एक बार फिर उन्\u200Dहोंने वापसी की और फिल्\u200Dम 'शहंशाह' हिट हुई। इसके बाद उनके अग्निपथ में निभाए गए अभिनय को भी काफी सराहा गया और इसके लिए उन्\u200Dहें राष्\u200Dट्रीय फिल्\u200Dम पुरस्\u200Dकार भी मिला लेकिन उस दौरान बाकी कई फिल्\u200Dमें कोई खास कमाल नहीं दिखा स\u200Dकीं।\n" +
                    "\n" +
                    "फिल्\u200Dमों में तगड़ी वापसी\n" +
                    "- 2000 में आई मोहब्\u200Dबतें उनके डूबते करियर को बचाने में काफी मददगार साबित हुई और फिल्\u200Dम को और उनके अभिनय को काफी सराहा गया। इसके बाद उन्\u200Dहोंने कई फिल्\u200Dमों में काम किया जिसे आलोचकों के साथ साथ दर्शकों ने भी काफी पसंद किया।\n" +
                    "\n" +
                    "- 2005 में आई फिल्\u200Dम 'ब्\u200Dलैक' में उन्\u200Dहोंने शानदार अभिनय किया और उन्\u200Dहें राष्\u200Dट्रीय फिल्\u200Dम पुरस्\u200Dकार से एक बार फिर सम्\u200Dमानित किया गया। \n" +
                    "\n" +
                    "- फिल्\u200Dम पा में उन्\u200Dहोंने अपने बेटे अभिषेक बच्\u200Dचन के ही बेटे का किरदार निभाया। फिल्\u200Dम को काफी पसंद किया गया और एक बार फिर उन्\u200Dहें राष्\u200Dट्रीय फिल्\u200Dम पुरस्\u200Dकार से नवाजा गया। \n" +
                    "\n" +
                    "- वे काफी लंबे समय से गुजरात पर्यटन के ब्रांड एंबेसडर भी हैं। \n" +
                    "\n" +
                    "- उन्\u200Dहोंने टीवी की दुनिया में भी बुलंदियों के झंडे गाड़े हैं और उनके द्वारा होस्\u200Dट किया गया केबीसी बहुत पापुलर हुआ। इसने टीआरपी के सारे रिकार्ड तोड़ दिए और इस प्रोग्राम के जरिए कई लोग करोड़पति बने।\n" +
                    "\n" +
                    "सामाजिक कार्यों में आगे\n" +
                    "- इन सबके इतर अमिताभ बच्\u200Dचन लोगों की मदद के लिए भी हमेशा आगे खड़े रहते हैं। वे सामाजिक कार्यों में काफी आगे रहते हैं। कर्ज में डूबे आंध्रप्रदेश के 40 किसानों को अमिताभ ने 11 लाख रूपए की मदद की। ऐसे ही विदर्भ के किसानों की भी उन्\u200Dहोंने 30 लाख रूपए की मदद की। इसके अलावा और भी कई ऐसे मौके रहे हैं जिसमें अमिताभ ने दरियादिली दिखाई है और लोगों की मदद की है। \n" +
                    "\n" +
                    "- जून 2000 में वे पहले ऐसे एशिया के व्\u200Dयक्ति थे जिनकी लंदन के मैडम तुसाद संग्रहालय में वैक्\u200Dस की मूर्ति स्\u200Dथापित गई थी। \n" +
                    "\n" +
                    "उनके ऊपर कई किताबें भी लिखी जा चुकी हैं- \n" +
                    "अमिताभ बच्\u200Dचन: द लिजेंड 1999 में, टू बी ऑर नॉट टू बी: अमिताभ बच्\u200Dचन 2004 में, एबी: द लिजेंड (ए फोटोग्राफर्स ट्रिब्\u200Dयूट) 2006 में, अमिताभ बच्\u200Dचन: एक जीवित किंवदंती 2006 में, अमिताभ: द मेकिंग ऑफ ए सुपरस्\u200Dटार 2006 में, लुकिंग फॉर द बिग बी: बॉलीवुड, बच्\u200Dचन एंड मी 2007 में और बच्\u200Dचनालिया 2009 में प्रकाशित हुई हैं। \n" +
                    "\n" +
                    "- वे शुद्ध शाकाहारी हैं और 2012 में 'पेटा' इंडिया द्वारा उन्\u200Dहें 'हॉटेस्\u200Dट वेजिटेरियन' करार दिया गया। पेटा एशिया द्वारा कराए गए एक कांटेस्\u200Dट पोल में एशिया के सेक्सियस्\u200Dट वेजिटेरियन का टाईटल भी उन्\u200Dहोंने जीता। \n" +
                    "\n" +
                    "टेक्\u200Dनोलॉजी के दौर में भी सबसे एक्टिव बच्\u200Dचन\n" +
                    "आज का दौर सोशल मीडिया का है। खबरें पल पल में इंटरनेट पर अपलोड होती रहती हैं। ऐसे में हमारे बिगबी कहां पीछे रहने वाले हैं। वे भी फेसबुक, ट्विटर का जमकर इस्\u200Dतेमाल करते हैं और यही कारण है कि दोनों सोशल नेटवर्किंग साइट्स पर उनके फैंस की संख्\u200Dया लाखों-करोड़ों में है। वे अपने प्रंशसको को कभी नहीं निराश करते हैं और पल पल की घटनाओं को वे इन माध्\u200Dयमों के जरिए शेयर करते हैं।",
            " श्रीनिवास रामानुजन् इयंगर एक महान भारतीय गणितज्ञ थे. उन्हें आधुनिक काल के महानतम गणित विचारकों में गिना जाता है. उन्हें गणित में कोई विशेष प्रशिक्षण नहीं मिला, फिर भी उन्होंने विश्लेषण एवं संख्या सिद्धांत के क्षेत्रों में महत्वपूर्ण योगदान दिये. उन्होंने गणित के क्षेत्र में कई महत्वपूर्ण प्रयोग किये थे जो आज भी उपयोग किये जाते है. उनके प्रयोगों को उस समय जल्द ही भारतीय गणितज्ञो ने मान्यता दे दी थी. जब उनका हुनर ज्यादातर गणितज्ञो के समुदाय को दिखाई देने लगा, तब उन्होंने इंग्लिश गणितज्ञ जी.एच्. हार्डी से भागीदारी कर ली. उन्होंने पुराने प्रचलित थ्योरम की पुनः खोज की ताकि उसमे कुछ बदलाव करके नया थ्योरम बना सके.\n" +
                    "\n" +
                    "आरम्भिक जीवन :\n" +
                    "\n" +
                    "        11 वर्ष की आयु से ही श्रीनिवास रामानुजन अपने ही घर पर किराये से रह रहे दो विद्यार्थियो से गणित का अभ्यास करना शुरू कीया था. बाद में उन्होंने एस.एल. लोनी द्वारा लिखित एडवांस ट्रिग्नोमेट्री का अभ्यास कीया. 13 साल की अल्पायु में ही वे उस किताब के मास्टर बन चुके थे और उन्होंने खुद कई सारे थ्योरम की खोज की. 14 वर्ष की आयु में उन्हें अपने योगदान के लिये मेरिट सर्टिफिकेट भी दिया गया और साथ ही अपनी स्कूल शिक्षा पुरी करने के लिए कई सारे अकादमिक पुरस्कार भी दिए गए और सांभर तंत्र की स्कूल में उन्हें 1200 विद्यार्थी और 35 शिक्षको के साथ प्रवेश दिया गया.\n" +
                    "\n" +
                    "        ये बचपन से ही विलक्षण प्रतिभावान थे। इन्होंने खुद से गणित सीखा और अपने जीवनभर में गणित के 3,884 प्रमेयों का संकलन किया। इनमें से अधिकांश प्रमेय सही सिद्ध किये जा चुके हैं। इन्होंने गणित के सहज ज्ञान और बीजगणित प्रकलन की अद्वितीय प्रतिभा के बल पर बहुत से मौलिक और अपारम्परिक परिणाम निकाले जिनसे प्रेरित शोध आज तक हो रहा है, यद्यपि इनकी कुछ खोजों को गणित मुख्यधारा में अब तक नहीं अपनाया गया है। हाल में इनके सूत्रों को क्रिस्टल-विज्ञान में प्रयुक्त किया गया है। इनके कार्य से प्रभावित गणित के क्षेत्रों में हो रहे काम के लिये रामानुजन जर्नल की स्थापना की गई है।\n" +
                    "\n" +
                    "        एक बार जब वह तीसरी कक्षा के विद्यार्थी थे तब उसके अध्यापक उसे बता रहे थे कि किसी भी नम्बर को उसी नम्बर से भाग दिया जाए तो एक मिलेगा। उदाहरण के तौर पर उन्होंने बताया, कि यदि तीन आम को तीन लोगों में बाँटा जाए तो प्रत्येक को एक आम मिलेगा। इस पर रामानुजन ने उससे पूछा, 'क्या शून्य को शून्य से भाग देने पर भी एक मिलेगा? यदि शून्य आम, शून्य लोगों को बांटे जांय तो क्या प्रत्येक को एक आम मिलेगा?'\n" +
                    "\n" +
                    "        सच तो यह है कि वह प्रति भूत निर्धारित (Indeterminate) के बारे में बात कर रहे थे जो कि इण्टर की कक्षा में पढ़ाया जाने वाला विषय था। रामानुजन उच्च शिक्षा से वंचित रह गये थे। इसलिए उन्होंने बहुत से गणित के प्रमेय स्वयं सिद्ध किये जो कि बहुत पहले सिद्ध किये जा चुके थे।\n" +
                    "\n" +
                    "        कुछ व्यक्तिगत कारणों और धन की कमी के कारण रामानुजन ने प्रोफेसर हार्डी के कैंब्रिज के आमंत्रण को अस्वीकार कर दिया। प्रोफेसर हार्डी को इससे निराशा हुई लेकिन उन्होनें किसी भी तरह से रामानुजन को वहां बुलाने का निश्चय किया। इसी समय रामानुजन को मद्रास विश्वविद्यालय में शोध वृत्ति मिल गई थी जिससे उनका जीवन कुछ सरल हो गया और उनको शोधकार्य के लिए पूरा समय भी मिलने लगा था।\n" +
                    "\n" +
                    "        इसी बीच एक लंबे पत्रव्यवहार के बाद धीरे-धीरे प्रोफेसर हार्डी ने रामानुजन को कैंब्रिज आने के लिए सहमत कर लिया। प्रोफेसर हार्डी के प्रयासों से रामानुजन को कैंब्रिज जाने के लिए आर्थिक सहायता भी मिल गई। रामानुजन ने इंग्लैण्ड जाने के पहले गणित के करीब 3000 से भी अधिक नये सूत्रों को अपनी नोटबुक में लिखा था।\n" +
                    "\n" +
                    "        बचपन में उनके जीवन की एक घटना है जिससे पता चलता है कि उन्होंने गणित में बचपन से ही रूचि दिखाना शुरू कर दिया था | एक दिन जब वो तीसरी कक्षा में थे तब कक्षा में शिक्षक ने ब्लेकबोर्ड पर तीन आम के चित्र अंकित किये और सभी छात्रों से प्रश्न किया कि यदि हमारे पास तीन आम हो और तीन छात्र हो ,तो प्रत्येक छात्र के हिस्से में कितने आम आयेंगे ? आगे की पंक्तियों में बैठे छात्रों ने उसी समय उत्तर दिया कि प्रत्येक छात्र को एक एक आम मिलेगा | इसके बाद शिक्षक के भाग सिखाने पर जोर दिया तभी बालक श्रीनिवास रामानुजन ने प्रश्न किया कि “सर यदि कोई भी आम किसी को ना बांटा जाए तो क्या तब भी प्रत्येक छात्र को एक आम मिल सकेगा ?”\n" +
                    "\n" +
                    "संघर्षमय जीवन :\n" +
                    "\n" +
                    "        जब रामानुजन का पढाई से पूरी तरह नाता टूट जाने के बाद आने वाले पाच साल इनके जीवन के लिए बहुत ही संघर्षमय था इस समय हमारा देश भारत अंग्रेजो के अधीनता में था चारो तरफ परतंत्रता की बेडियो में जकड़े भारत में कही भी न रोजगार के अवसर थे और न ही लोगो के जीवन जीने के लिए कोई उद्देश्य था हर कोई बस अपने देश भारत को आजाद देखना चाहता था ऐसे में रामानुजन के पास भी न कोई नौकरी थी और न ही नौकरी पाने के लिए कोई बड़ी डिग्री जिसकी चिंता से रामानुजन का स्वास्थ्य दिन पर दिन बिगड़ता जा रहा था जिसके चलते डाक्टरों ने इन्हें घर जाकर आराम करने का सलाह दिए ऐसे में रामानुजन का गणित के प्रति प्रेम ही उन्हें अपने जीवन में आगे बढने की प्रेरणा दिया।\n" +
                    "\n" +
                    "        इसके बाद नौकरी की तलाश में कही जाते अपने साथ अपने गणित के सारे किये हुए कार्य जो की रजिस्टर में होते थे दिखाते थे और फिर नौकरी की तलाश में इनकी मुलाकात डिप्टी कलेक्टर श्री वी. रामास्वामी अय्यर से हुआ जो की वे भी गणित के बहुत ही बड़े विद्वान् थे जो की रामानुजन की प्रतिभा को पहचान गये और फिर रामास्वामी अय्यर ने रामानुजन के लिए 25 रूपये की मासिक तनख्वाह के रूप में इन्हें छात्रवृत्ति की व्यवस्था किया जहा पर रामानुजन ने अपने प्रथम शोधपत्र  “बरनौली संख्याओं के कुछ गुण”  शोध पत्र जर्नल ऑफ इंडियन मैथेमेटिकल सोसाइटी में प्रकाशित हुआ था और फिर सौभाग्य से एक साल पूरा होते ही रामानुजन को मद्रास पोर्ट ट्रस्ट में इन्हें लेखाबही के हिसाब रखने के लिए क्लर्क की नौकरी मिल गयी और फिर से रामानुजन अपने गणित के प्रति प्रेम के लिए समय मिलने लगा और फिर इस प्रकार रामानुजन ने अनेक नये नये गणित के सूत्रों को लिखना प्रारम्भ शुरू किया\n" +
                    "\n" +
                    "प्रोफेसर हार्डी के साथ पत्रव्यावहार और विदेश गमन :\n" +
                    "\n" +
                    "        रामानुजन का शोध धीरे-धीरे आगे बढ़ रहा था पर अब स्थिति ऐसी थी कि बिना किसी अंग्रेज गणितज्ञ की सहायता के शोध कार्य को आगे नहीं बढ़ाया जा सकता था। रामानुजन ने कुछ शुभचिंतकों और मित्रों की सहायता से अपने कार्यों को लंदन के प्रसिद्ध गणितज्ञों के पास भेजा पर इससे कुछ विशेष सहायता नहीं मिली। इसके बाद जब रामानुजन ने अपने संख्या सिद्धांत के कुछ सूत्र प्रोफेसर शेषू अय्यर को दिखाए तो उन्होंने उनको समय के प्रसिद्ध गणितग्य प्रोफेसर हार्डी के पास भेजने का सुझाव दिया।\n" +
                    "\n" +
                    "        सन् 1913 में रामानुजन ने हार्डी को पत्र लिखा और स्वयं के द्वारा खोजी प्रमेयों की एक लम्बी सूची भी भेजी। पहले प्रो हार्डी को भी पूरा समझ में नहीं आया फिर उन्होंने अपने शिष्यों और कुछ गणितज्ञों से सलाह ली तो वे इस नतीजे पर पहुंचे कि रामानुजन गणित के क्षेत्र में एक दुर्लभ व्यक्तित्व है। एक दिन उनके कार्यालय के अधिकारी ने उन्हें देख लिया. पूछताछ करने पर पता चला की रामानुजन गणित के कुछ सूत्र लिख रहे है. उनकी मेज की दराज खोलने पर ऐसे तमाम पन्ने मिले जो गणित के सूत्रों से भरे पड़े थे।\n" +
                    "\n" +
                    "        अधिकारी ने उन सूत्रों को पढ़कर स्वयं को धिक्कारा ” क्या यह प्रतिभाशाली युवक क्लर्क की कुर्सी पर बैठने लायक है” ? उसने रामानुजन के उन पन्नो को इंग्लैंड के महान गणितज्ञ प्रोफ़ेसर जी. एच. हार्डी के पास भेज दिया. प्रो. हार्डी उन पन्नो को देखकर अत्यंत प्रभावित हुए और इस नतीजे पर पहुंचे की रामानुजन जैसी प्रतिभा को अँधेरे से बाहर निकालना ही चाहिए. उन्होंने प्रयास करके रामानुजन को इंग्लैंड बुलाया और बड़े-बड़े गणितज्ञो से उनका परिचय कराया।\n" +
                    "\n" +
                    "मृत्यु :\n" +
                    "\n" +
                    "        रामानुजन की गणितीय प्रतिभा का अंदाजा इसी बात से लगाया जा सकता है कि उनके निधन के लगभग 90 वर्ष व्यतीत होने जाने के बाद भी उनकी बहुत सी प्रमेय अनसुलझी बनी हुई हैं। उनकी इस विलक्षण प्रतिभा के प्रति सम्मान प्रकट करते हुए भारत सरकार ने उनकी 125वीं जयंती के उपलक्ष्य में वर्ष 2012 को ‘राष्ट्रीय गणित वर्ष’ के रूप में मनाने का निष्चय किया। इसके अतिरिक्त प्रत्येक वर्ष उनका जन्म दिवस (22 दिसम्बर) ‘राष्ट्रीय गणित दिवस’ के रूप में भी मनाया जाएगा।\n" +
                    "\n" +
                    "        एक तो रामानुजन का दुबला-पतला शरीर, दूसरे London का बेहद ठण्डा मौसम, उस पर खानपान की उचित व्यवस्था का अभाव। ऐसे में रामानुजन को T.B. ने घेर लिया। उस समय तक T.B. का कारगर इलाज उपलब्ध नहीं था। सिर्फ आराम और समुचित डॉक्टरी देखरेख ही उन्हें बचा सकती थी। लेकिन रामानुजन की गणित की दीवानगी ने उन्हें चैन से नहीं बैठने दिया।\n" +
                    "\n" +
                    "        भारत लौटने पर भी इनके स्वास्थ्य में सुधार नहीं हुआ और उनकी हालत गंभीर होती जा रही थी। धीरे-धीरे डॉक्टरों ने भी जवाब दे दिया। उनका अंतिम समय नजदीक आ गया था। अपनी बीमारी से लड़ते-लड़ते अंततः 26 अप्रैल 1920 को उन्होने प्राण त्याग दिए। मृत्यु के समय उनकी आयु मात्र 33 वर्ष थी। इस महान गणितग्य का निधन गणित जगत के लिए अपूरणीय क्षति था।",
            "स्टीवन पॉल जॉब्स एक अमेरिकी उद्योगपति है। ज्यादातर वे एप्पल इनकारपोरेशन के सह-संस्थापक, अध्यक्ष और चीफ एग्जीक्यूटिव ऑफिसर (सीईओ) के कारण जाने जाते है। उनके पास पिक्सर एनीमेशन स्टूडियो के सर्वाधिक शेयर है, साथ ही वे द वाल्ट डिज्नी कंपनी के बोर्ड ऑफ़ डायरेक्टर भी है, पिक्सर एनीमेशन उनकी अपनी संपत्ति में ही शामिल है।\n" +
                    "\n" +
                    "वे पिक्सर के संस्थापक, सभापति, और साथ ही नेक्स्ट इनकारपोरेशन के सीईओ भी है। जॉब्स 1970 में हुई माइक्रो कंप्यूटर की क्रांति के जनक कहलाते है। उन्होंने अपने सहकर्मी स्टीव वोज्निक के साथ मिलकर एप्पल की स्थापना की।\n" +
                    "\n" +
                    "उनकी मृत्यु के कुछ समय बाद ही उनके कार्यकालिन जीवनी लेखक वाल्टर इसाकसन, ने उनके बारे में बताया की वे, “एक क्रिएटिव उद्योगपति थे जिनका परफेक्शन के प्रति जूनून और 6 व्यवसायों के तीव्र विकास: पर्सनल कंप्यूटर, एनिमेटेड मूवी, म्यूजिक, फ़ोन, टेबलेट कंप्यूटिंग और डिजिटल पब्लिशिंग सतत चलता रहा।”\n" +
                    "\n" +
                    "सन 1976 में स्टीव वोजनियाक ने मेकिनटोश एप्पल 1 कंप्यूटर k आविष्कार किया। जब वोजनियाक ने यह जॉब्स को दिखाया तो जॉब्स ने इसे बेचने का सुझाव दिया। इसे बेचने के लिए वे और वोजनियाक गेरेज में एप्पल कंप्यूटर का निर्माण करने लगे। जॉब्स 1976 में एप्पल के सह-संस्थापक बने और एप्पल के पर्सनल कंप्यूटर बेचने लगे।\n" +
                    "\n" +
                    "एप्पल तेज़ी से आगे बढती गयी और पैसे कमाती गयी और पहले साल के अंत में ही पर्सनल कंप्यूटर बनाने वाली दूसरी कंपनी बन गयी। एप्पल इतनी बड़ी मात्र में पर्सनल कंप्यूटर का उत्पादन करने वाली पहले सबसे बड़ी कंपनी बनी। 1979 में, Xerox PARC के टूर के बाद, जॉब्स ने Xerox Alto की व्यावहारिक जरूरतों को जान, उसे परखा, जिसने बाद में माउस का निर्माण किया और साथ ही ग्राफिकल यूजर इंटरफ़ेस (GUI) का भी निर्माण किया।\n" +
                    "\n" +
                    "दुनिया में हो रहे विविध क्षेत्रो में विकास की बदौलत 1983 में एप्पल लिसा में असफल हुई। और GUI के साथ कंप्यूटर का उत्पादन करने वाली पहली कंपनी बनने की चाह से 1985 में एप्पल लेसनर प्रिंटर प्रस्तुत किया। वोज और जॉब्स आगे बढ़ते गये और एप्पल I के बाद एप्पल II प्रस्तुत किया।\n" +
                    "\n" +
                    "जिसमे अतिरिक्त रंग को सपोर्ट करने वाला सिस्टम था। जॉब्स ने अपने कंपनी के विकास को तेज़ करने के लिए एक निवेशक को मना लिया, और उनकी कंपनी तेज़ी से आगे बढ़ने लगी। एप्पल का सुनहरा पल चालू हो गया था। साथ ही वे एनीमेशन मूवी का निर्माण भी करते चले गये। 1995 में आयी फिल्म टॉय स्टोरी में उन्होंने बतौर कार्यकर्त्ता और निर्माता काम किया।\n" +
                    "\n" +
                    "1997 में, एप्पल ने NeXT को खरीद लिया, ताकि वे देश में रोजगार की निर्मिती कर सके, और इसी वजह से वे NeXT के पुनः सीईओ बने. 1997 में शुरू में उन्होंने एक नयी सोच के साथ कंप्यूटर का उत्पादन करना शुरू किया जिसे “Think Different” का नाम दिया गया। बाद में उन्होंने एप्पल के कई प्रोडक्ट्स जैसे iMac, iTunes, Apple Stores, iPod, iTunes Store iPhone, App Store और iPad का निर्माण किया।\n" +
                    "\n" +
                    "जॉब्स 1997 में कंपनी में बतौर सीईओ काम कर रहे थे, तभी 1998 में iMac बाज़ार में आया जो बड़ा ही अल्पपारदर्शी खोल वाला PC था, उनके नेतृत्व में एप्पल ने बड़ी सफलता प्राप्त की। सन 2001 में एप्पल ने iPod का निर्माण किया। फिर सन 2001 में iTunes Store का निर्माण किया। सन 2007 में एप्पल ने iPhone नामक मोबाइल फ़ोन बनाये जो बड़े ही सफल रहे, और आज भी iPhone को सबसे बड़ा ब्रांड कहा जाता है।\n" +
                    "\n" +
                    "Steve Jobs Death :\n" +
                    "सन 2003 में उन्हें पैनक्रियाटिक कैंसर की बीमारी हुई। उन्होंने इस बीमारी का इलाज ठीक से नहीं करवाया। जॉब्स का 5 अक्टूबर 2011 को पालो आल्टो, कैलिफ़ोर्निया के घर में निधन हो गया। उनके निधन पर माइक्रोसॉफ्ट और डिज्नी जैसी बड़ी-बड़ी कंपनियों ने शोक मनाया। एक अमेरिकी पत्रिका में उन्हें, “उद्योग जगत का सबसे शक्तिशाली पुरुष” कहा गया था।\n" +
                    "\n" +
                    "कंप्यूटर, लैपटॉप और मोबाइल फ़ोन बनाने वाली कंपनी एप्पल के भूतपूर्व सीईओ और जाने-माने अमेरिकी उद्योगपति स्टीव जॉब्स ने संघर्ष करके जीवन में यह मुकाम हासिल किया।\n" +
                    "\n" +
                    "Steve Jobs Say’s : Stay Hungry Stay Foolish\n" +
                    "\n" +
                    "“Think Different” यह स्टीव का मूल मन्त्र था। कितना छोटा सा शब्द लेकिन कितनी गहराई से लदे हुए इसी शब्द के भरोसे उन्होंने उद्योगों को बदला, बिज़नस मॉडल को नयी परिभाषा दी। उनका हमेशा से यह मानना था की जीवन में यदि हमें सफल होना है तो किसी का भी इंतज़ार किये बिना ही अकेले चलना सीखना होगा।\n",
            "सचिन तेंदुलकर का जन्म 24 अप्रैल 1973 को दादर, मुंबई के निर्मल नर्सिंग होम में हुआ था। सचिन तेंदुलकर के पिता रमेश तेंदुलकर महाराष्ट्र के सबसे प्रसिद्ध उपन्यासकार थे और उनकी माँ रजनी एक बीमा एजेंट थीं। उनके पिता ने सचिन देव बर्मन के नाम पर उनका नाम सचिन रखा था, जोकि उनके पसंदीदा संगीत निर्देशक थे। सचिन अपने 4 भाई व बहन में सबसे छोटे हैं, उनके बड़े भाई नितिन व अजीत और उसके बाद उनकी बहन सविता हैं।\n" +
                    "\n" +
                    "बचपन\n" +
                    "\n" +
                    "सचिन ने अपने बचपन के कुछ साल बांदा ईस्ट के साहित्य सहवास सहकारी आवास सोसायटी में व्यतीत किए। सचिन वर्तमान की तुलना में अपने बचपन में बिल्कुल विपरीत थे, क्योंकि उन्हे स्कूल में लड़ाई करना या स्कूल में पहली बार आने वाले बच्चों का धमकाना पसंद था।\n" +
                    "\n" +
                    "अपनी किशोरावस्था में सचिन जॉन मैकनेरो, जो अमेरिका के प्रमुख टेनिस खिलाड़ियों में से एक हैं, के बहुत बड़े प्रशंसक थे। अजीत ने सचिन के शरारती स्वभाव को बड़ी मुश्किल से छुड़ाया और उन्हें वर्ष 1984 में क्रिकेट के प्रति दिलचस्पी दिखाने पर जोर दिया। उन्होंने सचिन की रमाकांत आचरेकर से भेंट करवाई, जो अपने समय के सबसे प्रसिद्ध क्लब क्रिकेटर के साथ-साथ एक बेहतरीन कोच भी थे। रमाकांत आचरेकर दादर के शिवाजी पार्क में क्रिकेट का अभ्यास करवाते थे।\n" +
                    "\n" +
                    "आचरेकर ने सचिन की प्रतिभा को देखा, जो उन्हें काफी पसंद आयी, उसके बाद उन्होंने सचिन से शारदाश्रम विद्यामंदिर (इंग्लिस) माध्यमिक स्कूल को छोड़कर, अपने स्कूल में प्रवेश लेने के लिए कहा, जो दादर में ही स्थित था। यह स्कूल स्थानीय क्रिकेट मंडली में शीर्ष पर था और उस समय, यहाँ से कई प्रसिद्ध क्रिकेटर उभरकर सामने आए थे। इससे पहले, सचिन ने बांद्रा ईस्ट के भारतीय एजुकेशन सोसाइटी के न्यू इंग्लिश स्कूल में अध्ययन किया था।\n" +
                    "\n" +
                    "क्रिकेट की यात्रा का शुभारंभ\n" +
                    "\n" +
                    "आचरेकर ने सचिन को सुबह स्कूल से पहले और शाम को स्कूल के बाद अभ्यास कराना शुरू किया। तेंदुलकर चार घंटों तक अभ्यास करते थे और जब भी वे थक जाते थे, तो आचरेकर सचिन को प्रलोभित करने के लिए स्टंप के शीर्ष पर एक रुपए का सिक्का रख देते थे। रुपया रखने के बाद आचरेकर कहते कि अगर वह उनको आउट न कर पाएं, तो वह सिक्का उनका हो जाएगा और इस तरह सचिन ने उनसे 13 सिक्के जीते, जिसे आज भी सचिन अपनी सबसे अमूल्य संपत्ति मानते हैं। अभ्यास को ज्यादा समय देने के लिए सचिन ने अपने चाचा और चाची के साथ रहने का फैसला किया, जो शिवाजी पार्क के निकट रहते थे।\n" +
                    "\n" +
                    "सचिन के बचपन की महानता\n" +
                    "\n" +
                    "सचिन को स्कूल में एक महान बच्चा माना जाता था और वह मुंबई के क्रिकेट मंडलियों में एक आम चर्चा का विषय बन गए थे। वह अपनी स्कूल की माटुंगा गुजराती सेवा मंडल शील्ड के नाम से जानी जाने वाली टीम के सबसे प्रतिभाशाली खिलाड़ियों में से एक थे। सचिन स्कूल क्रिकेट के साथ-साथ क्लब क्रिकेट में अपनी एक अलग छाप छोड़ने में सफल हुए और साथ ही उन्होंने प्रतिष्ठित कांगा लीग में भी प्रदर्शन किया। सचिन का पहला क्लब, जॉन ब्राइट क्रिकेट क्लब था, जो बाद में क्रिकेट क्लब ऑफ इंडिया (सीसीआई) में तब्दील हो गया।\n" +
                    "\n" +
                    "सचिन ने 14 वर्ष की आयु में मद्रास के एमआरएफ पैस फाउंडेशन में भाग लिया था, ताकि वह तेज गेंदबाज बनने का अभ्यास कर सकें। हालाँकि, डेनिस लिली जो कार्यवाही का नेतृत्व कर रही थी, वह युवा बच्चे की गेंदबाजी से प्रभावित नहीं हुईं और उन्होंने सचिन से कहा कि वह अपनी बल्लेबाजी पर ध्यान केंद्रित करें। इस समय सचिन मुंबई क्रिकेट एसोसिएशन के सर्वश्रेष्ठ ज्यूनियर क्रिकेटर अवॉर्ड को जीतने में सक्षम नहीं थे, इसलिए वह परेशान थे, लेकिन उन्हें श्री सुनील गावस्कर के अल्ट्रा लाइट पैड की एक जोड़ी मिली, जिसमें लिखा था कि वह स्वयं भी इस उम्र में यह अवार्ड नहीं जीत पाए थे। युवा प्रतिभा को प्राप्त करने के प्रयास में उन्होंने यह भी कहा कि एक क्रिकेटर के रूप में खुद काफी बेहतर साबित किया है। सचिन ने गावस्कर के 34 वें टेस्ट शतक का रिकार्ड तोड़ने के बाद कहा कि उस समय के उनके वह शब्द मेरे लिए संभवतः सबसे बड़े प्रोत्साहन के रूप में साबित हुए हैं।\n" +
                    "\n" +
                    "अंतर्राष्ट्रीय क्रिकेट का पहला अनुभव\n" +
                    "\n" +
                    "सचिन को अंतर्राष्ट्रीय क्रिकेट का पहला अनुभव तब प्राप्त हुआ, जब वह एक प्रदर्शनी खेल में इमरान खान की टीम के एक विकल्प के रूप में दिखाई दिए, क्योंकि यह सीसीआई की स्वर्ण जयंती समारोह के रूप में मुंबई में ब्रेबोर्न स्टेडियम में आयोजित की गई थी और सचिन इस जगह अभ्यास भी करते थे। जब वर्ष 1987 में मुंबई में भारत और इंग्लैंड के बीच विश्वकप का सेमीफाइनल मैच खेला गया, तो उसमें सचिन ने गेंदबाज की भूमिका निभाई थी।\n" +
                    "\n" +
                    "उनकी प्रतिभा की पहली झलक\n" +
                    "\n" +
                    "वर्ष 1988 सचिन के लिए एक असाधारण सत्र रहा, क्योंकि इसमें होने वाले प्रत्येक मैच में उन्होंने शतक लगाया था। सचिन के पूर्व मित्र और टीम इंडिया के सहयोगी विनोद कांबली के साथ मिलकर लॉर्ड्स हैरिस शील्ड इंटरस्कूल प्रतियोगिता में सेंट जेवियर्स के हाई स्कूल के खिलाफ 664 रन की नाबाद भागेदारी की थी। उस मैच में तेंदुलकर ने 326 रन बनाए थे और उस टूर्नामेंट में 1000 से ज्यादा रन बनाए थे। सचिन का प्रभुत्व ऐसा था कि विपक्षी उनके साथ मैच खेलने से कतराते थे और एक गेंदबाज के लिए वह समय वास्तव में काफी दर्दनाक होता था। उन दोनो लोगों की साझेदारी वर्ष 2006 तक अटूट रही, जब हैदराबाद में आयोजित मैच में कुछ अंडर-13 के बल्लेबाजों ने भाग लिया था।\n" +
                    "\n" +
                    "उनका कहना है कि हर सुबह एक नए दिन का वर्णन करती है और यह सचिन के लिए बिल्कुल सही था। परिश्रमी और कड़ी मेहनत के साथ-साथ अदम्य प्राकृतिक प्रतिभा और रनों के भूखे युवा मुम्बईकर (सचिन) ने काफी बेहतरीन प्रदर्शन किया, क्योंकि वह 16 साल की उम्र में ही पाकिस्तान के विरुद्ध होने वाले मैच में चयनित किए गए थे और पाकिस्तान मजबूत तेज गेंदबाजी के आक्रमण के कारण, उस समय की सबसे खतरनाक टीमों में से एक थी। सचिन ने उस दौरे के बाकी खिलाड़ियों से अलग पहचान बना ली थी।",
            "जन्म: 20 नवम्बर 1929, गोविन्दपुरा (पाकिस्तान)\n" +
                    "\n" +
                    "कार्य क्षेत्र: पूर्व 400 मीटर धावक\n" +
                    "\n" +
                    "उपलब्धियां: 1958 के एशियाई खेलों में 200 मी व 400 मी में स्वर्ण पदक, 1958 के कॉमनवेल्थ खेलों में स्वर्ण पदक, 1962 के एशियाई खेलों में स्वर्ण पदक\n" +
                    "\n" +
                    "मिलखा सिंह आज तक भारत के सबसे प्रसिद्ध और सम्मानित धावक हैं। इन्होने रोम के 1960 ग्रीष्म ओलंपिक और टोक्यो के 1964 ग्रीष्म ओलंपिक में देश का प्रतिनिधित्व किया था। उनको “उड़न सिख” का उपनाम दिया गया था। 1960 के रोम ओलंपिक खेलों में उन्होंने पूर्व ओलंपिक कीर्तिमान को ध्वस्त किया लेकिन पदक से वंचित रह गए। इस दौड़ के दौरान उन्होंने ऐसा राष्ट्रिय कीर्तिमान स्थापित किया जो लगभग 40 साल बाद जाकर टूटा।\n" +
                    "\n" +
                    "प्रारंभिक जीवन\n" +
                    "\n" +
                    "मिल्खा सिंह का जन्म अविभाजित भारत के पंजाब में एक सिख राठौर परिवार में 20 नवम्बर 1929 को हुआ था। अपने माँ-बाप की कुल 15 संतानों में वह एक थे। उनके कई भाई-बहन बाल्यकाल में ही गुजर गए थे। भारत के विभाजन के बाद हुए दंगों में मिलखा सिंह ने अपने माँ-बाप और भाई-बहन खो दिया। अंततः वे शरणार्थी बन के ट्रेन द्वारा पाकिस्तान से दिल्ली आए। दिल्ली में वह अपनी शदी-शुदा बहन के घर पर कुछ दिन रहे। कुछ समय शरणार्थी शिविरों में रहने के बाद वह दिल्ली के शाहदरा इलाके में एक पुनर्स्थापित बस्ती में भी रहे।\n" +
                    "\n" +
                    "ऐसे भयानक हादसे के बाद उनके ह्रदय पर गहरा आघात लगा था। अपने भाई मलखान के कहने पर उन्होंने सेना में भर्ती होने का निर्णय लिया और चौथी कोशिश के बाद सन 1951 में सेना में भर्ती हो गए। बचपन में वह घर से स्कूल और स्कूल से घर की 10 किलोमीटर की दूरी दौड़ कर पूरी करते थे और भर्ती के वक़्त क्रॉस-कंट्री रेस में छठे स्थान पर आये थे इसलिए सेना ने उन्हें खेलकूद में स्पेशल ट्रेनिंग के लिए चुना था।\n" +
                    "\n" +
                    "धावक के तौर पर करियर\n" +
                    "\n" +
                    "सेना में उन्होंने कड़ी मेहनत की और 200 मी और 400 मी में अपने आप को स्थापित किया और कई प्रतियोगिताओं में सफलता हांसिल की। उन्होंने सन 1956 के मेर्लबोन्न ओलिंपिक खेलों में 200 और 400 मीटर में भारत का प्रतिनिधित्व किया पर अंतर्राष्ट्रीय स्तर पर अनुभव न होने के कारण सफल नहीं हो पाए लेकिन 400 मीटर प्रतियोगिता के विजेता चार्ल्स जेंकिंस के साथ हुई मुलाकात ने उन्हें न सिर्फ प्रेरित किया बल्कि ट्रेनिंग के नए तरीकों से अवगत भी कराया।\n" +
                    "\n" +
                    "इसके बाद सन 1958 में कटक में आयोजित राष्ट्रिय खेलों में उन्होंने 200 मी और 400 मी प्रतियोगिता में राष्ट्रिय कीर्तिमान स्थापित किया और एशियन खेलों में भी इन दोनों प्रतियोगिताओं में स्वर्ण पदक हासिल किया। साल 1958 में उन्हें एक और महत्वपूर्ण सफलता मिली जब उन्होंने ब्रिटिश राष्ट्रमंडल खेलों में 400 मीटर प्रतियोगिता में स्वर्ण पदक हासिल किया। इस प्रकार वह राष्ट्रमंडल खेलों के व्यक्तिगत स्पर्धा में स्वर्ण पदक जीतने वाले स्वतंत्र भारत के पहले खिलाडी बन गए। इसके बाद उन्होंने सन 1960 में पाकिस्तान प्रसिद्ध धावक अब्दुल बासित को पाकिस्तान में पिछाडा जिसके बाद जनरल अयूब खान ने उन्हें ‘उड़न सिख’ कह कर पुकारा।\n" +
                    "\n" +
                    "रोम ओलिंपिक खेल, 1960\n" +
                    "\n" +
                    "रोम ओलिंपिक खेल शुरू होने से कुछ वर्ष पूर्व से ही मिल्खा अपने खेल जीवन के सर्वश्रेष्ठ फॉर्म में थे और ऐसा माना जा रहा था की इन खेलों में मिल्खा पदक जरूर प्राप्त करेंगे। रोम खेलों से कुछ समय पूर्व मिल्खा ने फ्रांस में 45.8 सेकंड्स का कीर्तिमान भी बनाया था। 400 में दौड़ में मिल्खा सिंह ने पूर्व ओलिंपिक रिकॉर्ड तो जरूर तोड़ा पर चौथे स्थान के साथ पदक से वंचित रह गए। 250 मीटर की दूरी तक दौड़ में सबसे आगे रहने वाले मिल्खा ने एक ऐसी भूल कर दी जिसका पछतावा उन्हें आज भी है। उन्हें लगा की वो अपने आप को अंत तक उसी गति पर शायद नहीं रख पाएंगे और पीछे मुड़कर अपने प्रतिद्वंदियों को देखने लगे जिसका खामियाजा उन्हें भुगतना पड़ा और वह धावक जिससे स्वर्ण की आशा थी कांस्य भी नहीं जीत पाया। मिल्खा को आज तक उस बात का मलाल है। इस असफलता से सिंह इतने निराश हुए कि उन्होंने दौड़ से संन्यास लेने का मन बना लिया पर बहुत समझाने के बाद मैदान में फिर वापसी की।\n" +
                    "\n" +
                    "इसके बाद 1962 के जकार्ता में आयोजित एशियन खेलों में मिल्खा ने 400 मीटर और 4 X 400 मीटर रिले दौड़ में स्वर्ण पदक जीता। उन्होंने 1964 के टोक्यो ओलिंपिक खेलों में भाग लिया और उन्हें तीन स्पर्धाओं (400 मीटर, 4 X 100 मीटर रिले और 4 X 400 मीटर रिले) में भाग लेने के लिए चुना गया पर उन्होंने 4 X 400 मीटर रिले में भाग लिया पर यह टीम फाइनल दौड़ के लिए क्वालीफाई भी नहीं कर पायी।\n" +
                    "\n" +
                    "मिल्खा द्वारा रोम ओलिंपिक में स्थापित राष्ट्रिय कीर्तिमान को धावक परमजीत सिंह ने सन 1998 में तोड़ा।\n" +
                    "\n" +
                    "बाद का जीवन\n" +
                    "\n" +
                    "सन 1958 के एशियाई खेलों में सफलता के बाद सेना ने मिल्खा को ‘जूनियर कमीशंड ऑफिसर’ के तौर पर पदोन्नति कर सम्मानित किया और बाद में पंजाब सरकार ने उन्हें राज्य के शिक्षा विभाग में ‘खेल निदेशक’ के पद पर नियुक्त किया। इसी पद पर मिल्खा सन 1998 में सेवानिवृत्त हुए।\n" +
                    "\n" +
                    "वर्ष 1958 में भारत सरकार ने उन्हें पद्मश्री से सम्मानित किया पर मिल्खा ने सन 2001 में भारत सरकार द्वारा ‘अर्जुन पुरस्कार’ के पेशकश को ठुकरा दिया।\n" +
                    "\n" +
                    "मिल्खा सिंह ने अपने जीवन में जीते सारे पदकों को राष्ट्र के नाम कर दिया। शुरू में उन्हें जवाहर लाल नेहरु स्टेडियम में रखा गया था पर बाद में उन्हें पटियाला के एक खेल म्यूजियम में स्थानांतरित कर दिया गया। वर्ष 2012 में उन्होंने रोम ओलिंपिक के 400 मीटर दौड़ में पहने जूते एक चैरिटी की नीलामी में दे दिया।\n" +
                    "\n" +
                    "वर्ष 2013 में मिल्खा ने अपनी बेटी सोनिया संवलका के साथ मिलकर अपनी आत्मकथा ‘The Race of My Life’ लिखी। इसी पुस्तक से प्रेरित होकर हिंदी फिल्मों के मशहूर निर्देशक राकेश ओम प्रकाश मेहरा ने ‘भाग मिल्खा भाग’ नामक फिल्म बनायी। इस फिल्म में मिल्खा का किरदार मशहूर अभिनेता फरहान अख्तर ने निभाया।\n" +
                    "\n" +
                    "निजी जीवन\n" +
                    "\n" +
                    "मिल्खा सिंह ने भारतीय महिला वॉलीबॉल के पूर्व कप्तान निर्मल कौर से सन 1962 में विवाह किया। कौर से उनकी मुलाकात सन 1955 में श्री लंका में हुई थी। इनके तीन बेटियां और एक बेटा है। इनका बेटा जीव मिल्खा सिंह एक मशहूर गोल्फ खिलाडी है। सन 1999 में मिल्खा ने शहीद हवलदार बिक्रम सिंह के सात वर्षीय पुत्र को गोद लिया था। मिल्खा सम्प्रति में चंडीगढ़ शहर में रहते हैं।",
            "जन्म: 26 अगस्त, 1910, स्कॉप्जे, (अब मसेदोनिया में)\n" +
                    "\n" +
                    "मृत्यु: 5 सितंबर, 1997, कलकत्ता, भारत\n" +
                    "\n" +
                    "कार्य: मानवता की सेवा, ‘मिशनरीज ऑफ चैरिटी’ की स्थापना\n" +
                    "\n" +
                    "ऐसा माना जाता है कि दुनिया में लगभग सारे लोग सिर्फ अपने लिए जीते हैं पर मानव इतिहास में ऐसे कई मनुष्यों के उदहारण हैं जिन्होंने अपना तमाम जीवन परोपकार और दूसरों की सेवा में अर्पित कर दिया। मदर टेरेसा भी ऐसे ही महान लोगों में एक हैं जो सिर्फ दूसरों के लिए जीते हैं। मदर टेरेसा ऐसा नाम है जिसका स्मरण होते ही हमारा ह्रदय श्रध्धा से भर उठता है और चेहरे पर एक ख़ास आभा उमड़ जाती है। मदर टेरेसा एक ऐसी महान आत्मा थीं जिनका ह्रदय संसार के तमाम दीन-दरिद्र, बीमार, असहाय और गरीबों के लिए धड़कता था और इसी कारण उन्होंने अपना सम्पूर्ण जीवन उनके सेवा और भलाई में लगा दिया। उनका असली नाम ‘अगनेस गोंझा बोयाजिजू’ (Agnes Gonxha Bojaxhiu ) था। अलबेनियन भाषा में गोंझा का अर्थ फूल की कली होता है। इसमें कोई दो राय नहीं है कि मदर टेरेसा एक ऐसी कली थीं जिन्होंने छोटी सी उम्र में ही गरीबों, दरिद्रों और असहायों की जिन्दगी में प्यार की खुशबू भर दी थी।\n" +
                    "\n" +
                    "प्रारंभिक जीवन\n" +
                    "\n" +
                    "मदर टेरेसा का जन्म 26 अगस्त, 1910 को स्कॉप्जे (अब मसेदोनिया में) में हुआ। उनके पिता निकोला बोयाजू एक साधारण व्यवसायी थे। मदर टेरेसा का वास्तविक नाम ‘अगनेस गोंझा बोयाजिजू’ था। अलबेनियन भाषा में गोंझा का अर्थ फूल की कली होता है। जब वह मात्र आठ साल की थीं तभी उनके पिता परलोक सिधार गए,  जिसके बाद उनके लालन-पालन की सारी जिम्मेदारी उनकी माता द्राना बोयाजू के ऊपर आ गयी। वह पांच भाई-बहनों में सबसे छोटी थीं। उनके जन्म के समय उनकी बड़ी बहन की उम्र 7 साल और भाई की उम्र 2 साल थी, बाकी दो बच्चे बचपन में ही गुजर गए थे। वह एक सुन्दर, अध्ययनशील एवं परिश्रमी लड़की थीं। पढाई के साथ-साथ, गाना उन्हें बेहद पसंद था। वह और उनकी बहन पास के गिरजाघर में मुख्य गायिका थीं। ऐसा माना जाता है की जब वह मात्र बारह साल की थीं तभी उन्हें ये अनुभव हो गया था कि वो अपना सारा जीवन मानव सेवा में लगायेंगी और 18 साल की उम्र में उन्होंने ‘सिस्टर्स ऑफ़ लोरेटो’ में शामिल होने का फैसला ले लिया। तत्पश्चात वह आयरलैंड गयीं जहाँ उन्होंने अंग्रेजी भाषा सीखी। अंग्रेजी सीखना इसलिए जरुरी था क्योंकि ‘लोरेटो’ की सिस्टर्स इसी माध्यम में बच्चों को भारत में पढ़ाती थीं।\n" +
                    "\n" +
                    "भारत आगमन\n" +
                    "\n" +
                    "सिस्टर टेरेसा आयरलैंड से 6 जनवरी, 1929 को कोलकाता में ‘लोरेटो कॉन्वेंट’ पंहुचीं। वह एक अनुशासित शिक्षिका थीं और विद्यार्थी उनसे बहुत स्नेह करते थे। वर्ष 1944 में वह हेडमिस्ट्रेस बन गईं। उनका मन शिक्षण में पूरी तरह रम गया था पर उनके आस-पास फैली गरीबी, दरिद्रता और लाचारी उनके मन को बहुत अशांत करती थी। 1943 के अकाल में शहर में बड़ी संख्या में मौते हुईं और लोग गरीबी से बेहाल हो गए। 1946 के हिन्दू-मुस्लिम दंगों ने तो कोलकाता शहर की स्थिति और भयावह बना दी।\n" +
                    "\n" +
                    "मिशनरीज ऑफ़ चैरिटी\n" +
                    "\n" +
                    "वर्ष 1946 में उन्होंने गरीबों, असहायों, बीमारों और लाचारों की जीवनपर्यांत मदद करने का मन बना लिया। इसके बाद मदर टेरेसा ने पटना के होली फॅमिली हॉस्पिटल से आवश्यक नर्सिग ट्रेनिंग पूरी की और 1948 में वापस कोलकाता आ गईं और वहां से पहली बार तालतला गई, जहां वह गरीब बुजुर्गो की देखभाल करने वाली संस्था के साथ रहीं। उन्होंने मरीजों के घावों को धोया, उनकी मरहमपट्टी की और उनको दवाइयां दीं।\n" +
                    "\n" +
                    "धीरे-धीरे उन्होंने अपने कार्य से लोगों का ध्यान अपनी ओर खींचा। इन लोगों में देश के उच्च अधिकारी और भारत के प्रधानमंत्री भी शामिल थे, जिन्होंने उनके कार्यों की सराहना की।\n" +
                    "\n" +
                    "मदर टेरेसा के अनुसार, इस कार्य में शुरूआती दौर बहुत कठिन था। वह लोरेटो छोड़ चुकी थीं इसलिए उनके पास कोई आमदनी नहीं थी – उनको अपना पेट भरने तक के लिए दूसरों की मदद लेनी पड़ी। जीवन के इस महत्वपूर्ण पड़ाव पर उनके मन में बहुत उथल-पथल हुई, अकेलेपन का एहसास हुआ और लोरेटो की सुख-सुविधायों में वापस लौट जाने का खयाल भी आया लेकिन उन्होंने हार नहीं मानी।\n" +
                    "\n" +
                    "7 अक्टूबर 1950 को उन्हें वैटिकन से ‘मिशनरीज ऑफ़ चैरिटी’ की स्थापना की अनुमति मिल गयी। इस संस्था का उद्देश्य भूखों, निर्वस्त्र, बेघर, लंगड़े-लूले, अंधों, चर्म रोग से ग्रसित और ऐसे लोगों की सहायता करना था जिनके लिए समाज में कोई जगह नहीं थी।\n" +
                    "\n" +
                    "‘मिशनरीज ऑफ़ चैरिटी’ का आरम्भ मात्र 13 लोगों के साथ हुआ था पर मदर टेरेसा की मृत्यु के समय (1997) 4 हजार से भी ज्यादा ‘सिस्टर्स’ दुनियाभर में असहाय, बेसहारा, शरणार्थी, अंधे, बूढ़े, गरीब, बेघर, शराबी, एड्स के मरीज और प्राकृतिक आपदाओं से प्रभावित लोगों की सेवा कर रही हैं\n" +
                    "\n" +
                    "मदर टेरेसा ने ‘निर्मल हृदय’ और ‘निर्मला शिशु भवन’ के नाम से आश्रम खोले । ‘निर्मल हृदय’ का ध्येय असाध्य बीमारी से पीड़ित रोगियों व गरीबों का सेवा करना था जिन्हें समाज ने बाहर निकाल दिया हो। निर्मला शिशु भवन’ की स्थापना अनाथ और बेघर बच्चों की सहायता के लिए हुई।\n" +
                    "\n" +
                    "सच्ची लगन और मेहनत से किया गया काम कभी असफल नहीं होता, यह कहावत मदर टेरेसा के साथ सच साबित हुई।\n" +
                    "\n" +
                    "जब वह भारत आईं तो उन्होंने यहाँ बेसहारा और विकलांग बच्चों और सड़क के किनारे पड़े असहाय रोगियों की दयनीय स्थिति को अपनी आँखों से देखा। इन सब बातों ने उनके ह्रदय को इतना द्रवित किया कि वे उनसे मुँह मोड़ने का साहस नहीं कर सकीं। इसके पश्चात उन्होंने जनसेवा का जो व्रत लिया, जिसका पालन वो अनवरत करती रहीं।\n" +
                    "\n" +
                    "सम्मान और पुरस्कार\n" +
                    "\n" +
                    "मदर टेरेसा को मानवता की सेवा के लिए अनेक अंतर्राष्ट्रीय सम्मान एवं पुरस्कार प्राप्त हुए। भारत सरकार ने उन्हें  पहले पद्मश्री (1962) और बाद में देश के सर्वोच्च नागरिक सम्मान ‘भारत रत्न’ (1980) से अलंकृत किया। संयुक्त राज्य अमेरिका ने उन्हें वर्ष  1985 में मेडल आफ़ फ्रीडम 1985 से नवाजा। मानव कल्याण के लिए किये गए कार्यों की वजह से मदर टेरेसा को 1979 में नोबेल शांति पुरस्कार मिला। उन्हें यह पुरस्कार ग़रीबों और असहायों की सहायता करने के लिए दिया गया था। मदर तेरस ने नोबेल पुरस्कार की 192,000 डॉलर की धन-राशि को गरीबों के लिए एक फंड के तौर पर इस्तेमाल करने का निर्णय लिया।\n" +
                    "\n" +
                    "मृत्यु\n" +
                    "\n" +
                    "बढती उम्र के साथ-साथ उनका स्वास्थ्य भी बिगड़ता गया। वर्ष 1983 में 73 वर्ष की आयु में उन्हें पहली बार दिल का दौरा पड़ा। उस समय मदर टेरेसा रोम में पॉप जॉन पॉल द्वितीय से मिलने के लिए गई थीं। इसके पश्चात वर्ष 1989 में उन्हें दूसरा हृदयाघात आया और उन्हें कृत्रिम पेसमेकर लगाया गया। साल 1991 में मैक्सिको में न्यूमोनिया के बाद उनके ह्रदय की परेशानी और बढ़ गयी। इसके बाद उनकी सेहत लगातार गिरती रही। 13 मार्च 1997 को उन्होंने ‘मिशनरीज ऑफ चैरिटी’ के मुखिया का पद छोड़ दिया और 5 सितम्बर, 1997 को उनकी मौत हो गई। उनकी मौत के समय तक ‘मिशनरीज ऑफ चैरिटी’ में 4000 सिस्टर और 300 अन्य सहयोगी संस्थाएं काम कर रही थीं जो विश्व के 123 देशों में समाज सेवा में कार्यरत थीं। मानव सेवा और ग़रीबों की देखभाल करने वाली मदर टेरेसा को पोप जॉन पाल द्वितीय ने 19 अक्टूबर, 2003 को रोम में “धन्य” घोषित किया।\n" +
                    "\n" +
                    "मदर टेरेसा के अनमोल विचार\n" +
                    "\n" +
                    "मैं चाहती हूँ कि आप अपने पड़ोसी के बारे में चिंतित रहें। क्या आप अपने पड़ोसी को जानते हैं?\n" +
                    "यदि हमारे बीच शांति की कमी है तो वह इसलिए क्योंकि हम भूल गए हैं कि हम एक दूसरे से संबंधित हैं।\n" +
                    "यदि आप एक सौ लोगों को भोजन नहीं करा सकते हैं, तो कम से कम एक को ही करवाएं।\n" +
                    "यदि आप प्रेम संदेश सुनना चाहते हैं तो पहले उसे खुद भेजें। जैसे एक चिराग को जलाए रखने के लिए हमें दिए में तेल डालते रहना पड़ता है।\n" +
                    "अकेलापन सबसे भयानक ग़रीबी है।\n" +
                    "अपने क़रीबी लोगों की देखभाल कर आप प्रेम की अनुभूति कर सकते हैं।\n" +
                    "अकेलापन और अवांछित रहने की भावना सबसे भयानक ग़रीबी है।\n" +
                    "प्रेम हर मौसम में होने वाला फल है, और हर व्यक्ति के पहुंच के अन्दर है।\n" +
                    "आज के समाज की सबसे बड़ी बीमारी कुष्ठ रोग या तपेदिक नहीं है, बल्कि अवांछित रहने की भावना है।\n" +
                    "प्रेम की भूख को मिटाना, रोटी की भूख मिटाने से कहीं ज्यादा मुश्किल है।\n" +
                    "अनुशासन लक्ष्यों और उपलब्धि के बीच का पुल है।\n" +
                    "सादगी से जियें ताकि दूसरे भी जी सकें।\n" +
                    "प्रत्येक वस्तु जो नहीं दी गयी है खोने के सामान है।\n" +
                    "हम सभी महान कार्य नहीं कर सकते लेकिन हम कार्यों को प्रेम से कर सकते हैं।\n" +
                    "हम सभी ईश्वर के हाथ में एक कलम के सामान है।\n" +
                    "यह महत्वपूर्ण नहीं है आपने कितना दिया, बल्कि यह है की देते समय आपने कितने प्रेम से दिया।\n" +
                    "खूबसूरत लोग हमेशा अच्छे नहीं होते। लेकिन अच्छे लोग हमेशा खूबसूरत होते हैं।\n" +
                    "दया और प्रेम भरे शब्द छोटे हो सकते हैं लेकिन वास्तव में उनकी गूँज अन्नत होती है।\n" +
                    "कुछ लोग आपकी ज़िन्दगी में आशीर्वाद की तरह होते हैं तो कुछ लोग एक सबक की तरह।",
            "नवाजुद्दीन सिद्दकी हिंदी फिल्\u200Dमों के जाने माने अभिनेता हैं और बॉलीवुड की कई महत्\u200Dवपूर्ण फिल्\u200Dमों में अपने अभिनय का जलवा बिखेर चुके हैं। उन्\u200Dहें आलोचकों से प्रशंसा मिलने के बाद जनता का भी ढ़ेर सारा प्\u200Dयार मिला हैा उन्\u200Dहें उनके अभिनय के लिए कई सारे पुरस्\u200Dकारों से भी 'नवाजा' जा चुका हैा बॉलीवुड के साथ साथ अब उनकी हॉलीवुड में भी फैन फालोइिंग बढ़ चुकी है।\n" +
                    "\n" +
                    "पृष्\u200Dठभूमि\n" +
                    "नवाजुद्दीन सिद्दकी का जन्\u200Dम उ.प्र. के मुजफ्फनगर जिले के बुधाना कस्\u200Dबे में एक मुस्लिम परिवार में हुआ था। उनके पिता किसान हैं। उनके सात भाई और दो बहनें हैं। \n" +
                    "\n" +
                    "पढ़ाई\n" +
                    "नवाजुद्दीन ने गुरूकुल कांगड़ी यूनिवर्सिटी, हरिद्वार, उतराखंड से विज्ञान में स्\u200Dनातक की पढ़ाई पूरी की जिसके बाद वे केमिस्\u200Dट के तौर पर एक पेट्रोकेमिकल कंपनी में काम करने लगे। उन्\u200Dहोंने दिल्\u200Dली के नेशनल स्\u200Dकूल ऑफ ड्रामा से थियेटर में अपना स्\u200Dनातक पूरा किया है। \n" +
                    "\n" +
                    "शादी\n" +
                    "नवाजुद्दीन की शादी हो चुकी है। उनकी एक लड़की है जिसका नाम शोरा है।\n" +
                    "\n" +
                    "करियर\n" +
                    "उनके करियर की शुरूआत 'शूल' और 'सरफरोश' जैसी फिल्\u200Dमों से हुई थी लेकिन इन फिल्\u200Dमों में उनका किरदार काफी कम समय के लिए था। इसके बाद उन्\u200Dहोंने कई छोटी-बड़ी फिल्\u200Dमों में काम किया उनके काम को हर तरफ से काफी सरा\u200Dहा गया लेकिन असली पहचान उन्\u200Dहें 'पीपली लाइव', 'क\u200Dहानी', 'गैंग्\u200Dस ऑफ वासेपुर', 'द लंच बॉक्\u200Dस' जैसी फिल्\u200Dमों से ही मिली। लगातार संघर्षों के बाद अब वह एक सफल अभिनेता बन चुके हैं। और कई फिल्\u200Dमों में अपने बेहतरीन अभिनय का लोहा मनवा चुके हैं। नवाजुद्दीन की कुछ बेहतरीन फिल्\u200Dमें कहानी, बॉम्\u200Dबे टॉकीज, किक, मांझी द माउंटेनमैन, रईस, मंटो, ठाकरे, और फोटोग्राफ हैं।\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "पुरस्\u200Dकार  \n" +
                    "\n" +
                    "फिल्\u200Dम लंचबॉक्\u200Dस के लिये बेस्\u200Dट सपोर्टिंग ऐक्\u200Dटर के पुरस्\u200Dकार के साथ ही फिल्\u200Dम तलाश, कहानी, गैंग्\u200Dस ऑफ वासेपुर और देख इंडियन सरकस के लिये उन्\u200Dहें राष्\u200Dट्रीय पुरस्\u200Dकार से सम्\u200Dमानित किया जा चुका है। इसके अलावा उन्\u200Dहें आईआईएफए अवार्डस, स्\u200Dक्रीन अवार्ड्स, जी सिने अवार्डस, रेनॉल्\u200Dट स्\u200Dटार गिल्\u200Dट अवार्डस और एशिया पैशिफिक स्\u200Dक्रीन अवार्ड्स से भी सम्\u200Dमानित किया जा चुका है।",
            "दोस्तों आज मै बात करने जा रहा हूँ,  इंटरनेट की दुनिया पर राज करने वाली गूगल कंपनी के co-founder लैरी पेज की, जिन्होंने सर्गी ब्रिन के साथ मिलकर गूगल जैसा सर्च इंजन बनाया और इस खोज के जरिये उन्होंने हमारी जिंदगी कितनी आसान कर दी, यह तो हम सब जानते ही हैं।\n" +
                    "\n" +
                    "गूगल आज के समय में दुनिया की सबसे सफल कंपनियों में से एक है। और यही वजह है की लैरी पेज भी सबसे सफल व्यवसायियों की गिनती में गिने जाते है |\n" +
                    "\n" +
                    "तो चलिए दोस्तों बिना आपका ज्यादा समय लिए हम गूगल और लैरी पेज की सफलता को शुरू से जानते है |\n" +
                    "\n" +
                    "लैरी पेज का जन्\u200Dम 23 मार्च 1973 को अमेरिका के मिशिगन में हुआ था | उनके पिता का नाम कार्ल विक्टर और माँ का नाम ग्लोरिया था | और वे दोनों ही वही के स्टेट यूनिवर्सिटी में कंप्यूटर साइंस के प्रोफेसर थे।\n" +
                    "\n" +
                    "लैरी बताते है की उनके घर में आम तौर पर कंप्यूटर साइंस से सम्बंधित मैगजींस और गैजेट्स बिखरे हुए रहते थे |\n" +
                    "\n" +
                    "इसी इन्वोर्मेंट में पले बढे होने की वजह से  लैरी को बचपन से ही कंप्यूटर में काफी रूचि हो गयी |\n" +
                    "\n" +
                    "उन्होंने बहुत छोटी उम्र से ही चीजो को खोलकर समझना शुरू कर दिया | वे जानना चाहते थे की आखिर कोई चीज काम कैसी करती है |\n" +
                    "\n" +
                    "Larry Page ने एक इंटरव्यू में बताया की – “ मैंने बहुत ही कम उम्र से, यह महसूस कर लिया था कि मैं चीजों का आविष्कार करना चाहता हूं। और जब मै 12 साल के आस पास का था, तभी मैंने यह सोच लिया था कि मै एक बिजनसमैन बनूँगा | जिसके बाद से ही मुझे बिज़नस वर्ल्ड के बातों को जानने की दिलचस्पी होने लगी |”\n" +
                    "लैरी पेज की शुरुआती पढ़ाई ओकेमोस मॉन्टेसरी स्कूल से हुआ। इसके बाद उन्होंने 1979 में ईस्ट लैन्सिंग हाई स्कूल से अपनी ग्रेजुएशन पूरी की। और फिर आगे चल कर वे स्टैनफोर्ड यूनिवर्सिटी से पोस्ट ग्रेजुएशन कम्प्लीट करने के बाद, वही से पीएचडी करने लगे | जहाँ उनकी मुलाक़ात हुई मौजूदा समय में गूगल के को फाउन्डर सर्गी ब्रिन से।\n" +
                    "\n" +
                    "पीएचडी में दोनों ने अपना  रिसर्च टोपिक वल्र्ड वाइड वेब (World Wide Web) को चुना | और फिर वे ऐसे  एल्गोरिदम (algorithm) की खोज में लग गए जिससे सभी वेबसाइट को एक साथ लिंक किया जा सके, और उनके पोपुलार्टी के आधार पर उनके पेजस (pages) को रैंकिंग दी जा सके  | जैसा की अभी आप करेंट टाइम में गूगल को देख सकते है |\n" +
                    "\n" +
                    "अगले चार सालों तक दिन रात एक कर उन्होंने जबरजस्त रिसर्च की और आखिरकार सितम्बर 1996 में वे ऐसे अल्गोरिदम को खोजने में सफल हो गए |\n" +
                    "\n" +
                    "दोस्तों गूगल का नाम गडित के शब्द गोगोल / Googol से लिया गया है। जिसका मतलब होता है एक अंक के आगे सौ शून्य | और हां पहली बार जिस गूगल को लोंच किया गया था वह स्टैंड फोर्ड यूनिवर्सिटी के वेबसाइट पर अभी भी उपलब्ध है |\n" +
                    "आगे चल कर अपने परिवार, दोस्तो और इन्वेस्टर्स से दस लाख डालर का कर्ज लेकर लैरी और ब्रिन ने 1998 में गुगल Inc कंपनी  की स्थापना की और अपने यूनिक कांसेप्ट और अल्गोरिद्म की वजह से गुगल बहुत ही जल्द ही दुनिया का सबसे लोक्रप्रिय संर्च इंजन बन गया। बस यहाँ से लैरी और उनके साथी ब्रिन ने भी कभी भी पीछे मुड कर नहीं देखा | अगले कुछ सालों के बाद 2004 में गुगल का आईपीओ शेयर मार्केट में उतारा गया।\n" +
                    "\n" +
                    "Michael Dell Biography in Hindi | माइकल डेल\n" +
                    "\n" +
                    "जहाँ पर लोगों से जमकर इन्वेस्ट किया और इस तरह से धीरे धीरे गूगल, इंटरनेट की दुनिया की सबसे बड़ी कंपनी बन गयी | और गूगल को बनाने वाले  लैरी पेज और सर्गी ब्रिन सबसे यंगेस्ट बिलिनियर बन गए |\n" +
                    "\n" +
                    "14 नबंवर 2006 को गूगल ने इस समय के सबसे लोकप्रिय और सबसे बडी विडियो लाइब्रेरी  जिस पर आप यह विडियो देख रहे है यूट्यू्ब का अधिग्रहण कर लिया  |\n" +
                    "\n" +
                    "इसके अलावा 30 अप्रैल, 2009 को गूगल द्वारा ही पहला एंड्रॉयड ऑपेरटिंग सिस्\u200Dटम लांच किया गया, जो इस समय दुनियां भर के अरबो खरबों मोबाइल फोनस पर छाया हुआ है |\n" +
                    "\n" +
                    "गूगल सर्च इंजन और यूट्यू्ब के अलावा भी जी-मेल, गूगल ट्रान्\u200Dसलेट, गूगल प्लस, गूगल क्रोम और गूगल मैप जैसे 50 से भी जयादा प्रोडक्ट्स गूगल के उपलब्ध है |\n" +
                    "\n" +
                    "गुगल का हेड ऑफिस केलिफोर्निया की सिलीकान वैली में है और अगर इस समय में पुरे दुनिया के सबसे धनि लोगों की बात करें तो लैरी पेज 12 वे नंबर पर आते है |\n" +
                    "\n" +
                    "अगर उनके पर्सनल लाइफ देखा जाए तो 8 दिसम्बर 2007 को उन्होंने एक्ट्रेस  कैरी साउथवर्थ की बहन  लुसिंडा साउथवर्थ के साथ शादी की। लुसिंडा साउथवर्थ एक रिसर्च साइंटिस्ट है | और लुसिंडा से लैरी को दो बच्चे भी है |\n" +
                    "\n" +
                    "दोस्तों अंत में बस मै यही कहना चाहूँगा की  लैरी पेज और सर्गी ब्रिन के दिन-रात की मेहनत का ही फल है कि आज दुनियॉ भर में ज्\u200Dयादातर लोग इंटरनेट की शुरूआत गूगल से ही करते हैं |\n" +
                    "\n" +
                    "इंटरनेट के क्षेत्र में उनके योगदानो को कभी भी नहीं भुलाया जा सकता है  |\n" +
                    "\n" +
                    "और हां आपको तो शायद पता ही होगा, मौजूदा समय में गूगल के सीईओ भारत के सुन्दर पिचाई है |",
            "भारत के संविधान निर्माता, चिंतक, समाज सुधारक बाबा साहेब अंबेडकर का जन्म मध्य प्रदेश के मऊ में 14 अप्रैल 1891 को हुआ था. उनके पिता का नाम रामजी मालोजी सकपाल और माता का नाम भीमाबाई था. वे अपने माता-पिता की चौदहवीं संतान थे.\n" +
                    "जानिए बाबा साहेब अंबेडकर की खास 10बातें\n" +
                    "1. बाबा साहेब अंबेडकर का परिवार महार जाति से संबंध रखता था, जिसे अछूत माना जाता था. बचपन से ही आर्थिक और सामाजिक भेदभाव देखने वाले अंबेडकर ने विषम परिस्थितियों में पढ़ाई शुरू की.\n" +
                    "\n" +
                    "2. बाल विवाह प्रचलित होने के कारण 1906 में उनकी शादी नौ साल की लड़की रमाबाई से हुई.\n" +
                    "\n" +
                    "3. 1908 में उन्होंने एलफिंस्टन कॉलेज में प्रवेश लिया. इस कॉलेज में प्रवेश लेने वाले वे पहले दलित जाति के बच्चे थे.\n" +
                    "\n" +
                    "4. 1913 में एमए करने के लिए वे अमेरिका चले गए. अमेरिका में पढ़ाई करना बड़ौदा के गायकवाड़ शासक सहयाजी राव तृतीय से मासिक वजीफा मिलने के कारण संभव हो सका था.\n" +
                    "\n" +
                    "5. 1921 में लंदन स्कूल ऑफ इकॉनोमिक्स से उन्हें एमए की डिग्री मिली.\n" +
                    "\n" +
                    "6. 1925 में बाबा साहेब को बॉम्बे प्रेसिडेंसी समिति ने साइमन आयोग में काम करने के लिए नियुक्त किया. इस आयोग का विरोध पूरे भारत में किया गया था.\n" +
                    "\n" +
                    "7. अंबेडकर दलितों पर हो रहे अत्याचार के विरुद्ध आवाज उठाने के लिए 'बहिष्कृत भारत', 'मूक नायक', 'जनता' नाम के पाक्षिक और साप्ताहिक पत्र निकालने शुरू किये.\n" +
                    "\n" +
                    "8. भारत की आजादी के बाद उन्हें कानून मंत्री बनाया गया. 29 अगस्त, 1947 को स्वतंत्र भारत के संविधान रचना के लिए संविधान मसौदा समिति के अध्यक्ष पद पर नियुक्त किया गया.\n" +
                    "\n" +
                    "9. 1951 में संसद में अपने हिन्दू कोड बिल मसौदे को रोके जाने के बाद अंबेडकर ने मंत्रीमंडल से इस्तीफा दे दिया. इस मसौदे में उत्तराधिकार, विवाह और अर्थव्यवस्था के कानूनों में लैंगिक समानता की बात कही गई थी.\n" +
                    "\n" +
                    "10. 14 अक्टूबर 1956 को अंबेडकर और उनके समर्थकों ने पंचशील को अपनाते हुए बौद्ध धर्म ग्रहण किया. अंबेडकर का मानना था कि हिंदू धर्म के अंदर दलितों को कभी भी उनका अधिकार नहीं मिल सकता है. 6 दिसंबर, 1956 को अंबेडकर की मृत्यु हो गई.",
            "रितेश अग्रवाल सबसे प्रसिद्ध और संपन्न युवा भारतीय उद्यमियों में से एक है। वह OYO ROOMS के Founder और CEO हैं, जो भारत में एक उच्च मूल्यवान स्टार्टअप है। वर्तमान में OYO ROOMS कई देशों में संचालित होते हैं और इसके विकास का पूरा श्रेय रितेश अग्रवाल और उनकी शानदार टीम को जाता है | वह कई युवा स्टार्टअप संस्थापकों के लिए एक प्रेरणा के स्त्रोत्र हैं | और उन्होंने अपने उदाहरण के साथ दिखाया है कि आप कितनी भी उम्र के क्यों ना हों, आप अपनी खुद की कंपनी शुरू कर सकते हैं और अपने जुनून को आगे बढ़ाना जारी रख सकते हैं। आइए रितेश अग्रवाल की जीवनी में उनके जीवन यात्रा, उनके संघर्ष और उनकी उपलब्धियों के बारे में जानते हैं ।\n" +
                    "\n" +
                    "रितेश अग्रवाल जन्म तिथि\n" +
                    "\n" +
                    "रितेश अग्रवाल रितेश अग्रवाल का जन्म 16 नवंबर 1993 को उड़ीसा के कटक में बिसाम नाम के एक छोटे से शहर में हुआ था । उन्होंने अपनी स्कूली शिक्षा भी उड़ीसा में ही पूरी की | वर्तमान में, वह अपने काम में इतने व्यस्त हैं की उनके पास अपने विशेष दिन का जश्न मनाने का समय भी नहीं हैं | लेकिन जब भी वह समय मिलता है, वह अपने जन्मदिन को अपने दोस्तों और परिवार के साथ मनाता है।\n" +
                    "\n" +
                    "रितेश अग्रवाल परिवार पृष्ठभूमि\n" +
                    "\n" +
                    "रितेश अग्रवाल का परिवार एक मध्यम श्रेणी मारवाड़ी परिवार है, जो उड़ीसा राज्य में रहता है। रितेश के करोड़पति बनने से पहले, उनकी वित्तीय स्थिति अच्छी नहीं थी। हालांकि, उन्होंने हमेशा रितेश का समर्थन करने के लिए समर्थन किया जो वह आज है। उन्होंने हमेशा उनके द्वारा किए गए हर निर्णय के साथ उन पर भरोसा किया है। यदि आप उनके निजी जीवन के बारे में जानने में रुचि रखते हैं, तो रितेश अग्रवाल गॉसिप जंक्शन पढ़ना जारी रखें।\n" +
                    "\n" +
                    "\n" +
                    "रितेश अग्रवाल शिक्षा\n" +
                    "\n" +
                    "रितेश अग्रवाल ने अपनी स्कूली शिक्षा उड़ीसा राज्य में सेक्रेड हार्ट स्कूल पूरी की। वह उड़ीसा के रायगढ़ में सेक्रेड हार्ट स्कूल गए। अपनी स्कूली शिक्षा पूरी करने के बाद उन्होंने दिल्ली में इंडियन स्कूल ऑफ बिजनेस एंड फाइनेंस में दाखिला लिया। आश्चर्य की बात है, वह कॉलेज कभी नहीं गए। लेकिन उन्होंने उस क्षेत्र में अपनी कंपनी शुरू की जिसमे उनकी रूचि थी। वह कॉलेज से बाहर निकल गया और फिर कभी वापस नहीं देखा। बहुत से लोग रितेश अग्रवाल की सफलता की कहानी के बारे में जानना चाहते हैं और आप इस पूर्ण जीवनी के माध्यम से पढ़कर जान सकते हैं।\n" +
                    "\n" +
                    "रितेश अग्रवाल पर्सनल लाइफ\n" +
                    "\n" +
                    "उन्होंने 17 वर्ष की छोटी सी उम्र में भारत में कई स्थानों पर यात्रा शुरू कर दी। वह भारत में मौजूदा व्यवसाय से संतुष्ट नहीं थे और इस प्रकार उन्होंने भारत में एक होटल व्यवसाय शुरू करने का फैसला किया। वह बेहद दयालु, विनम्र व्यक्तित्व के व्यक्ति है। इतनी छोटी उम्र में इस तरह के एक बड़े व्यवसाय का प्रबंधन करने के बाद भी जमीन से जुड़े हुए व्यक्ति हैं और वह अपने सहयोगियों और दोस्तों को अत्यधिक प्यार और देखभाल के साथ व्यवहार करता है। वह सबसे व्यस्त व्यक्तियों में से एक है लेकिन फिर भी अपने परिवार के लिए समय निकालता है जो अक्सर अपने चरित्र के बारे में बहुत कुछ कहता है। वह सोशल मीडिया पर काफी सक्रिय हैं ताकि आप उन प्रोफाइल पर रितेश अग्रवाल फोटो देख सकें। आपको निश्चित रूप से यह जानना अच्छा लगेगा कि वह एक चौंकाने वाली उम्र में इस तरह के सफल स्टार्टअप को कैसे प्रबंधित करने में कामयाब रहा, रितेश अग्रवाल की जीवनी से पता चलेगा।\n" +
                    "\n" +
                    "रितेश अग्रवाल करियर\n" +
                    "\n" +
                    "यदि आप कल्पना कर रहे थे कि OYO Rooms की स्थापना किसने की थी, तो रितेश अग्रवाल थे। रितेश अग्रवाल की उम्र केवल 18 वर्ष की थी जब उन्होंने अपनी पहली कंपनी ओवलस्टेज़ के साथ शुरुआत की जो OYO ROOMS में बदल गया। OYO का पूरा रूप On Your Own है जो की OYO के संक्षिप्त रूप में काफी आकर्षित लगता हैं | इससे पहले अपने करियर में, उन्हें थील फैलोशिप प्राप्त हुई जिसने उन्हें अपने उद्यम को महान ऊंचाई पर ले जाने में बहुत मदद मिली। इस कार्यक्रम के माध्यम से, उन्हें $100,000 प्राप्त हुए जो एक आश्चर्यजनक राशि थी। OYO ROOMS के ज्यादातर फंडिंग इस माध्यम से किए गए थे और वे अपने व्यापार का विस्तार करने के लिए अतिरिक्त धनराशि तलाशने गए थे। OYO Rooms के संस्थापक होने के नाते एक आसान काम नहीं है क्योंकि वह लगातार कई चुनौतीपूर्ण कार्यों पर काम कर रहे है और कंपनी के विकास के लिए जिम्मेदार है। चूंकि वह अपनी कंपनी के CEO हैं, रितेश अग्रवाल का वेतन OYO Rooms के किसी भी अन्य कर्मचारियों की तुलना में बहुत अधिक होना चाहिए। यद्यपि रितेश अग्रवाल का शुद्ध मूल्य निर्दिष्ट नहीं है, लेकिन यह लाखों में कहीं भी होना चाहिए और जल्द ही हम उम्मीद कर सकते हैं कि वह भारत के सबसे छोटे अरबपति बन सकते हैं। उन्होंने अपने शानदार स्टार्टअप और नेतृत्व के लिए काफी संख्या में पुरस्कार और मान्यताएं भी जीती हैं। भारतीय उद्यमियों की सर्वश्रेष्ठ प्रेरणादायक कहानियों में उनकी कहानी सच है।\n" +
                    "\n" +
                    "रितेश अग्रवाल के बारे में दिलचस्प तथ्य\n" +
                    "\n" +
                    "रितेश अग्रवाल OYO Rooms के संस्थापक, Thiel Fellowship जीतने वाले पहले भारतीय निवासी हैं जो की एक प्रतिष्ठित छात्रवृत्ति पुरस्कार है।\n" +
                    "\n" +
                    "उन्हें वर्ष 2015 में बिजनेस वर्ल्ड युवा उद्यमी पुरस्कार मिला।\n" +
                    "\n" +
                    "वह लगातार विभिन्न सूचियों में शीर्ष 10 भारतीय उद्यमियों में स्थान पर हैं।\n" +
                    "\n" +
                    "OYO Rooms के CEO रितेश अग्रवाल सफलता की कहानी\n" +
                    "\n" +
                    "चूंकि OYO ROOMS के संस्थापक विकी पुष्टि करेंगे, उन्होंने वर्ष 2012 में ओवल स्टैज़ नाम के साथ अपना पहला उद्यम शुरू किया जिसमें बिस्तर और नाश्ता की एक पंक्ति थी। हालांकि, उस व्यवसाय से रितेश अग्रवाल के वार्षिक कारोबार के आंकड़ों के साथ, उन्हें एहसास हुआ कि उन्हें केवल बिस्तर और नाश्ते की अवधारणा की तुलना में भारतीय होटलों की आवश्यकता है।\n" +
                    "\n" +
                    "एक अन्य साक्षात्कार में, उन्होंने पुष्टि की कि वह भारत में बजट यात्री के लिए कुछ बनाना चाहते हैं, और इसलिए, भारत में OYO Rooms की अवधारणा ने उन्हें एक दिन अटका  दिया। दिल्ली में OYO ROOMS के साथ शुरूआती योजना और बाद में बैंगलोर में OYO ROOMS के साथ, इस युवा उद्यमी ने तूफान से होटल उद्योग लिया।\n" +
                    "\n" +
                    "\n" +
                    "वर्ष 2013 में, रितेश अग्रवाल ने थील फैलोशिप के लिए आवेदन किया था और उन्हें 1,00,000 डॉलर का अनुदान मिला और थील फैलोशिप प्राप्त करने वाले पहले एशियाई बने। यह तब हुआ जब रितेश अग्रवाल और पीटर थील के सहयोग ने उन्हें और उनके व्यापार को खरीदा था, जिसकी बहुत जरूरत थी। आखिरकार, रितेश अग्रवाल ने नई स्टार्ट-अप को देश भर में प्रसिद्धि और सफलता में बदल दिया। इसके कारण, फेसबुक से शेरिल सैंडबर्ग जैसे प्रसिद्ध उद्यमी और मोबिकविक से बिपीन प्रीते सिंह ने भी उनकी प्रतिभा की सराहना की है।\n" +
                    "\n" +
                    "अभी तक, सभी की आंखें रितेश अग्रवाल की अगली परियोजना पर हैं और रितेश अग्रवाल के नवीनतम साक्षात्कार के अनुसार, रितेश विदेश में अपना कारोबार ले के जा सकते हैं। रितेश अग्रवाल अपने उद्योग में कई बड़े नाम के संपर्क विवरण की तलाश में हैं ताकि वे व्यापार प्रस्तावों के लिए उससे संपर्क कर सकें।\n" +
                    "\n" +
                    "उद्यमी रितेश अग्रवाल पर्सनल लाइफ\n" +
                    "\n" +
                    "वह एक युवा और सुन्दर उद्यमी होने के नाते, रितेश अग्रवाल के प्रेम मामलों के बारे में स्पष्ट अफवाहें हैं लेकिन कभी आधिकारिक तौर पर यह नहीं पता चला कि रितेश अग्रवाल कौन है। हालांकि, हमेशा उनकी प्रेमिका के बारे में रितेश अग्रवाल विवाद और रितेश अग्रवाल के बारे में मीडिया जानना कितना बुरी तरह प्यार करता है। खैर, ऐसा माना जाता है कि रितेश अग्रवाल संबंध उनके लिए बहुत निजी हैं और जल्द ही हम रितेश अग्रवाल प्रेमिका के बारे में नहीं सुनेंगे। लेकिन हम उम्मीद करते हैं कि OYO ROOMS के संस्थापक रितेश अग्रवाल की पत्नी एक महत्वाकांक्षी उद्यमी होगी जैसा वह है।",
            "शिवाजी राव गायकवाड़ विशेषतः रजनीकांत के नाम से जाने जाते है, वे एक भारतीय फ़िल्म कलाकार है जो मुख्य रूप से तमिल सिनेमा में काम करते है। एक्टर बनने से पहले वे बैंगलोर ट्रांसपोर्ट सर्वीस में बस कंडक्टर के पद पर कार्यरत थे। 1973 में एक्टिंग में डिप्लोमा लेने के लिए उन्होंने मद्रास फ़िल्म इंस्टिट्यूट में एडमिशन लिया।\n" +
                    "\n" +
                    "1975 की तमिल ड्रामा फ़िल्म अपूर्वा रागंगाल से उन्होंने डेब्यू किया था, तमिल फ़िल्म में उन्होंने कई मनमोहन किरदार किये है, जिन्हें आज भी लोग याद करते है। उन्होंने कई कमर्शियल रूप से सफल फिल्मो में बतौर मुख्य कलाकार काम किया है।\n" +
                    "\n" +
                    "तभी से लोग उन्हें “सुपरस्टार” कहने लगे और वे तमिलनाडु के सबसे प्रसिद्ध शख्सियत बन गए। फिल्मो में डायलॉग बोलने का उनका अपना ही एक अलग अंदाज़ है, देश ही नही बल्कि विदेशो में भी लोग उनकी आवाज़ और उनके स्टाइल के दीवाने है।\n" +
                    "\n" +
                    "2007 में आयी फ़िल्म शिवाजी में उनके रोल के लिए उन्होंने 26 करोड़ की कमाई की थी, उस समय जैकी चैन के बाद रजनीकांत ही एशिया के सबसे महंगे अभिनेता थे। रजनीकांत ने भारत में दूसरी भाषाओ की फिल्मो में भी काम किया है, बल्कि रजनीकांत ने दूसरे देशो में भी फिल्मो में काम किया है, उन देशो में यूनाइटेड स्टेट भी शामिल है।\n" +
                    "\n" +
                    "2014 तक रजनीकांत 6 तमिलनाडु राज्य के फ़िल्म अवार्ड जीत चुके थे – चार बेस्ट एक्टर अवार्ड और दो स्पेशल अवार्ड और साथ ही उन्हें फ़िल्मफेयर बेस्ट तमिल एक्टर का पुरस्कार भी मिला है। एक्टिंग के साथ ही वे प्रोड्यूसर और स्क्रीनराइटर भी है। फ़िल्म करियर के साथ ही वे एक लोकोपकारी, आध्यात्मवादी और समाज सेवी भी है।\n" +
                    "\n" +
                    "सन् 2000 में भारत सरकार ने उन्हें पद्म भुषण से सम्मानित किया था और 2016 में पद्म विभूषण से सम्मानित किया था। 2014 में हुए 45 वे भारतीय अंतर्राष्ट्रीय फ़िल्म फेस्टिवल में उन्हें इंडियन फ़िल्म पर्सनालिटी ऑफ़ द इयर का सम्मान दिया गया था।\n" +
                    "\n" +
                    "रजनीकांत का प्रारंभिक जीवन – Rajinikanth Early Life Info\n" +
                    "रजनीकांत का जन्म 12 दिसंबर 1950 को एक मराठी परिवार में हुआ था। उनकी माता का नाम रमाबाई और पिता का नाम रामोजी राव था, उनके पिता बैंगलोर के पुलिस कांस्टेबल और माता गृहिणी थी। मराठा योद्धा छत्रपति शिवाजी के नाम पर ही उनका नाम शिवाजी राव रखा गया था।\n" +
                    "\n" +
                    "वे बचपन में घर पर मराठी और बाहर कन्नड़ में बात करते थे। रजनीकांत के पूर्वज वर्तमान पुणे के जेजुरी के पास के गाँव मावड़ी कड़े पत्थर से थे। चार भाई-बहनो में रजनी सबसे छोटे है। 1956 में उनके पिता के रिटायर (सेवानिवृत्त) हो जाने के बाद उनका परिवार बैंगलोर के हनुमंत नगर में चला गया और वही एक घर भी बनवाया। जब रजनी केवल 9 साल के थे तभी उन्होंने अपनी माता को खो दिया था।\n" +
                    "\n" +
                    "6 साल की उम्र में रजनी को गविपुरम गवर्नमेंट कन्नड़ मॉडल प्राइमरी स्कूल में डाला गया जहा उन्होंने प्रारंभिक शिक्षा ग्रहण की। बचपन से ही वे काफी होशियार थे और क्रिकेट, फुटबॉल और बास्केटबॉल में काफी रूचि थी। उसी समय उनके भाई ने उन्हें रामकृष्ण मठ में डलवाया था।\n" +
                    "\n" +
                    "मठ में उन्होंने वेद, भारतीय इतिहास का अभ्यास भी किया जिससे उनके अंदर आध्यात्मिकता का संचार हुआ। मठ में एक बार महाभारत का नाटक करते समय वे एकलव्य के दोस्त बने थे। लोगो ने नाटक में किये गए उनके अभिनय की काफी प्रशंसा भी की थी। विशेषतः कन्नड़ कवी डी.आर. बेंद्रे ने उनके अभिनय की तारीफ की थी। 6 ठी कक्षा के बाद उन्हें आचार्य पाठशाला पब्लिक स्कूल में डाला गया। आचार्य पाठशाला में पढ़ते समय उन्होंने कई नाटको में काम किया।\n" +
                    "\n" +
                    "एक बार कुरुक्षेत्र के नाटक में उन्होंने दुर्योधन की भूमिका निभाई थी। अपनी पढाई पूरी होने के बाद रजनी ने बैंगलोर और मद्रास में कई जॉब किये। सबसे पहले वे एक कुली थे फिर बढ़ई का काम किया और फिर बैंगलोर ट्रांसपोर्ट सर्विस में वे बस कंडक्टर बने। कन्नड़ नाटक टोपी मुनियप्पा करने के बाद से उन्होंने कई स्टेज शो किये, इसी वजह से उन्हें कई और नाटको में भी काम करने का मौका मिला। उनकी इच्छा थी की वे एक कलाकार बने लेकिन उनके परिवार ने उनका विरोध किया।\n" +
                    "\n" +
                    "रजनीकांत का परिवार और व्यक्तिगत जीवन – Superstar Rajinikanth Personal Life :\n" +
                    "\n" +
                    "रजनीकांत ने एथीराज कॉलेज की एक विद्यार्थिनी से शादी की, जिसने कॉलेज मैगज़ीन के लिए उनका इंटरव्यू लिया था। 26 फरवरी 1981 को आंध्रप्रदेश के तिरुपति में इनका विवाह संपन्न हुआ। आज उन्हें दो बेटीयाँ ऐश्वर्या रजनीकांत और सौंदर्या रजनीकांत है। उनकी पत्नी एक स्कूल चलाती है जिसका नाम “द आश्रम” है।\n" +
                    "\n" +
                    "उनकी बेटी ऐश्वर्या की शादी एक्टर धनुष के साथ 18 नवंबर 2004 को हुई। उनकी छोटी बेटी सौंदर्या तमिल फ़िल्म इंडस्ट्री में डायरेक्टर, प्रोड्यूसर और ग्राफ़िक डिज़ाइनर है। 3 सितम्बर 2010 को उनका विवाह उद्योगपति आश्विन रामकुमार से हुआ था।\n" +
                    "\n" +
                    "रजनीकांत अवार्ड और सम्मान – Superstar Rajinikanth Awards :\n" +
                    "\n" +
                    "रजनीकांत को अपनी बहुत सी फिल्मो के लिए बहुत से अवार्ड मिले है, उन्हें ज्यादातर अवार्ड तमिल फिल्मो के लिए ही मिले है। 1984 में उन्हें पहला फ़िल्मफेयर अवार्ड बेस्ट तमिल एक्टर के लिए मिला था, यह अवार्ड उन्हें नल्लवमुकु नल्लवं फ़िल्म के लिए दिया गया था।\n" +
                    "\n" +
                    "बाद में 2007 में आयी उनकी फ़िल्म शिवाजी के लिए फ़िल्मफेयर अवार्ड में उनका नामनिर्देशन जरूर किया गया था और 2010 में आयी फ़िल्म एन्थिरण के लिए भी उनका नामनिर्देशन किया गया था। 2014 तक रजनीकांत को 6 तमिल नाडु स्टेट फ़िल्म अवार्ड मिल चुके थे। सिनेमा एक्सप्रेस और फ़िल्मफैंस एसोसिएशन की तरफ से भी उन्हें कई पुरस्कार मिले है, राइटिंग और प्रोड्यूसिंग में योगदान के लिए भी उन्हें बहुत से पुरस्कार मिल चुके है।\n" +
                    "\n" +
                    "1984 में रजनीकांत को कलाईममणि अवार्ड और 1989 में एम.जी.आर अवार्ड मिला था, दोनों ही पुरस्कार तमिलनाडु सरकार ने उन्हें दिए थे। 1995 में साउथ इंडियन फ़िल्म आर्टिस्ट एसोसिएशन ने उन्हें कलैछैलवं अवार्ड सम्मानित किया। भारत सरकार ने भी सन् 2000 में उन्हें पद्म भुषण और सन् 2016 में पद्म विभूषण देकर सम्मानित किया है। NDTV ने 2007 में उन्हें इंटरटेनर ऑफ़ द इयर घोषित किया था।\n" +
                    "\n" +
                    "उसी साल महाराष्ट्र सरकार ने उन्हें राज कपूर अवार्ड देकर सम्मानित किया था। एशियावीक द्वारा रजनीकांत को सबसे प्रभावशाली दक्षिण एशिया का व्यक्ति घोषित किया गया था। 2010 में फ़ोर्ब्स इंडिया ने रजनीकांत को भारत का सबसे प्रभावशाली और प्रसिद्ध व्यक्ति बताया।\n" +
                    "\n" +
                    "2011 में NDTV ने इन्हें एंटरटेनर ऑफ़ द डिकेड अवार्ड से सम्मानित किया। दिसंबर 2013 में NDTV ने उन्हें “25 ग्लोबल लिविंग लीजेंड” की सूचि में भी शामिल किया।\n" +
                    "\n" +
                    "रजनीकांत की कुछ रोचक बाते – Rajinikanth Unknown Interesting Facts :\n" +
                    "\n" +
                    "1. शंकर द्वारा डायरेक्ट की गयी पहली फ़िल्म शिवाजी है और यह पहली तमिल फ़िल्म है जो यूनाइटेड किंगडम और साउथ अफ्रीका के बॉक्स ऑफिस पर भी टॉप पर रही।\n" +
                    "\n" +
                    "2. 1985 में इस सुपरस्टार ने अपनी 100 फिल्में पूरी की और श्री राघवेंद्र फ़िल्म में उन्होंने हिंदू संत राघवेंद्र स्वामी का रोल किया था।\n" +
                    "\n" +
                    "3. रजनीकांत के माता-पिता का नाम जीजाबाई और रामोजी राव गायकवाड़ है, जो एक महाराष्ट्रियन कपल थे और बैंगलोर में रहते थे और रजनी का असल नाम शिवाजी राव गायकवाड़ है।\n" +
                    "\n" +
                    "4. थलपति ही उनकी एक ऐसी फ़िल्म है जिसे सेंसर बोर्ड ने U/A सर्टिफिकेट देकर रिलीज किया था।\n" +
                    "\n" +
                    "5. जब रजनीकांत की फ़िल्म बापा बॉक्स ऑफिस पर असफल रही तब रजनी ने प्रोड्यूसर को होने वाले नुकसान की भरपाई स्वयं की थी।\n" +
                    "\n" +
                    "6. एन्थिरुण एक ही ऐसी तमिल फ़िल्म है जिसमे IMDb की टॉप 50 फिल्मो में जगह बनाई थी।\n" +
                    "\n" +
                    "7. साधारणतः रजनीकांत अपनी फ़िल्म के रिलीज होने के बाद हिमालय जाते है।\n" +
                    "\n" +
                    "8. रजनीकांत अपनी पत्नी लता से तब मिले थे जब उनकी पत्नी कॉलेज मैगज़ीन के लिए उनका इंटरव्यू ले रही थी।\n" +
                    "\n" +
                    "रजनीकांत – आम लोगों के लिए उम्मीद का प्रतीक। यह कहना कोई अतिश्योक्ति नहीं होगी कि रजनीकांत ऐसे इंसान हें जिन्होंने फर्श से अर्श तक आने की कहावत को सत्य साबित करके बताया हो। दुनिया में ऐसे कई लोग हैं जिन्होंने बड़ी बड़ी सफलताएं अर्जित की पर जिस तरह रजनीकांत ने अभावों और संघर्षों में इतिहास रचा है वैसा पूरी दुनिया में कम ही लोग कर पाएं होंगे।\n" +
                    "\n" +
                    "एक कारपेंटर से कुली बनने, कुली से बी.टी.एस. कंडक्टर और फिर एक कंडक्टर से विश्व के सबसे ज्यादा प्रसिद्ध सुपरस्टार बनने तक का सफ़र कितना परिश्रम भरा होगा ये हम सोच सकते हैं।\n" +
                    "\n" +
                    "रजनीकांत का जीवन ही नहीं बल्कि फिल्मी सफ़र भी कई उतार चढ़ावों से भरा रहा है। जिस मुकाम पर आज रजनीकांत काबिज़ हैं उसके लिए जितना परिश्रम और त्याग चाहिए होता है शायद रजनीकांत ने उससे ज्यादा ही किया है।\n" +
                    "\n" +
                    "रजनीकांत ने यह साबित कर दिया की उम्र केवल एक संख्या है और अगर व्यक्ति में कुछ करने की ठान ले तो उम्र कोई मायने नहीं रखती। 60 वर्ष के उम्र के पड़ाव पर वे आज भी वे शिवाजी- द बॉस और रोबोट जैसी हिट फिल्में देने का माद्दा रखते हैं।\n" +
                    "\n" +
                    "एक समय ऐसा भी था जब एक बेहतरीन अभिनेता होने के बावजूद उन्हें कई वर्षों तक नज़रंदाज़ किया जाता रहा पर उन्होंने अपनी हिम्मत नहीं हारी। ये बात रजनीकांत के आत्मविश्वास को और विपरीत परिस्तिथियों में भी हार न मानने वाले जज्बे का परिचय देती है।",
            "\"कर्नल\" हरलैंड डेविड सैंडर्स (सितम्बर 9, 1890 – दिसम्बर 16, 1980) एक अमेरिकी उद्यमी थे। उन्होंने केंटकी फ्राइड चिकन के नाम से कंपनी शुरू की।\n" +
                    "\n" +
                    "सैंडर्स का जन्म सितम्बर 9, 1890 को हेनरीविल्ले, इंडियाना में हुआ था। उन्होंने दक्षिणी विश्वविद्यालय में अध्ययन किया।\n" +
                    "\n" +
                    "उन्होंने जोसफिन किंग से शादी किया फिर बाद में तल।क हो गया। उन्होंने बाद में क्लाउडिया प्राइस से शादी कर लिया। सैंडर्स के 3 बच्चे थे। दिसम्बर 16, 1980 को केंटकी में उनका देहांत हो गया। वह 90 वर्ष के थे।\n" +
                    "\n" +
                    "Colonel Harland Sanders, KFC (Kentucky Fried Chicken) के founder का नाम बहुत कम ही लोग जानते होंगे। कर्नल सैंडर्स का अपना छोटा सा Business था जिससे इनकी रोजी-रोटी चलती थी, लेकिन वहां पर highway बनने के कारण इनका business बन्द हो गया। कुछ ही दिनों में इनकी पूँजी भी खत्म हो गयी और खाने के भी लाले पड़ गये। अब उनकी उम्र भी लगभग 65 वर्ष हो चुकी थी और हाल यह था की खोने के लिए अब उनके पास में कुछ भी नहीं बचा था।\n" +
                    "\n" +
                    "Colonel Harland Sanders को chicken बनाना बहुत पसंद था और उनको अपने चिकन प्रयोग पर बहुत भरोसा था, वो मसाले और प्रेसर कुकर लेकर अपनी चिकन बनाने का प्रयोग की मार्केटिंग करने निकल पड़े। उन्होंने अलग-अलग रेस्टोरेंट से मिलना शुरू किया। समय ने फिर भी उनका साथ नहीं दिया, एक-एक करके सभी रेस्टोरेंट मालिक उन्हें रिजेक्ट करते गये।\n" +
                    "\n" +
                    "लेकिन कर्नल सैंडर्स ने भी हार नहीं मानी, वह लगातार अपने कार्य में लगे रहे, सीखते रहे और कोशिश रहे। आपको यह सुनकर हैरानी होगी कि वह 1009 बार Interview में असफल रहे और एक हजार नौ (1009) लोगो ने उनको रिजेक्ट कर दिया, तब जाकर उनको सफलता मिल ही गई। हाँ अपने सही पढ़ा है, एक हजार नौ बार रिजेक्ट होने के बाद, एक हजार नौ बार ना सुनने के बाद उनको उनकी पहली हाँ मिली।\n" +
                    "\n" +
                    "संघर्ष\n" +
                    "\n" +
                    "kfc) की कामयाबी के पीछे colonel sanders का हाथ था. अपनी fried chicken recipe के कारण वे विश्व में प्रसिद्ध हुए.  sanders ने उम्र की बाधा को अपनी कामयाबी का रोड़ा बनने नहीं दिया और उन्हें कामयाबी मिली 65 साल की उम्र में. जब वह 5 साल के थे तब उनके पिता की मृत्यु हो गई, इसके बाद अपने परिवार जिनमे उनके छोटे भाई और बहन शामिल थे को पालने की जिम्मेदारी उन पर आ गयी. इसके बाद उन्होंने कई कामो में अपना हाथ आजमाया. इनमे किसान, स्ट्रीटकार कंडक्टर, रेलरोड फायरमैन और इंशोरेंस सेल्समेन जैसी जॉब शामिल थी. इनमे वह सफल ना हो सके, 16 वर्ष की उम्र में उन्होंने अपना स्कूल छोड़ दिया. केवल 17 वर्ष की उम्र में उन्हें अपनी चार जॉब्स खोनी पड़ी, 18 वर्ष की उम्र में वह विवाहित हुए और अगले ही साल उनकी एक बेटी हुई, जल्द ही उनकी पत्नी अपने बच्ची को लेकर उन्हें छोड़ कर चली गयी.\n" +
                    "\n" +
                    "40 साल की उम्र में sanders kentucky में एक सर्विस स्टेशन चला रहे थे जहाँ वह कई भूखे यात्रियों को खाना भी खिलाते थे. उन्होंने इस सर्विस स्टेशन को restaurant में बदल दिया जहाँ वह अपनी चिकन व्यंजन को बेचते थे. उनके फ्राइड चिकन इतने उल्लेखनीय हुए की  वहा के गवर्नर ने उन्हें kentucky colonel यानि kentucky कर्नल का नाम दिया लेकिन 1950 की शुरुआत में senders के इस चलते बिजनेस को वहा पर बनने वाले हाईवे के कारण बहुत नुकसान उठाना पड़ा, सरकार द्वारा दिया हुआ चेक बहुत कम था. लेकिन sanders अभी भी बैठने को तैयार ना था. उसे अपनी चिकन रेसिपी पर पूरा भरोसा था और इसी विश्वास के साथ वह इसकी मार्केटिंग के लिए निकल पड़ा, इस दौरान वह अलग अलग restaurant के मालिक से मिला जहाँ उसे ठुकरा दिया गया. और 1000 से ज्यादा कोशिशो के बाद अंतत: 1952 में pete harman नामक व्यक्ति को उसने अपना पार्टनर बनाने के लिए मना लिया. उन्होंने अपनी फ्राइड चिकन की रेसिपी को पेटेंट करा के 1952 में साल्ट लेक सिटी में पहला restaurant खोला.\n" +
                    "\n" +
                    "Kentucky में restaurant की शुरूआत\n" +
                    "\n" +
                    "लगातार असफलताओं के बाद भी सैंडर्स ने प्रयास करना नहीं छोड़ा. 40 वर्ष की उम्र में वे कार्बिन, केन्टकी आ गए और एक service station खोल लिया. Service station से प्राप्त होने वाली आमदनी पर्याप्त नहीं थी. अतः आमदनी में बढ़ोत्तरी के उद्देश्य से उन्होंने service station के पीछे बने कमरे में एक टेबल और कुछ कुर्सियां डाल दी और वहाँ आने-जाने वाले ड्राइवरों और यात्रियों को पेन-फ्राइड चिकन, हेम, स्टीक व अन्य खाद्य पदार्थ बनाकर खिलाने लगे.\n" +
                    "\n" +
                    "लोगों को उनके बनाये खाने का स्वाद इतना पसंद आया कि वे उनका बनाया खाना खाने के लिए वहाँ आने लगे. लोगों की बढ़ती हुई संख्या देखकर उन्होंने सड़क के दूसरी ओर एक मोटल और रेस्तरां खोल लिया, जिसमें लगभग 142 लोग एक साथ बैठकर खाना खा सकते थे. लोगों को उनका बनाये खाने में Pan Fried Chicken विशेषरूप से पसंद था. अतः वे अपनी इस recipe पर लगातार कार्य करते रहे, ताकि यह unique बन जाये. आख़िरकार 9 वर्षों की मेहनत के उपरांत उन्होंने 11 herbs और spices से युक्त अपनी Pan Fried Chicken की recipe पूर्ण कर ली.  यह recipe उनके रेस्तरां की USP बन गई. सैंडर्स अपने Pan Fried Chicken के कारण मशहूर हो गए. उनका बनाया चिकन केन्टकी के गवर्नर को इतना पसंद आया कि उन्होंने 1935 में हरलेन सैंडर्स को ‘कर्नल’ की उपाधि से विभूषित कर किया.\n" +
                    "\n" +
                    "उनका रेस्तरां अच्छा चल रहा था. उनके रेस्तरां के चलने का एक बड़ा कारण यह था कि वह फ्लोरिडा जाने के मार्ग में अवस्थित था, जिससे उस मार्ग पर गुजरने वाले यात्रियों की नज़र उनके रेस्तरां पर पड़ती और वे उसका रुख कर लेते. लेकिन 1950 के दशक में एक अप्रत्याशित मुसीबत उनके समक्ष आ गई."
    };










    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);this.requestWindowFeature(Window.FEATURE_NO_TITLE);
        this.getWindow().setFlags(WindowManager.LayoutParams.FLAG_FULLSCREEN,
                WindowManager.LayoutParams.FLAG_FULLSCREEN);
        this.getWindow().setSoftInputMode(
                WindowManager.LayoutParams.SOFT_INPUT_STATE_ALWAYS_HIDDEN);
        setContentView(R.layout.activity_msg);

        //toolbar
        Toolbar toolbar=findViewById(R.id.toolbar);
        setSupportActionBar(toolbar);
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

        Intent intent = getIntent();

        str_Stories = intent.getStringArrayExtra("keyArray");
        str_Topic = intent.getStringExtra("keyTopic");
        img = intent.getIntExtra("key5", 0);


        editText = (TextView) findViewById(R.id.editText1);
        button_send = (FloatingActionButton) findViewById(R.id.bMenu);
        txt_topic = (TextView) findViewById(R.id.txt_topicname);
profile=(CircleImageView) findViewById(R.id.profile_image);

        editText.setText(story[img]);
        txt_topic.setText(str_Topic);
        profile.setImageResource(flags[img]);





        button_send.setOnClickListener(new View.OnClickListener() {

            @Override
            public void onClick(View arg0) {
                // TODO Auto-generated method stub
                try {
                    Intent waIntent = new Intent(Intent.ACTION_SEND);
                    waIntent.setType("text/plain");
                    String smsSend = editText.getText().toString();
                    waIntent.putExtra(Intent.EXTRA_TEXT, smsSend);
                    startActivity(Intent.createChooser(waIntent, smsSend));
                } catch (Exception ex) {
                }

            }
        });
    }

    @Override
    public void onBackPressed() {
        this.finish();
        super.onBackPressed();
    }
    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        getMenuInflater().inflate(R.menu.menu_main,menu);
        return true;
    }

    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        switch (item.getItemId()){
            case R.id.btncopy:
                ClipboardManager clipboard = (ClipboardManager) getSystemService(CLIPBOARD_SERVICE);
                clipboard.setText(editText.getText());
                Toast.makeText(getApplicationContext(), "Message copied",
                        Toast.LENGTH_LONG).show();
                break;
        }
        return super.onOptionsItemSelected(item);
    }

}
